[{"username":"Ryuusei Aika","userId":7777875,"isRookie":"FALSE","commenter":"Mirash","comment":"Ryuusei Aika spent this year ranking 6 mapsets by himself, and by joining the Beatmap Nominators group started helping others doing so as well! Ambitious projects with big spreads and a huge backlog of nominations make him the picture of a hard worker, and that is the truth about him! Non-conventional mapping decisions together with song choice make Ryuusei Aika stand out among others. Hope motivation doesn't leave him in 2019."},{"username":"_orange","userId":7094147,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Probably known for his interest in electronic (specifically DnB) music, _orange isn't exactly a prolific name in the mapping sphere. However, his improving skills are looking to change that. His 2018 showed more involvement throughout various DnB mapsets, including quite notably a map of Afterlife by Illenium. The map's interesting usage of slower sliders and fun patterns shows that _orange is a name to look out for as he continues to improve."},{"username":"- Matha -","userId":7354729,"isRookie":"FALSE","commenter":"Halfslashed","comment":"In the midst of all the crazy events in 2018, Matha reminded us that sometimes mapping can just be about ranking cute songs in a simple style."},{"username":"-Light-","userId":6017901,"isRookie":"TRUE","commenter":"Mirash","comment":"Light started his journey in the ranked section this year with two maps for Kanon Wakeshima songs, which provide a great jump experience for your right hand (or left if you are left handed like Light). He also created some other clean maps on strong vocal songs, though he barely hitsounded any. We hope 2019 will bring us even a greater Light than in 2018."},{"username":"-Mo-","userId":2202163,"isRookie":"FALSE","commenter":"Niva","comment":"To be a proficient mapper is one thing; to be able to truly understand the unwritten fundamentals of mapping is another. Perhaps best known for his unconventional mapping experiments on his YouTube channel, over time -Mo- has successfully refined some interesting mapping theories of his own and incorporated them into his maps through various unorthodox yet carefully curated mapping concepts and techniques. Oh, and on top of that he's a QAT manager as well!"},{"username":"-NanoRIPE-","userId":3457553,"isRookie":"FALSE","commenter":"Niva","comment":"-NanoRIPE- is a mapper who, as his profile description states. has been \"enjoying his life (as a mapper)\" -- that is to say, according to our conversation at least, that he loves to do his projects at his own pace without being overly distressed by the immediate desire to push his maps to the Ranked section.  Most of his maps have been very clean, and although many of them have a drain time of 1:30 or less, -NanoRIPE-'s maps are nonetheless adequate for someone who's looking up for a great quick play experience."},{"username":"[ L u k a s ]","userId":8067876,"isRookie":"FALSE","commenter":"Hobbes2","comment":"[ L u k a s ] entered 2018 by mapping a few lower difficulties before really finding his own footing with his STAR BEAT! map which features interesting rhythms on a fun to play map. While most of his diffs were on sets as a guest mapper, you can be assured that any Lukas guess difficulty would get the job done."},{"username":"09kami","userId":443031,"isRookie":"FALSE","commenter":"Mirash","comment":"Not being as active as he used to be, in 2018 09kami succeeded in ranking two interesting mapsets, discovering Chinese pop for the osu! community with \"Fei Zao Jun - Da Lang Tao Sha\" and revealing soothing rhythms with \"Aoki Chihiro - Kodou\", both of which are mapped in a specific style that suits them very well. Will see what 2019 will bring for him."},{"username":"100bit","userId":6181859,"isRookie":"FALSE","commenter":"Mirash","comment":"Despite not being active on osu! almost at all in 2018, 100bit did rank his long-awaited-for pending project, which was a normal difficulty for a death metal song that you usually would expect to be mapped up to a really high star rating. That is where 100bit managed to surprise people's expectations and we will see if he keeps doing that in the next year."},{"username":"10nya","userId":678794,"isRookie":"FALSE","commenter":"Niva","comment":"I've been following 10nya's mapping since the very beginning of her mapping career, and one thing that I noticed is that for the most part 10nya stayed true to her identity as a mapper who took heavy influences from the likes of Guy and Laurier and developed them further into her own. It's rather unfortunate though that for the time being she couldn't be more active in the editor due to her current focus of cosplaying (and studying abroad), but if 10nya decided to come back to mapping someday her maps would be a welcome addition to the Ranked section for sure!"},{"username":23456789,"userId":5413027,"isRookie":"TRUE","commenter":"Niva","comment":"A new and upcoming mapper whose mapping roots can be strongly traced to the Korean mapping community. Although he only managed to rank a single map this year (Zektbach - L'avide), his mapping shows that he has developed his own mapping path with his prominent usage of symmetry."},{"username":"2zz","userId":8201267,"isRookie":"TRUE","commenter":"Mirash","comment":"New mapper that achieved their first ranked map in 2018, a short map for a chill song, called \"tomppabeats - Goodmorningme\" with 4 difficulties mapped by him and one guest easy. Will see what 2019 will bring him to."},{"username":"3mplify","userId":5688171,"isRookie":"TRUE","commenter":"Mirash","comment":"Community driven guy who also sang Dead to Me. That's about it, but he also ranked a Flo Rida track and created a bunch of other maps for hip hop and Russian songs. See him making activity in 2019 as well!"},{"username":619,"userId":6449388,"isRookie":"TRUE","commenter":"Mirash","comment":"New mapper who got his first ranked map in 2018, which is a cut version of \"Draw the Emotional - Just follow time\". Mapped the full spread by himself, good job. Seems like he won't be that active on osu! in 2019, but hope stuff will go smoothly for him and we will see some more maps."},{"username":"A r M i N","userId":5115995,"isRookie":"FALSE","commenter":"Hobbes2","comment":"You've probably played one of A r M i N's maps at least once; he's a common sight on some of the most played mapsets as a guest mapper. His maps, while simple, play well and lend themselves to being easily repeatable. Outside of these types of maps, A r M i N was also the host of quite a few popular mapsets in 2018 as well."},{"username":"Aeril","userId":4334976,"isRookie":"FALSE","commenter":"Halfslashed","comment":"At a glance, there's nothing too special about Aeril. A closer look, though, reveals that he has a sharp understanding of gameplay at each and every difficulty level, something that his mapset of \"COLORS\" shows fairly well. Make sure to keep an eye out for him and his guest difficulties!"},{"username":"Agent_James","userId":7989003,"isRookie":"TRUE","commenter":"Niva","comment":"A native of the very sunny city of Tangerang, Indonesia, Agent_James is a new aspiring mapper who has gained a sizeable amount of recognition throughout the last year from his maps and his participation in several seasonal fanart contests. Having talked with him on a few occasions myself I know that he has some interesting plans for 2019 that are not to be missed out on, so hopefully he can materialize what he has on his mind nicely!"},{"username":"AIR","userId":2070688,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Relatively obscure until the end of last year, AIR spent this year gracing the ranked section with two sasakure.UK sets. His style is heavily reliant on symmetry at a glance, but that definitely does not bind him, as he introduces pattern variety and manages to maintain high movement that isn't straining throughout his maps, leading to very fun gameplay for all kinds of players. For fans of maps made to be fun, AIR is definitely someone you want to watch out for."},{"username":"Aka","userId":1307553,"isRookie":"FALSE","commenter":"Mirash","comment":"Back from a somewhat long break, Aka ranked a pretty long drum and bass marathon in a clean and enjoyable to play style, which shows that time doesn't make you any weaker but in fact only stronger. She has ambitions for 2019 and all we can do is wish for the motivation not to leave her on those projects that have been born in her mind by now and will be executed later on."},{"username":"Akitoshi","userId":4754771,"isRookie":"FALSE","commenter":"Mirash","comment":"God of nor... Akitoshi did very well this year, and that was only to be expected. Being able to map full spreads and also making a modern style \"tech\" map, he surely succeeded in many fields. Ranking 4 sets by himself and, as we all expect from him, a bunch of guest difficulties, 2018 was a pretty solid year for him. Hope 2019 IRL stuff will leave space for osu!."},{"username":"Alumetri","userId":5371497,"isRookie":"TRUE","commenter":"Mirash","comment":"He loves his short maps, made in a well established style that has been proven over the years. He also discovered more Russian music for osu! content, and that's always good for the community. Will be waiting for 2019 to bring Alumetri even more motivation on mapping fields than he had previously."},{"username":"Andrea","userId":33599,"isRookie":"FALSE","commenter":"Niva","comment":"(Sometimes) greatness is achieved not when there is nothing more to add, but when there is nothing left to take away.\" -- Antoine de Saint-Exupery\n\nAndrea is... truly an interesting mapper. Despite his preference for simplistic mapping structure, Andrea is able to incorporate his 10+ years of mapping experience to produce maps that are very clean and interesting thanks to his distinct usage of symmetrical patterns. He's definitely a mapper from whom many could learn a thing or two not because of edgy mapping or such, but rather because of his capability to get everything properly working together in its place without going overboard."},{"username":"tatemae","userId":5223028,"isRookie":"FALSE","commenter":"Mirash","comment":"Formerly known as Anishina Kodoku, tatemae is a dreamer and a romantic who, some may not know, prevented the Russian community from stalling thanks to his useful content. He kept ranking his maps this year too and managed to move 4 of them to the Ranked section for the osu! audience. Clean and attractive maps, interesting and enjoyable patterns, inspiring and warming songs — all of that you can find in Anishina maps really quickly, just download any of them, it's all there, waiting for the strangers to click. 2019 will suffer without him."},{"username":"Anto","userId":276444,"isRookie":"FALSE","commenter":"Niva","comment":"In the mapping scene, some mappers were just destined to be associated with a particular song genre due to their dedication in mapping songs from that genre. You might've observed some of the more recent pairings -- such as galvenize and DnB -- but do you know that many many years earlier, there's already Anto and Italodance? Yes -- with three ranked Italodance maps in 2018, Anto finally marked his comeback after seven years with all of the glories of Italodance behind him."},{"username":"appleeaterx","userId":2407160,"isRookie":"FALSE","commenter":"Hobbes2","comment":"2018 saw another strong year for one of osu!'s best; apple's maps continued to be of consistently strong quality throughout the year. Alongside his hosted sets, apple's GDs were also of top quality, as you'll find an apple's expert on quite a few sets. apple's mastery of making maps fun to play while being a sight for sore eyes consistently lands him on the favorites list of many."},{"username":"Arf","userId":3716999,"isRookie":"FALSE","commenter":"StarrStyx","comment":"Most well known for his Hello Zepp map back in 2016, Arf managed to produce quite a decent amount of maps this year of various genres. Ranging from anime songs and game music to metal and classic rock, there is bound to be a map to fit most, if not all, people's tastes. He's also quiet proficient at timing, which came in handy due to most of his maps having weird timing."},{"username":"Asonate","userId":2907231,"isRookie":"TRUE","commenter":"Niva","comment":"A heavy admirer of val0108's mapping (who even -- according to himself -- \"still unconsciously creates patterns inspired [by] val0108's works while mapping even to this day\"), Asonate is an emerging mapper whose mapping horizon expands towards a vast library within the mapping realm. Even although he only managed to first rank a map this year, his Graveyard section offered plenty of interesting contents (of many different styles as well, ranging from calm songs to alternating maps) which demonstrated his great potential and mapping versatility."},{"username":"Ataraxia","userId":4077912,"isRookie":"TRUE","commenter":"Mirash","comment":"New to the ranked section, a mapper that came in and established from the start that he cares about hitsounding and that, unlike most mappers, he loves to do it. Ataraxia ranked two of his own mapsets and did lots of guest hitsounding for others to suit their maps as best as could possibly be done. Will be waiting for more maps and hitsounding adventures of Ataraxia in 2019!"},{"username":"AtHeoN","userId":1770367,"isRookie":"TRUE","commenter":"Mirash","comment":"An experienced mapper and player who ranked a big and interesting mapset in the year 2018 of the energetic song called \"Kakushigoto\". He is probably known better for his unranked maps though, because they are often done in the hardest way possible, while still managing to capture songs' feeling and not going overboard. You may say that is also because he is a highly ranked player and can actually play what he is mapping. I'm sure AtHeoN will bring us even more interesting ideas and maps in 2019."},{"username":"BaAR_Vendel","userId":8679346,"isRookie":"TRUE","commenter":"Niva","comment":"Most people would probably know BaAR_Vendel more from his dedication to the modding scene -- in which he has statistically been one of the most active modders in terms of kudosu earned per day ratio at the time of writing -- but alongside that, throughout the past year BaAR_Vendel also has offered his own take of Yasashisa no Riyuu to the Ranked section. With his prominent activity in the game, it's definitely interesting to see what the future holds for him!"},{"username":"BarkingMadDog","userId":3475189,"isRookie":"TRUE","commenter":"byfar","comment":"Despite having only ranked a single map in 2018, BarkingMadDog remains a prominent mapper who places emphasis on building clean patterns that focus on the playability aspect. Though his mapping style may stay consistent across different maps, BMD is capable of adding a flavorful twist when the song suggests it. His primary realm of dominance remains in the loved section, where seven of his maps have been selected and passed through community voting."},{"username":"Battle","userId":4037545,"isRookie":"FALSE","commenter":"Niva","comment":"One of Metadata Heap server's most forefront helpers, Battle held on to a strong display on his maps during the last year despite his declining activity rate in general. In all three maps that he ranked in 2018, Battle consistently demonstrated a huge array of versatility in which he was often able to incorporate clever uses of thoroughly adequate jump, stream, and alternating patterns all into a challenging and progressive map."},{"username":"Bearizm","userId":3495259,"isRookie":"FALSE","commenter":"Niva","comment":"The real Ice Bear himself (not fake). Most of the userbase probably knows him from Cold Green Eyes -- the super famous DnB map that has garnered over 6000 favourites at the time of writing -- but his newer works, such as Take Your Way and Kimi no Gin no Niwa, also prove that he is a very versatile mapper who is able to experiment with unorthodox concepts very well and create unique maps that exceed expectations."},{"username":"beenscared","userId":7103149,"isRookie":"TRUE","commenter":"Niva","comment":"In retrospect, beenscared's journey in the mapping scene so far has been a rather unconventional one. Having always been someone who is focused more on playing, one day he decided to create his first map, a 9* rendition of Zetsubou Plantation, for fun. Needless to say his maps were destined to be lost into oblivion after quite a while, but by sheer luck someone from the Indonesian mapping community spotted his true potential and months later here he is -- a promising mapper with two ranked maps to his delight at the time of writing."},{"username":"Beomsan","userId":3626063,"isRookie":"FALSE","commenter":"Niva","comment":"A notable absentee from last year's AYIM, Beomsan finally returned to the Ranked section this year with some really well-constructed maps which were visibly influenced by the likes of Nakagawa-Kanon and handsome among many others. With many of his latest maps being mapped with CS4.5 or higher, Beomsan is definitely a profile you should look up into if you're looking for great and challenging structure-heavy maps to your delight!"},{"username":"Bibbity Bill","userId":4446810,"isRookie":"TRUE","commenter":"Hobbes2","comment":"When he's not mapping, he's sure as heck modding; Bibbity Bill's contribution to maps by modding in 2018 was one of the most active we've ever seen from any modder. Honestly, though, that's probably not what most people know him for; his Honesty map was quite infamous over 2018 as a stream map that saw quite a bit of attention from top players. His clean style and stream design lent themselves to a map that many would end up talking about. Let's hope to see more from this modder and mapper in 2019."},{"username":"bite you death","userId":6398464,"isRookie":"FALSE","commenter":"Hobbes2","comment":"After his breakout in late 2017, bite you death (also known as byd) had a very consistent 2018. Commonly found as a guest mapper, he also hosted a few sets of his own. Despite being on the newer end relatively, you probably couldn't tell if you played his maps going in blind. His clean style and consistent quality feigns years of experience. Maybe 2019 will see him level up to become a proven profecient mapper."},{"username":"Lego man","userId":4116573,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Lego man, also known as blacksocks, bor, imbor, Meat Inspector, HalfsIashed, 102335, _83, pyroflayer, borborygmos, [alt][f4], and Pyroflayer, is a mapper that definitely has an impressive repertoire of maps to match the names he's ranked them under. Few mappers are able to craft lower difficulties as refreshing as his while also preparing players for bigger and better things in the future. If you were a fan of songs ranked in 2014 but are a fan of a more modern approach to mapping, he's definitely a mapper to watch out for - though i'd memorize his user id (4116573) to do that."},{"username":"Blizs","userId":3528699,"isRookie":"FALSE","commenter":"Niva","comment":"Barely making it into this list (with only a single map ranked in very early January) we have Blizs, a figure that has been heavily revered in the Indonesian mapping circle for a long while due to his clean mapping and his thorough understanding of geometrical patterns. Unfortunately Blizs himself has gone inactive since then though, however -- just in case you were reading this -- ScubDomino and AncuL has been looking for you for quite a while actually..."},{"username":"bossandy","userId":360437,"isRookie":"FALSE","commenter":"Niva","comment":"Having been an instrumental figure to the Taiwanese mapping/modding community since 2011, 2018 saw bossandy staying true to his specialty of helping others and putting forward his interesting approach on the creation of low-BPM and calming beatmaps in general. Beyond his mapping, throughout the calendar year he also improved himself to become a prudent storyboarder while personally also being a supportive figure to talk to as always."},{"username":"Bubblun","userId":6191653,"isRookie":"TRUE","commenter":"Niva","comment":"Faithful companion in nanachii's werewolf server who has developed his very own mapping views through his extensive study of broad (and often esoteric) mapping-related concepts. With his maps often characterized by a heavy usage of sharp linear sliders and its variations, it's interesting to note how over time Bubblun has been uniquely incorporating his red anchor-heavy mapping philosophy very well into technical maps and other mapping horizons!"},{"username":"C00L","userId":4930630,"isRookie":"FALSE","commenter":"lcfc","comment":"Known for hosting two successful iterations of the osu!International Discord Mapping Contest, C00L has also made one marathon map and several guest difficulties this year that all are of high quality. It is said the third iteration of his server's contest might be just around the corner in 2019, and so may be more maps of his!"},{"username":"Cami","userId":10286675,"isRookie":"TRUE","commenter":"Mirash","comment":"A new gem that comes to 2019 already showing that he can create pretty decent and well-constructed maps such as \"Kurosaki Maon - Last Desire\" and \"Chata - len\". Cami knows what he wants from mapping and has big plans in mind for the upcoming year of 2019. We will be closely looking into how he will implement those in real life."},{"username":"celerih","userId":4696296,"isRookie":"FALSE","commenter":"Halfslashed","comment":"For fans of rhythm games and Touhou, look no further than celerih. His mapping emphasizes the \"rhythm game\" aspects of osu!, as most of his maps focus on complex and/or straining rhythms while otherwise staying strict to the way the song presents them. Most of this year he was a BN in both standard and catch, striving to promote the highest quality of beatmaps at any given time. We hope to continue to see more from this skilled rowlet in 2019!"},{"username":"Cellina","userId":2490770,"isRookie":"FALSE","commenter":"Niva","comment":"A very prominent figure in the South Korean osu! community (both mapping and playing alike) who has been consistently producing very clean and solid maps throughout the past year. His maps are often highly intense in many aspects yet still sophisticatedly elegant, with many of them bearing an interesting challenge that tests your mastery of various skills in the game."},{"username":"Cheesecake","userId":3700647,"isRookie":"FALSE","commenter":"VINXIS","comment":"The one and only easy diff mapper ranked a well polished set for kors k's der wald remix, making the top 6 star diff himself, showing that he can definitely make more than just low diffs! Definitely his most memorable map (and set) to date, creating a map that is both enjoyable and interesting!"},{"username":"Cherry Blossom","userId":1156742,"isRookie":"FALSE","commenter":"Mirash","comment":"Started by ranking a map at the end of 2018, but that doesn't really matter, as his maps are always welcomed by osu! players and mappers. Making an appearance was an old Touhou track that gives a nostalgic feeling which provided a great experience with influences from the DJPop style of mapping. Hope to see more maps from him in 2019!"},{"username":"Cloudchaser","userId":1576498,"isRookie":"FALSE","commenter":"Niva","comment":"Cloud! It's really interesting actually to see how we both have actually interacted with each other six years ago without us realizing until just recently!\n\nNo stranger to the osu!editor since 2013, it was just only recently that Cloudchaser's name rose in the mapping scene as a prominent member of the Chilean mapping circle. Don't be fooled by her collection of maps that are mostly \"only\" in the 4* range though -- these maps are all very refined and are very fun to play especially for DoubleTime mains!"},{"username":"cococolaco","userId":9579526,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Players and mappers who grew to love the mapping of four years ago need not look further than cococolaco. Relatively new to the scene, coco has delved into the past and absorbed patterning and design philosophies, then combined them with modern ideas of consistency to breed a super enjoyable style for most of the playerbase. His take on \"Kairikou\" illustrates this very well with its vocal focus and conservative spacing choices. coco also mentored in the community mentorship program - looking forward to those who studied under him!"},{"username":"CoLouRed GlaZeE","userId":3189514,"isRookie":"TRUE","commenter":"Mirash","comment":"Despite being new to ranked section he managed to copy some of the older mappers pretty well; that was done not only by using bezier-style sliders, but also through spacing/visuals that really resemble maps that he took inspiration from. Great variety to Chinese mapping community i should say, and that's good. I definitely can say that CoLouRed GlaZeE will make a strong appearance in 2019."},{"username":"Dada","userId":9119507,"isRookie":"TRUE","commenter":"Mirash","comment":"A player and tournament map selector that was strongly influenced by older mapping styles and with motivation to map songs from Umineko, Dada succeeded in ranking a stream heavy, ar8-dt-like map that is enjoyable to play even for a noob like me. Let 2019 not take away his ambition and a new Ryukishi game to come out soon for even more songs for him to map."},{"username":"Dailycare","userId":1634445,"isRookie":"FALSE","commenter":"Mirash","comment":"2018 was a good year for Dailycare (also known as Morinaga). Making the majority of the difficulties by himself, he ranked three mapsets and made a bunch of guest difficulties for others, despite doing military service for almost the whole of 2018. Dailycare went on to join the Mappers Guild in the later part of the year and all I can say is 2019 will take him with a warm hug from the community."},{"username":"Damnjelly","userId":1666355,"isRookie":"TRUE","commenter":"Halfslashed","comment":"Few people have been as successful as Damnjelly with their first ranked map, \"Iwashi ga Tsuchi kara Haete Kurunda\". The mapset shows a great deal of skill and dedication, as the entire spread focuses on a geometry based concept yet also provides great gameplay with a unique challenge that fits the song. These mapset attributes won him the top spot on the April 2018 spotlights. Hopefully we'll see more from him in 2019!"},{"username":"deetz","userId":3513559,"isRookie":"FALSE","commenter":"Mirash","comment":"Never expect people to leave osu! forever. deetz ranked a full spread made by himself in 2019 and did a bunch of guest difficulties. Hope 2019 will see even more deetz maps, or at least one like in 2018."},{"username":"Delis","userId":1603923,"isRookie":"FALSE","commenter":"Mirash","comment":"Kirito has been doing great with his black swords as always. Ranked 10 enjoyable mapsets, each with a unique gameplay experience, that often included no guest difficulties, which shows how determined he is in mapping the songs for a wide audience. Started the year as a part of the Beatmap Nominators Group and ended it with participation in the osu! World Cup as a strong player who complemented Japan's roster greatly. 2018 was very solid for him in every aspect of osu!, and we hope 2019 will bring us even more of Delis!"},{"username":"den0saur","userId":5385151,"isRookie":"TRUE","commenter":"lcfc","comment":"Don't let the fact that he's a rookie fool you; den0saur has had a very stable and fast growth and has caught many renowned mappers' attention for the creativity and versatility seen in every map of his. Furthermore, his skills in hitsounding can also be seen in a handful of ranked maps this year, which is not limited to only his own maps. He's without a doubt a force to be reckoned with for the Rookie Award in this year's Mappers' Choice Awards and we are hopeful he only delivers more next year!"},{"username":"Deramok","userId":1428455,"isRookie":"TRUE","commenter":"Halfslashed","comment":"New to the ranked section but definitely not to mapping, Deramok brings a large variety of reading based challenges with several GDs and his \"Shoujo Shikake no Libretto\" mapset. If you're in the game for maps you'll have to work to FC, this is the guy to watch out for."},{"username":"Diasios","userId":25999,"isRookie":"FALSE","commenter":"Niva","comment":"A very knowledgeable mapper who is probably best known in the mapping community as one of the most prominent modders during the modding v1 era. After last ranking a map in 2013, Diasios (previously known as xxheroxx) returned to the mapping scene this year with a very unique snapping-heavy CS6 map of Triodust & KuensanP - Bad Karma which very much showed that even the oldest generation of mappers still alive could still deliver fresh and interesting content to the game."},{"username":"DJPop","userId":2363,"isRookie":"FALSE","commenter":"Niva","comment":"The man. The myth. The legend himself. Throughout the entire osu! environment, there are only a few names that have made a legacy so impactful to both players and mappers alike, and there were even fewer who have ascended to the level DJPop is at currently. With a heavy emphasis on clever rhythm choice and coherent usage of mapping approaches many have thought to be lost (i.e. Grid Snap-based mapping), DJPop continued to prove that -- despite coming from a totally different generation -- his works and influences were indeed timeless."},{"username":"Djulus","userId":4960893,"isRookie":"FALSE","commenter":"Mirash","comment":"Improving from making short maps in the previous year, Djulus made two TV size beatmapsets and a bunch of guest difficulties for others. Constantly seeking the way for becoming better it is clear that 2019 will be a great year for him and his creations."},{"username":"Doormat","userId":3230571,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Doormat is a prominent figure in the mapping community, contributing heavily with his BN work and in the metadata field. Alongside his contributions, his mapping is no slouch, often having popular mapsets due to his favorite genre (anime) and mapping style. A pleasure to come across in the scene, Doormat is a name you'll find yourself quite familiar with if you're a member of the mapping community."},{"username":"Dored","userId":10284894,"isRookie":"TRUE","commenter":"Mirash","comment":"A new mapper from China, but the maps of whose look pretty different from what you would usually expect from a Chinese mapper. Instead, they resemble 2014-era mapping, and that's great. Being a fan of eroge, he did rank a bunch of songs from various titles, providing content for his fellow brothers from the VN community even outside of China to play. 2018 year of osu! would have suffer without him; we will see how in 2019 Dored will become even more active."},{"username":"Dubturt","userId":6186199,"isRookie":"FALSE","commenter":"Mirash","comment":"Mapper who ranked two beatmapsets in 2018 in which every difficulty was made by him without outside help. That tells much more of him than what I can describe here. He is determined to map osu! maps and can do a whole range of difficulties from Easy to Extra; what else a mapper can desire? That is yet to be discovered in 2019 - wishing luck for him and more motivation to continue!"},{"username":"Enkrypton","userId":5178122,"isRookie":"TRUE","commenter":"Niva","comment":"Despite only ranking a single map with an N-H spread in 2018, Enkrypton's contribution to the mapping scene went far beyond that thanks to his prominent storyboarding works and his other side projects as such as his GD Displayer webtool. Take a look at his storyboards though if you haven't -- they're truly a magnificent feast to your eyes!"},{"username":"ezek","userId":180241,"isRookie":"FALSE","commenter":"Niva","comment":"As a fellow mapper who was also described as \"very old\" in last year's AYIM it's interesting to see that even after another year both of us are still here, isn't it?\n\n...anyway, ezec is a mapper whose mapping wisdom and experience has definitely surpassed many other names in this list. In 2018, exected was able to push forward some interesting content to the Ranked category (including a very unconventional CS6.3 rendition of Harumachi Clover) -- feel free to check them out!"},{"username":"Fatfan Kolek","userId":2308676,"isRookie":"FALSE","commenter":"Mirash","comment":"He kept mapping Toby Fox, making a streak of 5 ranked maps of songs by him; great dedication to a game's music! He doesn't strain himself too much into borders of what is possible and instead maps however he wants to, and yeah, he ranked a 8 star Megalovania track. 2019 is waiting for more maps from him of course."},{"username":"felys","userId":1759427,"isRookie":"FALSE","commenter":"Mirash","comment":"Despite not being that active on osu! felys managed to move one of his older creations into the ranked section and it was indeed a great choice as this map of a song from beatmania was totally worth it! He also started some maps which await their time coming in 2019! Alongside his mapping, he organized an Italian Beatmapping Contest which hopefully will drive the community of Italy to their best times."},{"username":"fieryrage","userId":3533958,"isRookie":"FALSE","commenter":"Hobbes2","comment":"fieryrage made a name for himself as a mapper in 2018, ranking a plethora of challenging maps (often exceeding 7 whole stars) and representing quite a large variety of songs in the ranked section, ranging from rock to american TV show openings. Along with his entrance to the BNG, fieryrage managed to prove that he's a capable mapper, modder, and player; not an easy task!"},{"username":"Frey","userId":695678,"isRookie":"FALSE","commenter":"Mirash","comment":"A mapper that always manages to surprise with his clean and very enjoyable to play maps who managed to rank 2 of his mapsets in 2018. As always they were done in a style that can be hardly seen these days, despite being great. Simple patterns, squares, variable rhythm and hitsounds that provide pleasant gameplay. See him in 2019 again!"},{"username":"Frostings","userId":2652543,"isRookie":"FALSE","commenter":"Niva","comment":"Frostings is a name who, despite not being the most prolific by any means, really has the potential to break himself away as an extraordinary mapper in the eyes of the entire community soon enough. He may have only ranked two maps so far, but both of them (which were stream-heavy) have been critically acclaimed with his Calamity Fortune set even having been included in an OWC mappool. Truly a deserving name to set your high hopes upon!"},{"username":"Frostmourne","userId":199669,"isRookie":"FALSE","commenter":"Mirash","comment":"Frostmourne, or FrostxE, came back this year to rank his \"ChouCho - Aozora no Kodou\". Always nice to see such big names returning and providing content for players and their admirers to enjoy! As always, the map is done in a clean style, capturing the song's feeling very well and providing gameplay that touches your heart, making you want to play these maps more than. Hopefully will see him in 2019 as well!"},{"username":"FunnyA","userId":8239380,"isRookie":"TRUE","commenter":"Niva","comment":"I can't forget how FunnyA at one point, as a relatively inexperienced mapper, showed me her My First and Last map and asked me to take a look at it. Needless to say, the map was a huge mess -- the entire foundation of the map was nonexistent and the objects were incorrectly snapped to 1/4 on a 1/6-based song. Fast forward a few months later and the map got Ranked with FunnyA herself showing an incredible improvement mapping-wise. It was truly a great experience to be a part of, really."},{"username":"Fushimi Rio","userId":1205412,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Simplicity is good and all for eroge tracks, but an interesting take such as that offered by Fushimi Rio aka imoutosan is always appreciated. His mastery of gameplay really shows with his slider designs and overall spacing philosophies, which create high paced gameplay that is both fitting of the song and very enjoyable. Hoping to see more of this awesome mapper in years to come!"},{"username":"Gabe","userId":654108,"isRookie":"FALSE","commenter":"Niva","comment":"BN, BAT, QAT, GMT, Mappers' Guild member, Mapping World Cup host, Christmas Queue organizer, #osu-loved contributor... Name a single position in osu!, and chances are Gabe has been involved with said directive in one way or another. As with the year before, in 2018 Gabe continued to be a beloved community member whose contributions were more visible in the background, but up front he has also managed to rank some interesting maps for all kinds of players to enjoy."},{"username":"Gens","userId":23062,"isRookie":"FALSE","commenter":"Niva","comment":"After nearly six years of inactivity, Gens surprised the entire mapping scene in 2018 not only by managing a to rank a couple of maps, but also by revealing that in all these years he has been profoundly keeping himself in vision with the world of mapping while also working on some un-submitted maps every now and then. His maps may be structurally different compared to most modern maps, but don't let it fool you -- each of his maps promises a unique experience!"},{"username":"Gero","userId":1467715,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Gero continues to stand the test of time. Despite a mapping style many would consider 'dated', his maps continue to thrive in the modern era with fun to play maps of some actual bops. Interestingly, Gero's mapping has become more freestyle as time has gone on, as he has begun to experiment with different ideas. Although his maps maintain their roots in his older techniques, his newer developments show that Gero has much more to offer us as the years go by"},{"username":"Gillstar","userId":7948210,"isRookie":"TRUE","commenter":"Niva","comment":"Although he only managed to rank a single mapset very late into 2018 and his name is still relatively obscure to many at this point, his understanding of mapping is definitely not something to be underestimated. Unlike many other beginner mappers out there who often were still in search of their mapping identity, Gillstar has already proven himself as a very solid technical/alternating map specialist with a very distinct EvilElvis influence and is definitely a name to look forward upon in 2019."},{"username":"Glaceon","userId":5545437,"isRookie":"TRUE","commenter":"Hobbes2","comment":"Glaceon is one of the newest mappers on this list, ranking their first map in mid-late December. As with any new mapper, Glaceon is full of potential. Hopefully they can expand on their skills in 2019!"},{"username":"GoldenWolf","userId":1612624,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Known for keeping Demetori at the forefront of the ranked section since 2014, GoldenWolf definitely started off the year strong with his take on \"Furuki Yuanxian\", which showcases his mastery of stream design and overall rhythm. However, he has also started to branch off by mapping other metal artists such as Persefone, and dedicated his efforts towards remixing popular anime songs as an aspiring musician throughout the earlier parts of the year. If you don't think anime songs have enough interesting rhythm, keep your eyes peeled for the next \"GoldenWolf Metal Mix\"."},{"username":"Gordon123","userId":2789905,"isRookie":"FALSE","commenter":"Niva","comment":"Fellow Ib enthusiast whom I've been closely collaborating on several occasions. Unlike many other names on this list, Gordon123 specializes himself more on the art of crafting maps at the lower end of the star rating and creating chill storyboards in general -- definitely a great profile to visit at if you're looking for maps to unwind yourself after a rough and stressful day!"},{"username":"gowww","userId":119404,"isRookie":"FALSE","commenter":"Niva","comment":"It has been no secret that gowww has been a name long missed in the mapping scene by many. Prior to last year, his previous ranked map was actually \"xi - Time files\", a solid stream-heavy map that I pushed into rank during my BAT days in 2012. Needless to say, it was really nice to see gowww came back to the mapping scene in 2018 with Suna no Wakusei. complete with his trademark overlap-heavy flow and prominent usage of distorted 3/4 sliders that has been loved by many since a long time ago."},{"username":"Gust","userId":1244312,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Gust, also known as Ultimate Madoka, continues to keep older difficulty settings more relevant along with his pattern based style. Particularly for tournament mappoolers but also for fans of older challenge maps, this is a guy you don't want to forget about, as he produces maps with wider angled jumps on AR8 and CS5 difficulty settings that are of good quality on full version songs. The future is bright with a mapper like this around."},{"username":"haha5957","userId":412787,"isRookie":"FALSE","commenter":"Niva","comment":"Normally when a mapper comes back to the mapping scene after a long hiatus, the mapper tends to bring something completely new with a hope to fit with what's trending nowadays. Not with haha5957 though -- instead of doing everything all over from scratch, he instead took an interesting approach to remaster Croatian Rhapsody, a song he ranked before in 2012, in a completely new mapset while still keeping the same general atmosphere of the original mapset that has been played over 1.5 million times. The result is beautifully compelling!"},{"username":"DJ Lucky","userId":5226970,"isRookie":"FALSE","commenter":"Halfslashed","comment":"A somewhat new name to the scene, DJ Lucky (more famously known as Hailie) mapping sates the niche of players who can't get enough of harsh cursor motions and tricky reading challenges, as well as fans of Diao ye zong. Challenge seekers will have a lot of work to do with maps like hers ranked last year such as \"Shiten\" and \"Shinzou Connect\". Maps like \"Sandglass\" also show that even a calmer song can produce a highly engaging map without going overboard. Quite impressive handling of gameplay at times, despite their lack of play experience."},{"username":"Half","userId":7515767,"isRookie":"TRUE","commenter":"Halfslashed","comment":"New to the scene, Half brings a modern take on some legendary songs in osu! by Hatsuki Yura, as well as two arrangements of \"Ringo Uri no Utakata Shoujo\". If you're into simpler maps with good songs, here's your guy."},{"username":"Takekii","userId":6443117,"isRookie":"TRUE","commenter":"Halfslashed","comment":"By temporarily name changing to \"Hanasaka Yui\", Takekii made sure to go above and beyond the call of 2017's most popular song, \"Harumachi Clover,\" by becoming one with the singer herself, then mapping a difficulty on \"Aozora Morning Glory (TV Size)\". Aside from that, he did rank a mapset of his own, further cementing his tastes in anime/eroge songs. Fans of these songs will be delighted in 2019, i'm sure."},{"username":"handsome","userId":2123087,"isRookie":"FALSE","commenter":"Hobbes2","comment":"A mapper who needs no introduction, handsome's 2018 was as clean as ever. The year saw handsome push his style to the limit, with maps such as Eiyuu Unmei no Uta and T&J challenging players in unique ways. While he didn't have as prolific a project as say Impulse from 2017, his consistent map quality continues to place handsome as one of the best mappers of the year. To put it succently, he's alright, I guess."},{"username":"hi-mei","userId":4574165,"isRookie":"FALSE","commenter":"Hobbes2","comment":"handsome's Impulse might have been one of the most popular maps from 2017 among mappers, but it's actually not the only one; hi-mei's map of Impulse demonstrated his unique visuals and slider design and contains some interesting patterns. hi-mei's more well known creation, Be Wild, truly demonstrates his mapping philosophies: not taking players for granted and knowing that patterns that might seem impossible are actually more than doable."},{"username":"Hinsvar","userId":1249323,"isRookie":"FALSE","commenter":"Niva","comment":"Despite being relatively more active on the moderation side since his promotion into the GMT earlier in the year, Hinsvar kept on holding strong towards the mapping scene through his endless dedication on mapping melancholic songs as has been his trademark since 2013. Now that he's nearing completion of his studies and is ready to return his focus back to mapping, it's safe for us to expect more maps coming from him in the near future!"},{"username":"Hollow Wings","userId":416662,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Hollow Wings hasn't failed to show the mapping community unique map designs with extreme attention to detail into gameplay and song representation in the past few years, and she certainly hasn't failed in 2018. This year hollow wings ranked an electronic song with high paced reverse sliders as the focus, a CS7 map with interesting stream designs, two highly varied swing songs, and more. As always, it will be interesting what kinds of unconventional ideas HW will bring about next year, and a pleasure to continue to see her art!"},{"username":"HypebeastHijabi","userId":1786945,"isRookie":"TRUE","commenter":"Mirash","comment":"HypebeastHijabi, better known as Kaine, started this year by ranking his first ever beatmap for the charming song \"The Marias - Only in My Dreams\" and ended it with a weird artist name's map called \"YUNG BAE - Sailor Babe\". Making the right decisions about placements in those maps, he also did fancy stuff that provides additional experience such as hiragana sliders or really slow and small sliders that fit songs so much. He surely will continue to surprise the ranked section in 2019 year as well, so best of luck to him."},{"username":"Hysteria","userId":2320429,"isRookie":"FALSE","commenter":"lcfc","comment":"Hysteria ranked two sets in 2018, with the most prominent being Crystalia by DJ TOTTO. While being a very fast song, Hysteria managed to create a difficult, yet fun experience with their map. If the top difficulties are too fast for you, worry not, for there are lower difficulties catered to all skill levels."},{"username":"i love traps","userId":5134380,"isRookie":"TRUE","commenter":"Halfslashed","comment":"Also known as rawrneru, i love traps makes an unexpected appearance into the ranked section with his take on \"Youka to Yumeutsutsu\" - a map that shows quite a bit of proficiency in overall design and song representation, without going overboard. He really lived the dream when he used this to apply for the mentorship program, only to be denied because the map was too solid. Looking to see more from him in the future!"},{"username":"Icekalt","userId":5410645,"isRookie":"TRUE","commenter":"Halfslashed","comment":"Nearly in disbelief that he's a new mapper, as Icekalt has shown off a high level of quality throughout several mapsets and song genres throughout the year. Icekalt also contributed to the community as a member of the BNG, mentor, and mentorship program organizer. Definitely many things accomplished this year and a potential rookie of the year; his future is looking very promising."},{"username":"idke","userId":4650315,"isRookie":"TRUE","commenter":"VINXIS","comment":"Big Kite fan who made his mapping debut with a hard and exciting Asriel - Abyss map, showing his influences with a clearly defined style while also making an enjoyable beatmap! Although that's his only ranked map, it would be really cool to see him rank some more maps in the future, showing his growth as a mapper as well!"},{"username":"ImpurePug","userId":3124248,"isRookie":"TRUE","commenter":"Halfslashed","comment":"A follower of the Shimotsuki Haruka clan, ImpurePug comes to the ranked section with their take on PinkHeart's style, which in time ended up almost going hand in hand with his songs of choice. For fans of clean maps with enjoyable gameplay, the future looks bright."},{"username":"IsomirDiAngelo","userId":7715620,"isRookie":"TRUE","commenter":"Mirash","comment":"New name that came to the ranked section with an interesting map on a song, or I'd say on sort of a compilation of songs, \"Eine Kleine - Kyouki Douwa 'Daiyonshou OZ'\", accompanied by a themed storyboard; the experience this map provides surely needs to be seen by everyone. Great job on another map for a gothic-metal song, \"Unlucky Morpheus - Angreifer\". Long streams with spaced jumps do a good job in representing such a powerful song. IsomirDiAngelo will provide great maps in 2019 as well, pretty sure; let's wait for it."},{"username":"J1_","userId":5918561,"isRookie":"TRUE","commenter":"Niva","comment":"Looking back, I'm sure no one was expecting J1_'s meteoric rise in the mapping scene throughout the last year. A name foreign to many at first, his first major breakthrough came when he shockingly finished 3rd in the French Beatmapping Contest which was soon followed after by his victory in Pending Cup #6 and his welcome entry to the Mappers' Guild despite having zero ranked maps prior. He's... definitely a mapping prodigy, although for me the word \"prodigy\" is still an understatement for a mapper of his caliber."},{"username":"Jenny","userId":579428,"isRookie":"FALSE","commenter":"Hobbes2","comment":"2018 marked the return of renowned mapper Jenny, who showed off her skills yet again with the fantastic map Nhato - Magic. Featuring complex patterns and challenging rhythms, this map showed that even the older mappers among us often still have what it takes to stick out. Despite not mapping for a while, her execution is just as good as ever. Hopefully she can continue her efforts into 2019 as well."},{"username":"jimmy55555","userId":6038918,"isRookie":"TRUE","commenter":"Mirash","comment":"New mapper that got good pretty fast. Ranked two solo difficulties in a style similar to the old days that follows the song nicely and isn't overdone. He is also good at timing songs, which is a skill not everybody has. Good job; will be looking for more stuff in 2019 from him!"},{"username":"Jonis221","userId":3446298,"isRookie":"TRUE","commenter":"Niva","comment":"Having taken the uncommon route of being a specialist in mapping Western-oriented pop and video game songs in general for quite a while, Jonis221 (previously known as EggsGone) finally debuted in the Ranked section last year with his interpretation of the short chiptune song Iuri Rodrigues - Junkyard. It might not be much, but it is a delight to be cherished!"},{"username":"Kaifin","userId":2596942,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Kaifin started 2018 off with a bang, ranking Polygon, a mapset which features insanely challenging patterns playable by only the most skilled among us. This would set the stage for what would be a fantastic year of mapping by someone who was truly able to translate their playing talents into their mapping ones. Any Kaifin map you play is sure to test skills you didn't even know you had, regardless of the star rating."},{"username":"Kaitjuh","userId":2225327,"isRookie":"FALSE","commenter":"Niva","comment":"A Quagsire devotee who has been mapping since a couple of years ago but hasn't really gotten his moment to shine until the past year where he improved greatly. Aside from getting accepted to the BN role, in 2018 Kaitjuh had some interesting maps up his sleeve such as his Wa -cycle- map in which he utilized clever linear jumps on a small circle size. With all that in mind, he will be an interesting name to watch in 2019 hopefully!"},{"username":"Keada","userId":2785549,"isRookie":"TRUE","commenter":"Halfslashed","comment":"Keada debuted onto the scene by picking up where legendary mappers left off: mapping more Demetori. Sometimes it really is that simple."},{"username":"Kroytz","userId":2339768,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Kroytz is well known for his maps of absurd difficulty, but 2018 saw him take it to the next level. While most mappers don't dare to tread the 8 star level, Kroytz managed to rank 5 mapsets featuring 8+ star difficulties (including the deadly iLLness LiLin, which boasts 3 whole passes). Despite this, he's also made quite a few maps at a level more friendly to the general audience, be it his lower extra diffs or his sets of songs that just don't support 280 BPM streams. Regardless of the difficulty, Kroytz' highly structured mapping style is sure to please the eyes. Just....maybe not the hands."},{"username":"ktgster","userId":53378,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Elite Mapper ktgster continues to bring interesting challenges to the ranked section, sometimes on the most unexpected of songs. Not many mappers have the level of mastery over map design that allows them to keep such a consistent style that brings about very enjoyable gameplay, especially not with the variety of tricks he's able to pull out. Looking forward towards his continued contributions to the ranked section!"},{"username":"lazyboy007","userId":7882675,"isRookie":"FALSE","commenter":"Niva","comment":"lazyboy007 is a mapper whose focus has shifted more into osu!taiko mapping throughout the past year. Although he is perhaps most famous for his Piccadilly mapset that was featured in this year's osu!taiko World Cup, in 2018 he also managed to rank his Road To The LegenD mapset which boasts various interesting cut-stream arrangements and high-intensity jumps -- definitely something worth to be checking out if you're looking for a streamy challenge map!"},{"username":"lcfc","userId":7322726,"isRookie":"FALSE","commenter":"StarrStyx","comment":"He's okay."},{"username":"Leader","userId":631530,"isRookie":"FALSE","commenter":"Mirash","comment":"Surprising to see Leader being that active on osu! for most of the year. He moved to the ranked section not onyl some of his already finished maps but also a bunch of fresh ones, including interesting collaborations (though some of them took too much time). Hoping for 2019 to become an even better year for him regarding mapping."},{"username":"Left","userId":5062061,"isRookie":"FALSE","commenter":"Niva","comment":"An extremely dedicated rhythm game (and eroge) player who has studied the likes of handsome and Karen's mapping extensively. With regards to his acquired knowledge of charting in other rhythm games as well, he has since developed and perfected a very distinct mapping style that often represents the music in a unique fashion through his mastery of slider creation, slider velocity manipulation, and visual pattern arrangement."},{"username":"Lorkee","userId":4262435,"isRookie":"TRUE","commenter":"Niva","comment":"I first heard of Lorkee on EvilElvis' old Discord server, when someone linked out and recommended his Tak a ja lubie map sometime after it got Ranked. To my curiosity I downloaded the map, and oh boy it's indeed a good one! With all the clever and cunning use of stacks and anti-jumps, the map already has that estabilished feeling to it despite Lorkee only being classified a Rookie mapper this year. It's unfortunate that he went rather inactive after that though..."},{"username":"m3gB3g","userId":5610245,"isRookie":"TRUE","commenter":"Mirash","comment":"A long journey of trying to make a fun and a comfortable map, suitable for the ranking page, has finally come to success. m3gB3g has ranked a short mapset of the opening for the TV show \"My Life as a Teenage Robot\". With a bunch of unranked beatmaps as well, m3gB3g managed to spend 2018 focusing on the improvement of his creations; we will see where that will lead him in 2019."},{"username":"m980","userId":3288,"isRookie":"FALSE","commenter":"Niva","comment":"Having been \"here since the beginning\", it was certainly a surprise to see m980 coming back to the mapping scene this year after around seven years of absence. In line with his background of being a prominent iNiS map scholar, he marked his return by ranking Jumpin' Jack Flash -- an iNiS-authentic map that sparked a strong sense of nostalgia to everyone who has played the original Ouendan game at some point. Needless to say, welcome back to the mapping scene!"},{"username":"Marmowka","userId":2907237,"isRookie":"FALSE","commenter":"Mirash","comment":"Marmowka came back from military service to bring three mapsets into the ranked section, all of Russian songs with a dubstep remix. Gone to a halt at the end of the year, but, as we all know, you can't leave osu! forever, so will see him in 2019!"},{"username":"Mechanizen","userId":6168393,"isRookie":"TRUE","commenter":"byfar","comment":"If I had to use a word to describe Mechanizen's mapping, it would be \"fearless\". While having shown little activity in the year of 2018, Mechanizen has shown remarkable technique in song representation. With several refinements in the aesthetic department, there is no stopping him in conquering the mapping scene of 2019"},{"username":"milr_","userId":4485933,"isRookie":"TRUE","commenter":"Niva","comment":"A great individual and mapper who heavily took influences from a select list of mappers of various generations (including the very beginning) and developed them further to make them his own. Don't let the listing of Ranked maps on his profile fool you though -- on his own he may only seem to rank chill songs so far, but beyond that he has marked his name through his high placing throughout various mapping competitions and his captivatingly made guest difficulties on mapsets such as Altros and Crystal Illusion."},{"username":"Mir","userId":8688812,"isRookie":"FALSE","commenter":"Mirash","comment":"After the huge contribution that Mir provided for osu! in various ways, he decided to himself that enough was enough and resigned from QAT position and decreased his activity at the later half of 2018. That doesn't mean he stopped mapping, though! Mir created some cool guest difficulties and ranked a large number of 22 mapsets. I wish I had such passion and amount of motivation, but at any rate, I'm sure he'll keep doing what he's been doing in 2019 and make osu!'s life better."},{"username":"Mirash","userId":2841009,"isRookie":"FALSE","commenter":"Niva","comment":"Something is bothering me lately -- is Mirash a \"tech\" or an \"old\" style mapper? Regardless, I know for sure that Mirash is an extremely talented mapper whose creations are greatly adored and looked up to by many in the community (myself included). With many of his maps having been critically acclaimed by being featured in various beatmap spotlights and community tournaments, you're definitely missing out oni something big if you haven't checked out any of Mirash's maps!"},{"username":"Mismagius","userId":19048,"isRookie":"FALSE","commenter":"Niva","comment":"It's never easy to achieve excellence on both sides of two constrasting edges. Yet Mismagius -- who has in the been mapping scene since 2009 -- has managed to win the hearts of many through his two sides of mapping: through his chill maps, which have received critical acclaim every now and then (to the point that Ephemeral once said on Twitter \"[they] have always been like a breath of fresh air\") and through his more hardcore maps that have also been a favorite to the playerbase. This, by any means, is truly a display of his remarkable versatility."},{"username":"mithew","userId":2571893,"isRookie":"TRUE","commenter":"Hobbes2","comment":"15 minutes of drain, 6.8 stars, high bpm streams mapped to a long progressive metal song: a project like Painters of the Tempest is what you'd probably expect from a seasoned mapper with plenty of qualifications. That's why it might have been a surprise to many to learn that this fantastic map was made by someone who had not yet ranked a single mapset. mithew burst onto the scene with what you could call one of the most unique \"first ranked map\"s out there. This also isn't to mention his plethora of GDs, including an expert on a Kroytz set that isn't too far off the top difficulty."},{"username":"MoodyRPG","userId":464889,"isRookie":"FALSE","commenter":"Niva","comment":"MoodyRPG is a mapper from the older ages who, after years of consistently dedicating himself to mapping video game soundtracks almost exclusively, managed to strive and adapt into almost every age of mapping without deviating too much from his roots. As a result of this, his maps -- which often relied on clean Distance Snap-based patterns -- often evoke a sense of nostalgia to players while still being solidly in compliance with the evolving quality standards of the modern era."},{"username":"Mordred","userId":7265097,"isRookie":"TRUE","commenter":"Halfslashed","comment":"Full version anime maps were going extinct at the beginning of 2018, but Mordred refused to let them die out as he spent a good portion of the year putting out several 3-4 minute sets pre-spread rework. Stylistically, he tends towards a generic style with squares sprinkled about, but shows that he can make well-designed and interesting maps with his top difficulty on \"Fable\". He has also spent time as a BN for most of the year and towards the end became an organizer for mentorship. 2018 is not the last we'll be seeing of him, I'm sure."},{"username":"Namki","userId":5248582,"isRookie":"FALSE","commenter":"Mirash","comment":"2018 was a special year for him because he finally made it to the beatmap nominators group and started helping others to push their creations. He also succeeded in ranking 5 mapsets, providing a good variety of tracks for the community, even including Russian versions of anime openings. He shows no signs of stopping and 2019 is waiting for him."},{"username":"negusver","userId":10630851,"isRookie":"TRUE","commenter":"Halfslashed","comment":"An unknown name to most, negusver brought a mapset of \"Lv.0\" to ranked. It's quite rare to see a new mapper enter ranked with such a polished map and even rarer on a song this complex. Watching him develop further will be an interesting journey for everyone involved."},{"username":"NeilPerry","userId":841391,"isRookie":"FALSE","commenter":"lcfc","comment":"Mostly known for his slider-heavy maps, NeilPerry took this year's mapping scene by storm and only became better at what he's already known for. Including but not limited to collabs with renowned mappers such as the likes of rrtyui and Sing, he hosted several mapsets of electronic music accompanied by a list of other renowned mappers as well. If slider-heavy maps are your cup of tea, then it's highly encouraged you check his mapsets out; it's a certainty there will be something you like!"},{"username":"Nerova Riuz GX","userId":1557955,"isRookie":"FALSE","commenter":"Niva","comment":"Often referred to as N/A, Nerova Riuz GX is a mapper whose mapping style has been very well adapted to the native sound of rhythm gaming, savvy electronic beats, and so on. His maps often sport a great variety of dynamic patterns and interesting stream sequences, but what truly connects his maps to one another is his decision to often incorporate uncommon circle sizes outside the usual CS4 mapping meta. Oh, and on top of that he's a really proficient Taiko mapper and storyboarder as well!"},{"username":"Net0","userId":5099768,"isRookie":"TRUE","commenter":"Mirash","comment":"After a long period of trying to become a part of the beatmap nominators group, he finally did it in 2018, and it proved to well deserved as he has done a great job with his position. Other than that, he made his style more distinguishable and succeeded in his Grave Revival Project by taking graveyarded maps from old mappers, making whole sets for them and pushing them to the ranked section. By the end of the year he managed to rank a total of 14 mapsets for people to play. He also did a lot of activity in his internal Brazil mapping Discord server, keeping the community alive and moving forward. Net0 did the best he could in 2018; great job! It's worth noting that he also is just a rookie; what a legend."},{"username":"Nevo","userId":7451883,"isRookie":"FALSE","commenter":"Niva","comment":"Not to be confused with Niva, Nevo is a mapper who in the past year has been working really hard to enhance his reputation as one of the great sages of the hex-grid mapping branch while also being incredibly prolific with his works and other dedications in general. Not only that, he's also known as a very nice and supportive individual throughout and someone who has mastered the secret of the blobs!"},{"username":"Nitroz","userId":5256529,"isRookie":"TRUE","commenter":"Niva","comment":"As one of the most prominent members of the osu!restoration project, Nitroz came into the mapping scene with a personal goal unlike any other: to pursue the long-lost older generation mapping philosophies through conserving the relics of the ancient mapping styles. Needless to say, his only ranked map this year -- I Love Egg -- reflects that goal very well; he was able to bring a sense of nostalgia to many players through his mapping and the inclusion of names such as Card N' FoRcE, mtmcl, Gens, and m980 in the mapset."},{"username":"Noffy","userId":1541323,"isRookie":"FALSE","commenter":"Niva","comment":"To begin with, I genuinely don't know if there's a bigger Vocaloid enthusiast in this list than Noffy -- even in the very beginnings of her mapping journey, Noffy was always someone who was incredibly dedicated to mapping Vocaloid songs. As well as being a very prominent storyboarder and metadata researcher, over the years Noffy's dedication to the subject has turned her into a walking Vocaloid encyclopedia -- if you're looking for assistance regarding your Vocaloid maps, Dr. Noffy Noff Noffers is rest assured ready to help!"},{"username":"Nokris","userId":5960077,"isRookie":"FALSE","commenter":"Mirash","comment":"Nokris was very active at the start of 2018 but his activity came to a halt in the later part of the year. Previously ranking mostly marathon maps, he mapped and ranked two big spreads in which the whole set was done by himself, showing how passionately persistent he is when his motivation is high. As always, we will see him next year for maybe an even greater period of activity."},{"username":"not very smart","userId":3696423,"isRookie":"TRUE","commenter":"Niva","comment":"It's not often that we see a rookie mapper debuting him/herself in the Ranked section with a 7* marathon map, let alone ranking a map with a plethora of timing sections. But that's just what not very smart (previously known as Flezlin) did -- his only ranked map of the year, a rendition of Hanatan - If, was in general a very well made map that greatly defies the public's expectations with all the carefully curated high intensity jumps and artistic merit."},{"username":"Okoratu","userId":1623405,"isRookie":"FALSE","commenter":"Mirash","comment":"In the year 2018 Okoratu, otherwise known as Okorin, stepped back from being very active to \"still being not dead but having fewer responsibilities\". Don't get it wrong though, he is still contributing a great amount through leading the mentorship program, correcting ranking criteria, occasionally nominations of something he found being interesting enough for the ranked section, and more. Speaking of mapping, he managed to rank 4 anime sets, the difficulties of which mostly were done by himself alone, which is amazing. Hope that 2019 will see more maps by Oko! [s]Nageki no Mori[/s]"},{"username":"Opsi","userId":8305062,"isRookie":"TRUE","commenter":"Hobbes2","comment":"A mentee of renowned mapper ProfessionalBox, Opsi managed to catch eyes with his dazzling first ranked map, Light it Up by Camellia. The map features the technical rhythms and challenging patterns you'd expect from a Camellia map, but put together by an newer mapper. Unfortunately, it was his only project, so we didn't get to see Opsi develop through the rest of 2018. Here's to hoping for the return of an impressive rookie."},{"username":"PandaHero","userId":1233255,"isRookie":"FALSE","commenter":"Niva","comment":"For me, looking at PandaHero's maps in a sense is like reminiscing at the early days of traditional Russian-style mapping in its earlier days a la tieff and La Cataline, a style that has been long adored by many -- slightly curved sliders, anti-jumps, doubles and other improvised rhythms, godlike hitsounding... PandaHero's maps often have it all. Her maps are a great example of how one can further elevate a shining legacy of the past by staying faithful to their mapping inspirations at heart."},{"username":"Parachute","userId":1175275,"isRookie":"TRUE","commenter":"Mirash","comment":"Parachute started his career as a mapper long ago, well before his first ranked beatmap, which happened in 2018. That map was a ZUN Touhou track made in a clean symmetric style that can be also considered something \"old\" - but that doesn't mean anything bad; moreover, Parachute did it just right so that it feels good even now in 2018. Glad that we have that diversity in the mapping scene, and can say that surely 2019 will be a good year with maps from him."},{"username":"Pentori","userId":7452237,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Being a professional HotS player wasn't the only interesting thing about Pentori; 2018 was another display of his profiency in combining visuals and movement in order to create a splending play experience. While not his most active year, the maps he did rank managed to stand out."},{"username":"Pereira006","userId":537344,"isRookie":"FALSE","commenter":"Niva","comment":"Hailing from of the beatiful archipelago of Azores, Pereira006 is an experienced mapper who has been extremely prolific in producing maps of various video game songs since his first appearance in the Ranked section back in 2011. Last year saw him being arguably more active in the moderation department due to his re-admittance to the GMT, but worry not -- Pereira006 still contributes to the mapping scene as well every now and then."},{"username":"Pho","userId":3624692,"isRookie":"FALSE","commenter":"Niva","comment":"Pho may be best known in the community for his ultra-high intensity 7* maps such as Yakubyougami or HIBANA, but looking beyond, Pho is actually always a very capable and versatile mapper himself. His catalogue of maps has proven himself as a mapper who has been able to nail a wide variety of songs from stream-intensive maps to alternating tech maps -- all delivered through a very clean yet crisp mapping style!"},{"username":"pinataman","userId":1235485,"isRookie":"TRUE","commenter":"Hobbes2","comment":"pinataman ranked his first mapset in 2018, Thaehan - Saiyajin. Unfortunately, he's been mostly inactive since. Maybe he will return in the future to show us if he can improve beyond his rookie status."},{"username":"pishifat","userId":3178418,"isRookie":"FALSE","commenter":"Hobbes2","comment":"pishifat needs no introduction. There's a reason he's constantly voted as top community contributor; his mapping videos and contributions to the ranking criteria are well respected among the community. He even manages the Mapper's Guild program alongside being a QAT. The zinger? All of this is before even considering his mapping talents. In the past year, pishifat continued to push his skills, spending a portion of 2018 attempting to make interesting maps on songs you wouldn't expect them from. To put it succintly, he's alright, I guess."},{"username":"Plaudible","userId":7149815,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Plaudible continued to find success in 2018; a combination of his song choice and fun to play mapping style lent him some mapsets with very high playcounts. If you're a fan of electronic music, Plaudible's maps are must plays, as his musical expression is top notch. While he retired from the BNG in 2018, a recent return to activity shows hope for a strong 2019 as well. Here's hoping!"},{"username":"PoNo","userId":4610047,"isRookie":"FALSE","commenter":"lcfc","comment":"Mostly known for his stream-heavy maps and pretty storyboards, PoNo certainly makes sure he leaves his mark on this year as well. Though he focused more on making storyboards for several popular maps in 2018, he also ranked a song of the renowned band Imperial Circus Dead Decadence as well as several guest difficulties. Rumors say he's planning to rank more stuff in 2019, and his versatility he's shown in his maps currently in the graveyard can ensure us that great maps await!"},{"username":"pyrowar56","userId":5330236,"isRookie":"TRUE","commenter":"Niva","comment":"I first heard of this mapper by accident, really -- back then I was searching for a neat and comfortable map to put in the DT pool for a tournament mappool when I stumbled upon his Mienai kara, Mieru Mono map (which was AR8 while still Pending). I was pleasantly surprised to see his maps are so well constructed while also offering some interesting stream constructions here and there - definitely a mapper to keep your eye on if you haven't!"},{"username":"Rakuen","userId":2426126,"isRookie":"FALSE","commenter":"Niva","comment":"After the inactivity of xsrsbsns and HeatKai post-2013, Rakuen has arguably been the name that stepped up as one of the most exemplary figures in the Malaysian mapping community in recent times. Although Rakuen's most anticipated beatmap -- The Distance, which has been in the works since 2014 -- may still not be Ranked yet at the time of writing, throughout the last year he managed to instead rank his Katayoku no Tori which showcased how close his nurturing relationship with the Malaysian mapping community is."},{"username":"Reform","userId":3723568,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Perhaps a more familiar name now, 2018 was when Reform (formerly Kujinn) was starting to get his feet on the ground. A mentee of Sotarks, Reform started to take his mentor's style into his own, making comfortable maps that are easy on the player. There's a possibility we look back at this entry in the future and marvel at how little attention Reform was really getting around this time. It's not unlikely that 2019 will end with Reform at the top of the table when it comes to well known mappers."},{"username":"Renumi","userId":1721120,"isRookie":"FALSE","commenter":"Niva","comment":"People often say that the true joy of mapping comes from being successfully able to introduce the songs you love to the world, and Renumi's profile perfectly showcases this statement: with all four of his Ranked maps being connected through the same trippy feel and ethereal ambience, Renumi has brought forth some really solid (and often relaxing) content with a vibe completely different from any other generic mainstream maps for the community to enjoy."},{"username":"riffy","userId":597957,"isRookie":"FALSE","commenter":"Mirash","comment":"A cool guy straight from the old times, riffy is a Russian dude who has been contributing great mapsets to the game for a very long time! Never expect him to get away from it, even though he became less active in the later half of the year. Ranked three beatmapsets did and some guest difficulties in his lovely style that doesn't go overboard and that is magnificent in combination with the songs he chose. We will see where 2019 journey brings him. (And yeah, he has been known as Bakari as well as tolya97)"},{"username":"Rizia","userId":1367570,"isRookie":"FALSE","commenter":"StarrStyx","comment":"Sadly, this year has seen fewer of Rizia's maps, as he only ranked one set which was mapped last year and was only ranked much later."},{"username":"rrtyui","userId":352328,"isRookie":"FALSE","commenter":"lcfc","comment":"A name in the community you've no doubt heard of already, either in the playing, mapping or storyboarding scene, rrtyui definitely started 2018 off with a bang with his map of Reality Distortion, a highly varied electronic track made by none other than Camellia, which is a collab with Sing that also includes a stellar storyboard made by rrtyui himself. Furthermore, he participated in a few collabs with other popular mappers, including another map you've surely heard of: ProfessionalBox's Exit This Earth's Atomosphere (this time \"Camellia's ''PLANETARY//200STEP'' Remix\", two years after mapping the original song himself). rrtyui also had several more maps added into the Loved section in 2018, showcasing versatility and mastery of map design in all of them. His currently pending maps hint to us that we may see more of him in the ranked section in 2019!"},{"username":"Saten","userId":444506,"isRookie":"FALSE","commenter":"Niva","comment":"Ah, yes. Saten and Yousei Teikoku maps -- they are inseparable from one another. In line with his reputation as arguably one of the first mappers to master the double-BPM mapping meta, in the last year Saten managed to rank Oroka na Ketsumatsu, yet another singletap-heavy Yousei Teikoku map that features a lot of symmetry and polygonal star patterns which have been his trademark since time immemorial. Go give the map a try if you haven't though, it's really fun!"},{"username":"Saturnalize","userId":762487,"isRookie":"FALSE","commenter":"Niva","comment":"Saturnalize has actually been producing high quality maps over and over for years -- even to the point that he had a diff featured in last year's OWC mappool -- but since most of the time he didn't really intend to push his maps to Ranked or Loved, many of his true masterpieces (such as Euclid or Mirage) were left unknown to many. If by chance you stumbled upon Saturnalize's profile, make sure to check his graveyard in order to unearth yourself some great mapping gems!"},{"username":"schoolboy","userId":8722791,"isRookie":"FALSE","commenter":"Mirash","comment":"schoolboy, also known as Komore, ranked a huge amount of 11 beatmapsets in 2018, joined the Mappers Guild and started contributing to the game even more by mapping officially licensed songs. Nice to see such persistence from him for a long period of time! The great style that he developed through the years has reached even higher standards. This guy slayed your boredom in 2018 and will continue to do so in 2019 hopefully."},{"username":"ScubDomino","userId":8972308,"isRookie":"TRUE","commenter":"Niva","comment":"A personal mentee of handsome himself, ScubDomino (previously known as anime girl) managed to take the mapping scene by storm through his seemingly endless mapping breakthroughs and innovations despite only being a rookie this year. From his slider node mechanic-breaking Pencilina to his insane keysounding in skyshifter vip, he's definitely an extremely rare case of a mapper whose maps are extremely unique and different (in a good way) over one another."},{"username":"Seikatu","userId":654516,"isRookie":"FALSE","commenter":"Mirash","comment":"A kinda old Russian mapper who is the definition of \"underrated\". Despite having a clean and simple style, he still manages to surprise you with how well everything is done in the end. Ranked two mapsets in 2018, both of which are full spreads mapped by himself, one of them is for a 4:30-long song. Shows exactly how passionate he is when there are both motivation and free time. Would like to see more of Seikatu in 2019 as he seems to have the time now!"},{"username":"Shadren","userId":745494,"isRookie":"FALSE","commenter":"Mirash","comment":"A Russian compositor and quite an old name that mostly became known for his maps of electronic songs. Shadren came back in 2018 and ranked a full spread set for a song called \"Cry Baby\", where every difficulty was made by himself! Great perseverance! Hoping for Shadren to map a Shadren song in 2019 maybe...."},{"username":"Shiguma","userId":4404784,"isRookie":"TRUE","commenter":"Halfslashed","comment":"If you really liked an anime in the past several years and wondered why no one had made a map of that particular opening, Shiguma is here to change that. What some consider to be an unpolished style upon cracking open their maps in the editor actually turns out to be a fitting and enjoyable map during play. Outside of contributing to the ranked section, Shiguma also participated as an organizer in the mentorship program towards the earlier half of the year. It will definitely be interesting to see what kinds of contributions, mapping or otherwise, he'll put forth in the future."},{"username":"Shiirn","userId":465126,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Recognizable to some as a pioneer of freestyle placements in mapping, Shiirn continued to push boundaries as he did the years before, primarily with his mapset \"Forest of the Spirits\". His style typically appeals to those who are looking for an interesting challenge, or perhaps even a meaningful experience from the strange electronic songs he typically maps. Though he disappeared early in the year, there will likely be something for everyone to remember him by: his vocal presence in pushing for changes in the community, his unique mapsets, his contributions towards deviating from unnecessary rigidity in mapping, or even his edgy poetry."},{"username":"Shmiklak","userId":5504231,"isRookie":"FALSE","commenter":"Mirash","comment":"Shmiklak went IRL this year, but osu! doesn't let you go 100% IRL, and he did rank a great amount of 8 beatmapsets! They were mostly Russian songs, bringing variety to the game's content; that's cool. Best of luck to him in 2019!"},{"username":"Sinnoh","userId":4236057,"isRookie":"FALSE","commenter":"Niva","comment":"If you're looking for a mapper who is extremely proficient at mapping all four game modes, look no further than Sinnoh! Although the last year arguably saw Sinnoh being active in the osu!catch mode the most, Sinnoh is still by any means a prolific mapper in the osu!standard gamemode whose dedication to the mapping scene in general is something to be admired."},{"username":"Skite59","userId":6200099,"isRookie":"TRUE","commenter":"Niva","comment":"The name Skite59 may not be the one that stood out the most amongst many other rookie mappers on this list, but his first and only Ranked map so far -- a rendition of hyleo & sakuraburst - Galaxy Cutter -- is definitely an absolute banger of its own! Comprising a bit of everything from wub parts to alternating sections and even streams, it's truly an uncommon sight for a newcomer to mark their first appearance in the Ranked section with such a high display of versatility. Definitely an interesting name to keep your eye on!"},{"username":"Skystar","userId":873961,"isRookie":"FALSE","commenter":"Niva","comment":"Satellite, Urushi38, Pho, Enkrypton, Regou -- PandaHero, Reiji-RJ, Okoratu -- Mafiamaster, AngelHoney, P o M u T a, Patchouli, EvilElvisV2, Rue. Also he's still very much most likely to be your favorite mapper's favorite mapper."},{"username":"Slips","userId":7438108,"isRookie":"TRUE","commenter":"Hobbes2","comment":"Known more as a player, Slips entered the mapping scene with his first ranked map, a DnB set of Metrik - Freefall VIP. Featuring traditional DnB rhythms, it's a very solid map for someone's first ranked map. Hopefully Slips can continue to improve and show off more DnB maps for us in the future, picking up where some now retired mappers of the genre have left off."},{"username":"Sotarks","userId":4452992,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Just as he was in 2017, Sotarks has undoubtedly been one of 2018's most prolific mappers. Quite the controversial and infamous figure in the community, Sotarks continued his highly active ranking of maps. Sotarks can safely claim the title of \"mapper with the most plays on their maps.\" Regardless of your opinion on him, it's hard to deny that being something of an achievement, for better or for worse."},{"username":"squirrelpascals","userId":6151332,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Perhaps best known for his circle size choices and song selection, squirrelpascals is a mapper and BN who made outstanding contributions to the game across 2018. He started the year off strong with a beautiful mapset of Shindig - Stutter, an artist he would continue to map for. Whenever you load up a squirrelpascals map, you can be certain of a couple things: 1 - the map will be unique, and 2 - the song will be a banger."},{"username":"Strategas","userId":2971837,"isRookie":"FALSE","commenter":"Niva","comment":"One of a few mappers who are very closely associated with DnB song mapping, Strategas managed to get a single DnB ranked map this year (The Journey (feat. Veela)) despite becoming generally less active in the community now after stepping down from his BN role. If there's one thing that I would like to see him do personally in the future, it is for him to map a High Tea Music song (aside from No More) now that the label has become featured in osu! as that would be very interesting!"},{"username":"Sun Rainbow","userId":648885,"isRookie":"FALSE","commenter":"Niva","comment":"Sun Rainbow may have at first debuted in the Ranked section by mapping songs from popular anime series, but as of recently he has been shifting more towards exploring the exotic influences of oriental-sounding atmospheric tracks. His only Ranked map in 2018 -- Luan Feng Ming's All In The Past, a traditional ambient Chinese song -- may not be the most challenging in terms of difficulty, but it's definitely worth the download as it'll instead immerse your mind on a spiritual level through its storyboard and its general ambience."},{"username":"tasuke912","userId":2774767,"isRookie":"FALSE","commenter":"Niva","comment":"Contrary to popular belief, yes, tasuke912, the osu!taiko BN and Champion himself, does map osu!standard as well! Although we only saw two Ranked osu!standard sets coming out from him this year, it's obvious though that he developed a solid view of the osu!standard mapping scene especially looking at his yanaginagi - here and there map."},{"username":"Testo","userId":5200881,"isRookie":"FALSE","commenter":"Mirash","comment":"Testo made a huge amount of 17 ranked mapsets in the year of 2018. You can see an early inspiration from \"clean\"-style mappers and a more \"tech\"-style later. He also has a pretty established view on how to hitsound his maps and you can see it across almost every mapset. Variety in song choice is also a thing that makes his player-audience bigger; good job and will see him making maps in 2019 too!"},{"username":"Theaceae","userId":1855540,"isRookie":"FALSE","commenter":"Hobbes2","comment":"If you hadn't known that he changed his name, you may have downloaded Theaceae's \"first\" ranked map and been blown away at its quality. But make no mistake, Theaceae is a well experienced mapper and player who ranked a single mapset in 2018, a cool rock song called My Famed Disappearing Act by Thank You Scientist. The song's interesting rhythms are fully explored in what is quite the map. It can only be considered a disappointment that Theaceae wasn't more active (his other map was a GD); hopefully we can see great things from him in 2019."},{"username":"Time Freeze","userId":8092686,"isRookie":"TRUE","commenter":"Mirash","comment":"New to the ranked section, Time Freeze, also known as _Sh1ro, ranked a short mapset for a song called \"Sassou Toujou!Neko-san\" and then came to a halt. Other than that map, he occasionally uploaded some of his other creations; will see if he decides to push some of them in 2019!"},{"username":"timemon","userId":2072005,"isRookie":"FALSE","commenter":"Mirash","comment":"Fellow VN-club buddy who ranked a total of 8 mapsets in 2018, most of which were spreads. Mainly focusing on, unexpectedly enough, eroge music, he also mapped tracks from some of his favorite singers in a style that doesn't go overboard and is pretty simple yet structured nicely, just enough for people to enjoy the music. Good luck in exploring the depth of Japanese language and seeing more maps from him in 2019!"},{"username":"Toumei Dragon","userId":6673830,"isRookie":"TRUE","commenter":"Niva","comment":"An up and coming potential star, Toumei Dragon has been no stranger to the editor despite only first appearing in the Ranked section this year with his rendition of Mizuki Nana's VIRGIN CODE. Prior to this map, he has however self-taught a great deal by getting his hands on a broad range of songs (he even attempted to chart osu!mania once) -- the result is an exceptionally clean mapset that is highly commendable for a mapper who only debuted this year's MCA in the Rookie category."},{"username":"Trynna","userId":2652951,"isRookie":"TRUE","commenter":"Mirash","comment":"Fellow dorchadas crew buddy that came into 2018 and spent it ranking his lovely maps, with 11 in total as well as a bunch of guest difficulties too. Despite being a rookie, he also achieved beatmap nominator status on his first try and gave his heart to Sharlo; great job on that! Joined Mappers Guild and started helping the licensed side of osu! grow. Despite his retirement from BN at the end of the year, Trynna kept his activity at a good pace; he is still young and has a long journey of mapping ahead, if IRL stuff keeps being consistent. Hopefully will see him with a strong appearance throughout 2019."},{"username":"tutuhaha","userId":546991,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Known mainly for her presence in earlier years with some of the more interesting vocaloid and anime maps, tutuhaha has continued the trend this year with maps like \"All I Need are Things I Like\" and \"Unknown Mother-Goose\", the former of which was featured in spotlights. Her maps may provoke a positive response from those entranced by older mapping styles, as they are definitely designed to provide a fun challenge that doesn't really go overboard. Hoping to continue see more from her in the future."},{"username":"Uberzolik","userId":1314547,"isRookie":"TRUE","commenter":"lcfc","comment":"Even as a rookie, Uberzolik managed to deliver some very uniquely designed maps this year. From his own sets to his guest difficulties, his irregular object placement and movement make up for a very interesting experience. Should you be looking for something different than your typical map, Uberzolik's maps are bound to deliver. Only time will tell what else we can expect from him in the future!"},{"username":"Ulysses","userId":515967,"isRookie":"FALSE","commenter":"StarrStyx","comment":"You will most likely know Ulysses as nold_1702, well-known for multiple maps such as Ningen Shikkaku, Blu, and more. Sadly this year is probably the last year we would be seeing nold in the ranked section, with his last map Nostalgic getting ranked earlier this year, yet he and his maps will still be praised in the years to come."},{"username":"UndeadCapulet","userId":2523533,"isRookie":"FALSE","commenter":"Hobbes2","comment":"2018 was a wild year for UndeadCapulet. Starting off with controversial projects such as Rendezvous and Deal with the devil left a sour taste in the mouths of many. Despite the negative reputation UC managed to bring himself, you’ll find many mappers and players saying that some of UC’s projects were among their favorites in 2018. It’s not often that you’ll find a mapper whose maps are this polarizing. Love him or hate him, you can’t deny his influence on the mapping sphere through his mapping or nominations."},{"username":"Uta","userId":9439796,"isRookie":"FALSE","commenter":"Niva","comment":"Having only discovered the game in very late 2016, it feels unreal to this day that Uta has achieved so much (including being accepted as a BN) in a very short time -- during his early osu! days he quickly discovered that the osu!editor is the wonderland he had been longing for, and what followed was a blazing hot trail of fire. Considering his significant improvement history, it will surely be very interesting to take note of what 2019 has to offer for Uta!"},{"username":"Vell","userId":3414541,"isRookie":"FALSE","commenter":"VINXIS","comment":"Vell is a wonderful mapper who creates very unique and diverse types of maps. From mapping fleshbound in 2017 to MALFORMED BOX in 2018, Vell is an unstoppable force in creating beatmaps that have their own personality as well as being super enjoyable to play. Always excited to see a new Vell map in ranked! Can't wait to see what else he has in stock for the future!"},{"username":"VINXIS","userId":4323406,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Previously known as Mishima Yurara, VINXIS aka Omar Kamal has continued to show the community that there is no limit to contribution. Omar is the primary organizer behind community events such as Corsace Open, Corsace Invitational, and the very MCA/AYIM that makes this comment possible. Additionally, he has even reached the ranks of a Featured Artist, providing tracks like \"Sidetracked Day\" to the community, in which all ranked mapsets combined total nearly 2 million plays. Somehow in his busy schedule, he also finds time to map and rank several interesting mapsets. Through all these efforts, his love for the game and the joy it brings to people is clear as day, to the point where it'd be hard to imagine osu! without these contributions."},{"username":"Voli","userId":2522275,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Want to play some good pop songs? Look no further than Voli. You won't find much anime here; Voli's maps from 2018 were some pop, some rock, and some VGM; a far cry from the typical genre spread. His maps can be described as a modern twist on a classic style, something many will find themselves enjoying."},{"username":"Xilver15","userId":3099689,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Previously known as Xilver, Xilver15 continued to put out high quality mapsets of rhythm game songs this year, including \"Once Upon a Time\" and the infamous high CS HR pick in the OWC 2018 Grand Finals, \"Izanami's wail\". His style varies quite a bit from map to map, but the quality is always solid, as are the ideas he brings to the ranked section. Definitely a trend I'd like to see continue into 2019 and beyond."},{"username":"Yales","userId":2377881,"isRookie":"FALSE","commenter":"Mirash","comment":"2018 brought us a great comeback from a great mapper; it's nice to see such a cool person being very active on mapping fields again! Despite his sudden shift into the taiko game mode at the later half of 2018, Yales still managed to rank some standard maps too! His maps connect the vocals and intensity of the song to the mapping and often you'll forget you're even playing an osu! map; it's like looking at a piece of artwork in a museum. The songs he mapped were mostly from other rhythm games, but later on he joined Drum Circle and started mapping songs that are licensed for osu! to use, contributing to the community even more content to play. I can say for sure that 2019 will be a solid year for him and maybe we will see something mapped using circles and sliders too!"},{"username":"Yohanes","userId":4075595,"isRookie":"FALSE","commenter":"Mirash","comment":"I'll try to avoid that word this time. Yohanes spent the year of 2018 not being very active and yet ranked 5 mapsets in his charming style, complex yet simple. His mapping provides an experience that you'll never forget, accompanied by fun songs and solid hitsounding that represent the song nicely. Will be waiting for 2019 maps by him!"},{"username":"Yonaka-","userId":7575461,"isRookie":"TRUE","commenter":"Mirash","comment":"New mapper to the ranked section that did very well in mapping the Evangelion opening in a double-bpm style, which represents the intense moments of the song greatly. She has ideas for what to do in a map to tie it better with the song, like mapping for the video for example. See her in 2019 with a solid appearance."},{"username":"z1085684963","userId":1816779,"isRookie":"FALSE","commenter":"Mirash","comment":"He was active enough to rank three of his mapsets and generally mapped some various rhythm-game-like tracks in his, I'd say, unique style that uses anti-jumps and non conventional movements that are often much easier to play than they look. Great representation of music and solid hitsounding, what else would you want from a map? Hopefully z1085684963 or else known as [rasis] will be as active as possible in 2019!"},{"username":"Zallies","userId":6379145,"isRookie":"TRUE","commenter":"Niva","comment":"Have you ever been -- or at least seen someone who has been -- trying to map something but quickly backed off due to the song being a timing hell? Now, how about if you were a rookie mapper who desired to map a particular song you really love but the song turned out to be in the need of 472 timing lines in order to be timed correctly? It might not sound plausible, but that's just what exactly struck Zallies in 2018 with his Sayonara Memories map. Yes, sometimes wonders do happen!"},{"username":"Zetera","userId":587737,"isRookie":"FALSE","commenter":"Niva","comment":"Being one of the only six certified Skylords in the game (at the time of writing), it is only fitting to describe Zetera's mapping as being very vivid with a high display of versatility. But what truly epitomizes Zetera as a proficient mapper is his capability to map with complex SV manipulations and multi-BPM songs without cluttering the general structure -- something he has very much mastered through his experience in being an active osu!taiko mapper as well. Cool and good!"},{"username":"ZLOdeuka-","userId":120823,"isRookie":"FALSE","commenter":"Mirash","comment":"Glad to see such an old mapper coming back to rank two of their sets; you can never expect anyone to leave osu! forever. She gifted players a New Year's themed map and tried her hand at modern mapping techniques Will see what her contributions it be in 2019!"},{"username":"ZZHBOY","userId":1565739,"isRookie":"FALSE","commenter":"Niva","comment":"The name ZZHBOY is perhaps most associated with the osu!mania mapping scene and other VSRGs in general (I even saw his name accidentally on Arcaea's leaderboard once) but beyond that, he's actually a very capable osu!standard mapper as well! Although he's not very active nowadays, in 2018 ZZHBOY managed to rank Yokuatsu Sakuran Girl -- a highly chaotic song in its nature which was very fittingly mapped with a lot of sharp linear angles and turns."},{"username":"_DT3","userId":7319843,"isRookie":"FALSE","commenter":"scub","comment":"While 2018 wasn't a particularly remarkable year for _DT3, as he only ranked a couple of low-star rating guest difficulties, that doesn't take away from his ability to make cleanly designed maps! Looking at his graveyarded maps should make this clear too, as he's made a couple of maps from various genres to expand his mapping portfolio. It's not certain whether he'll rank any high-star rating maps in 2019 or not, so we can only wait to see what'll come this year!"},{"username":"_Epreus","userId":7342798,"isRookie":"TRUE","commenter":"Nao","comment":"_Epreus ranked his first map, a 7* map of \"The World's End\" by Horie Yui, in July 2018. He then ranked his second map, a 7* map of \"Help\" by Thaehan, in December. Most of his other uploaded maps also reach the 7* mark. Additionally, he began modding with the intent of entering the Beatmap Nominators Group."},{"username":"_FlameL","userId":6291407,"isRookie":"TRUE","commenter":"Nao","comment":"_FlameL joined the ranked section in March 2018 with a cover of \"Yume Tourou\" by Konamilk. He also ranked a normal GD on a set of \"Myosotis\" but did not rank any more sets of his own for the rest of the year. However, he recently began mapping again and is currently working on several new sets of his own."},{"username":"_kotachi_","userId":4698485,"isRookie":"TRUE","commenter":"scub","comment":"After 3 years and an uncountable amount of graveyarded maps, _kotachi_ has finally made their way through the ranked section with a map of a popular anime ending! They didn't stop there though, as they went on to experiment and rank more maps, ending the year with the uploading of a banger of an epic all-Japanese mapper collab! If they've managed to go this far within only a year in the section, I'm absolutely going to be thrilled with what they will be able to create in 2019!"},{"username":"_lai","userId":3045895,"isRookie":"TRUE","commenter":"Mordred","comment":"_lai joins the ranked section with their own interpretation of Misato's \"Paranoid Lost\", an engaging marathon-style beatmap. Let's see what else they have in store for 2019!"},{"username":"_Meep_","userId":4315188,"isRookie":"TRUE","commenter":"yaspo","comment":"Idol fans behold, _Meep_ is here to save mapping! Vigorously so, as they ranked 3 of their own mapsets and multiple GDs to try taking over the ranked section. With a flurry of pretty patterns, his maps really make you feel like you're on stage, performing right next to your favorite idol groups! If you never can have enough idols, there is an extensive list of u's and Aquors maps on his userpage! With this much presence and flair, we can only wonder how many _Meep_ can convert in 2019."},{"username":"_MiaoFUuU_","userId":4299356,"isRookie":"FALSE","commenter":"yaspo","comment":"_MiaoFUuU_ might not rank a lot of maps, but they do make every one of them count. Showing off their amazing song choice, MiaoFUuU came back this year with a collab on \"Mercury Prayer\". This map is a 6 minute long adrenaline rush full of unique slider patterns and complex rhythms for everyone to compete on - go check it out! Even though their mapping activity seems as low as ever, we're eagerly waiting for MiaoFUuU's rebirth!"},{"username":"_Star","userId":6636154,"isRookie":"TRUE","commenter":"Nao","comment":"_Star kicked off his ranked mapping career by ranking two iDOLM@STER songs. His song taste heavily favors idol groups, and most of his uploaded maps are insane difficulties on various iM@S and similar tracks. If you like idols, stay on the watch for more of his maps hitting the ranked section!"},{"username":"_xyliac","userId":7989480,"isRookie":"TRUE","commenter":"Nao","comment":"_xyliac ranked a full version map of \"Sunglow\" by Yamajet and Hiura Masako. It's a lively 6* jump marathon heavily inspired by Lasse's older wiggly slider aesthetic. He mostly maps anime and j-pop, and his maps are all similarly jumpy so if you enjoy exciting 1/2 patterns and rhythms check out his other maps."},{"username":"- Frontier -","userId":4314710,"isRookie":"FALSE","commenter":"scub","comment":"Being an avid follower of the rrtyui cult, you can only expect maps with great aesthetics coming from this guy. With his mastery in aesthetics and patterning, he's made lots of great maps, including not only his anime maps in the ranked section, but his techy guest difficulties and graveyarded maps as well! He is definitely someone who you should not judge by the cover, and also a mapper to look out for in 2019!"},{"username":"- Sophia","userId":5267343,"isRookie":"TRUE","commenter":"yaspo","comment":"Sophia is only at the dawn of their mapping career. Taking their first small steps into the ranked section, a gentle pair of lower difficulties is just enough for them to get started. I have no doubt their friend Seto Kousuke will support Sophia all the way in achieving their mapping goals in 2019!"},{"username":"-[Pino]-","userId":10120527,"isRookie":"TRUE","commenter":"StarrStyx","comment":"An up and coming mapper who has a fairly unique style, using mostly sliders to portray the song in a different way than how most people would. Although he only ranked one set in 2018, he looks set to bring to us more of his stuff in the following year."},{"username":"-Aerith-","userId":6136172,"isRookie":"FALSE","commenter":"Gottagof4st","comment":"Aerith ranked 3 maps early to 2018 which were all pretty calm and relaxing maps, but sadly since then he hasn't been active at all. Maybe later in 2019 he will return to show us more of his maps but for now that chance sadly doesn't look all that likely."},{"username":"-Aqua","userId":7150015,"isRookie":"FALSE","commenter":"Sulfur","comment":"After their debut to the ranked scene in late 2017 with Garasu no Hanazono, -Aqua made sure to bring us more songs from idol projects and ranked a total of 5 mapsets, one of them being This game -- a fairly popular mapset with difficulties not only including osu!standard but also for all of the other 3 game modes."},{"username":"-Eriri-","userId":2922196,"isRookie":"TRUE","commenter":"yaspo","comment":"Coming back from ranking a collab easy in 2016, -eriri- finally settled themselves into the ranked listing. Ranking their own set and a whopping 7 GDs makes clear that their clean patterning style is appreciated. Even so, their recent work shows visible signs of experimenting with patterning and gameplay elements. Keep an eye on them: they might end up taking a really interesting direction this year!"},{"username":"-Faded-","userId":2175201,"isRookie":"FALSE","commenter":"yaspo","comment":"Contrary to their name, -Faded- is far from fading away in the mapping scene. With an impressively keysounded version of \"Doki Doki Literature Club!\" and an incredibly jumpy Christmas set, they keep their mark on the ranked section. Curious to see if they have anything new in store for 2019!"},{"username":"-Zeraora","userId":5179950,"isRookie":"TRUE","commenter":"scub","comment":"Previously known as -Harpuia-, -Zeraora has shown incomparable persistence in 2018. After four years of mapping for the graveyard section, he's finally gotten himself a ranked map! A very cleanly designed map of the opening of a classic anime, Believe x Believe, marks the beginning of his potential to become one of osu!'s most prolific mappers. Will he keep it up for 2019? Will he not? We'll see this coming year!"},{"username":"-Jordan-","userId":7288862,"isRookie":"TRUE","commenter":"Nao","comment":"jordan (previously known as Jory) ranked his first set in October 2018. The set features a rhythmically intricate top difficulty with interesting stream arranges as well as several GDs by other newer mappers. Check it out if you want a taste of what interesting rhythm in a stream map can look like without it feeling overbearing. His other maps encompass several genres including electronic, dubstep, and anime. We hope to see his continued improvement as the year progresses!"},{"username":"-M4x","userId":4607719,"isRookie":"FALSE","commenter":"scub","comment":"-M4x has a mapping style very reminiscent to the likes of HanzeR and Irreversible with their signature tightly packed visuals and usage of disconnected patterns to emphasize certain parts of the music. While this year hasn't been particularly amazing for him, he has ranked some guest difficulties with the same core influence in mind. That being said, he has been experimenting with different genres pretty lately, including hip-hop and K-pop. Quite interesting, so let's see how this goes!"},{"username":"-Mikan","userId":9063995,"isRookie":"TRUE","commenter":"Mirash","comment":"This year, -Mikan pushed to the ranked section three of his first step creations. One of the few making maps for such a niche category for osu! as Russian pop as well as organizing some ambitious sets, Mikan can sit in his chair satisfied with his progress in 2018, and await what 2019 will bring him to."},{"username":"-PC","userId":2916414,"isRookie":"TRUE","commenter":"yaspo","comment":"Despite their username being tricky to search for on the new website, -PC is a mapper that you shouldn't miss out on. You'll find yourself a great challenge with their aim-heavy 1/4 usage on their mapset for \"Entrans of da jungle\". If you like a more rhythmic map, their mixed bag of snaps and low BPM rhythms on Warak's \"Once Upon A Time\" is exactly what you're looking for. Having seen their entrance to the ranked section and guest difficulties, we're eagerly waiting to see the other sides of -PC's mapping!"},{"username":"-Sh1n1-","userId":1957638,"isRookie":"FALSE","commenter":"yaspo","comment":"Multimode expert -Sh1n1- keeps up with standard mapping, ranking multiple sets and GDs under his name. Even though he has a history of preferring Japanese music, he also looks out for his fellow Spanish speakers with \"creer en mi\" and \"No Digas Lo Siento\". 2018 also marked a brief return of his YouTube series, with a video detailing difficulty spread and pattern introduction. Definitely hoping to see a complete Resurrección of his helpful guides this year!"},{"username":"-Sylvari","userId":3493804,"isRookie":"TRUE","commenter":"yaspo","comment":"2018 is the year -Sylvari jumps into the ranked section for the first time! They do so with the short and sweet \"Darling\", making for a nice beginning of their journey. Even though they start off with comfy gameplay, their other maps show that they're not afraid of giving players a test of skill. Expecting a big twist from them in the Oriental Future!"},{"username":"-Tochi","userId":3664366,"isRookie":"FALSE","commenter":"Mordred","comment":"-Tochi might have only ranked a single map in 2018, but his name is definitely not unknown to lots of people. Known for his incredible storyboards, he continues to go above and beyond to make outstanding works, motivating you to play maps with less than 100% dim just to enjoy the amazing storyboard a map might have."},{"username":"[ Drop ]","userId":2391299,"isRookie":"TRUE","commenter":"StarrStyx","comment":"[ Drop ] has been known for quite a while, and rightfully so as his maps are full of ideas, however, he hasn't had a ranked map until now. Luckily, this year saw his Undertale map being ranked, and so he finally became a ranked mapper after all the years of having unranked maps only."},{"username":"Reillia","userId":4746949,"isRookie":"FALSE","commenter":"scub","comment":"Most famous for hosting some of the most popular anime/utaite mapsets like Akatsuki Zukuyo and Koi no Hime Hime Pettanko, [C u r i] (now namechanged to Reillia), has certainly gotten his name out there in the osu! community. Despite not having mapsets that relive those old popular times, [C u r i] still makes anime maps of comparable quality to this day. So if you're bored of the popular maps you've played over and over again, give his newly ranked maps a try and you're sure to have a great time!"},{"username":"[Kamiya]","userId":2139130,"isRookie":"FALSE","commenter":"scub","comment":"Despite the fact that [Kamiya] isn't widely known in the osu!mapping community, his is definitely a name everyone should look out for, as he is massively underrated! He created several maps in 2018; these maps feature very addictive gameplay, clean visuals, and best of all, great relaxing song choice! Now if you just want to relax, not caring about the farming aspects of the game, I would recommend playing Kamiya's maps. I promise you it'll be worth your time!"},{"username":"[Kurose Riku]","userId":6678436,"isRookie":"TRUE","commenter":"Nao","comment":"[Kurose Riku] ranked two maps in 2018, a GD in June and his own set in July. He seems to have deleted all of his uploaded maps but is currently working on another set of his own."},{"username":"Acyl","userId":1943309,"isRookie":"TRUE","commenter":"yaspo","comment":"Formerly known as \"iedesu\", Acyl shares his sublime song choice with the ranked section on one of MiddleIsland's piano pieces. Even though this is his first ranked set and the timeline looks like a timing hell, Acyl keeps the lower difficulties intuitive and playable without breaking a sweat. Here's hoping they come back with more delightful songs after their mapping break!"},{"username":"Affirmation","userId":6186628,"isRookie":"FALSE","commenter":"scub","comment":"Aside from practically being a modding machine, NSL has brought great maps of lots of anime openings to the ranked section. Not only that, but he's also contributed to a lot of mapsets through guest difficulties! You can very clearly see the level of dedication this guy has to contributing to the ranked section before his recent mandatory military draft. To that, I can only salute in respect for this guy, and wish him all the best throughout the draft!"},{"username":"Agatsu","userId":5579871,"isRookie":"FALSE","commenter":"scub","comment":"Over my time as a non-mapper, I played a lot of Agatsu maps without actually realizing who made them, as they are lots of fun to FC without being overly hard for noobish players like myself in 2017! It was only when writing this comment that I realized that Agatsu has actually made lots of maps I would consider part of my osu! childhood. To all the people who look for fun maps to play without getting overly frustrated of their difficulties, please play Agatsu's maps! I promise that their maps will be worth your time!"},{"username":"aigoh","userId":4005683,"isRookie":"TRUE","commenter":"yaspo","comment":"Mapping a full set for the calm Sword Art Online ED \"Shirushi\", aigoh finds a warm welcome to the ranked section. His carefully placed sliders really bring out the energy of the song while remaining so gentle at the same time. He also deserves some credit for providing Korean translations on some of pishifat's videos. Sadly he seems to have grown inactive recently, we're hoping to see his name appear again!"},{"username":"AirinCat","userId":11119539,"isRookie":"TRUE","commenter":"Nao","comment":"AirinCat ranked their first map near the end of 2018. They focus mostly on male vocalists such as mafumafu, soraru, Amatsuki and Eve. If you like those types of singers, be sure to check out their maps for a selection of excellent songs accompanied by clean jump maps which lie around the mid 5* range."},{"username":"Akareh","userId":275450,"isRookie":"FALSE","commenter":"Mordred","comment":"Akareh is one of the rare few Spanish mappers. Having ranked 2 sets in 2017, they ranked another one in 2018, M2U & NICODE - Myosotis (feat. Guriri & Lucy), featuring taiko guest difficulties as well."},{"username":"Alexsander","userId":9254241,"isRookie":"TRUE","commenter":"Nao","comment":"Alexsander joined the ranked section in March 2018 and quickly ranked several maps in the anime/eroge genre including \"killy killy Joker\" by Wakeshima Kanon and \"Kimi to Iu Tokituen\" by fhana. Most of his maps lie in the mid 4* range, topping out around 5.7. If you enjoy anime and eroge songs, especially Duca and ClariS, check out Alexsander's maps when you get the chance."},{"username":"Alheak","userId":3583061,"isRookie":"FALSE","commenter":"scub","comment":"Throughout 2018, Alheak has experienced a major change in their mapping style and mindset, as shown from his earlier ranked maps like Beyond the Seven to his guest difficulty on eiri-'s Meikyuu Lyrith. Despite that, he still manages to keep his engaging and fun charm through his mastery in rhythmic composition, especially in his lower tempo electronic maps. All that being said, we're undoubtedly hyped to see more maps from them in the future!"},{"username":"Alphabet","userId":4879380,"isRookie":"FALSE","commenter":"scub","comment":"At a glance, this year didn't seem like an active year for Alphabet, until you realize that most of this guy's contributions this year come from his very well made guest difficulties for other maps. With a very geometric, cleanly designed and fun style, these maps are sure to be great for both your eyes and hands!"},{"username":"Altuth","userId":4377815,"isRookie":"TRUE","commenter":"yaspo","comment":"A rather unique mapper presents themselves to the ranked section. With 1 ranked map but no pending or graveyarded maps, Altuth comes across as an enigma to many. The way their map of \"Counter raid Another D\" exploits the intensity contrast of the song is definitely a sign of experience, but where did they get it? The world might never learn the secret to this mystery; perhaps we'll learn about it when - or if - he returns from the shadows."},{"username":"Amandia","userId":11480447,"isRookie":"TRUE","commenter":"Nao","comment":"Amandia appeared on the mapping scene in the early parts of 2018, showing remarkable improvement and ranking a map by the end of the year. She's also made GD's here and there, and is continuing to map more and more with her unique take on a hybrid CS5 grid style. Be sure to check out her maps if you like alt-style mapping, CS 5 and great song choice!"},{"username":"Ambient","userId":3172714,"isRookie":"FALSE","commenter":"scub","comment":"Most famous for being Moph's Slave™, Ambient's maps feature extremely clean design and exciting gameplay! Although Ambient has only ranked one approval-length collab map in 2018, it showed exactly how exciting their maps can be. And that's not to say they've only ranked that, though. They've also ranked a couple of comparable quality guest difficulties this year, and they're still looking to do more projects in 2019! With that in mind, we definitely can't wait to see more of those this year!"},{"username":"Ametrin","userId":1588934,"isRookie":"FALSE","commenter":"gottagof4st","comment":"Starting out 2018 as a purely TK from Ling tosite sigure mapper, they surely showed 2019 that they are much more than that. With his very succesful attempts at mapping 1/3 in his map from Luz or his way of handling rhythm in more complex songs like his Prayer X, he showed that he was capable of much more. Big expectations for Ametrin in 2019 to see what else they can bring to the mapping community as this surely isn't the last thing they'll do."},{"username":"Anxient","userId":4561368,"isRookie":"FALSE","commenter":"Mirash","comment":"The mapper known as Anxient ranked two mapsets in 2018 and tried to rank a really fun to play marathon, but something didn't go quite right there. Being very experienced with a bag of 85 graveyard maps on his shoulders it is sad to see that he prefers being inactive. His style resembles no one else's, or at least it is not straightforward or understandable. Will be seeing news from him as he is always a breath of fresh air into the mapping scene."},{"username":"Anze","userId":1545563,"isRookie":"FALSE","commenter":"yaspo","comment":"Formerly known as \"ayalis\", Anze ranked their third mapset in 2018. The short and sweet \"Miageru Ano Sora de\" is all they need to get sola fans behind their work. Despite not being very active recently, we're eagerly waiting for their next excellent choice in female vocalists."},{"username":"Arphimigon","userId":5392762,"isRookie":"FALSE","commenter":"yaspo","comment":"Perhaps one of the cutest users in the game, Arphi comes back to the ranked section with the classic \"Fireflies\" by Owl City. With a mapset as gentle as the song, he captivates the hearts of players who grew up with this song, like myself! If you played it and thought \"Not baaaad , but let's face it. That was easy\", then his loved and unranked maps are a great fit for you. There's a good chance you'll find yourself sweating bullets even attempting to pass them. Wether it's in Loved or Ranked, I'm sure Arphimigon will show everyone who's Boss this year as well!"},{"username":"ArThasCD","userId":365331,"isRookie":"FALSE","commenter":"gottagof4st","comment":"Coming pretty much out of nowhere ranking 1 map in late 2017, he started off 2018 with a bang by ranking 4 maps in just a couple of month which put him on the map. Especially notable was his map of Amatsu Kitsune in which he for the first time ranked an extra diff and got a lot of attention. Hoping for more in 2019 but it doesn't look like they have done much recently."},{"username":"Arutsuki","userId":7566849,"isRookie":"TRUE","commenter":"Nao","comment":"Arutsuki ranked a map of Camellia's remix of kors k's \"Nirvana\" as well as a GD for Benibotan, but went inactive in the later parts of the year. Best known for rhythmically intricate \"tech\" mapping, Arutsuki has a litany of Camellia maps uploaded. He also enjoys Demetori, so make sure to check out his uploaded maps if that interests you."},{"username":"Asahina Momoko","userId":3650145,"isRookie":"FALSE","commenter":"StarrStyx","comment":"Asahina Momoko is a fine example of unique mapping; his style has stood out from others', and despite him being quite inactive from mapping recently, he still managed to rank his map of a_hisa's Tokei no Heya to Seishin Sekai, a map that despite being a really good map in its own right has sadly not aged well and has clearly received less attention than it could have."},{"username":"Asaiga","userId":2959560,"isRookie":"FALSE","commenter":"yaspo","comment":"Asaiga didn't meme around in 2018 .. or did he? In any case, Asaiga has really become an established name in the community. Alt maps are really his niche; standout examples are the challenging collab on Sound Souler's \"Paradise\" and his own flashy set of the electronic \"Memes (Speed Up Ver.)\". Personally I have a blast playing Asaiga's maps, so I'm glad to see that he kept going at it this year!"},{"username":"Ascendance","userId":2931883,"isRookie":"FALSE","commenter":"Mordred","comment":"Haven't you heard? It's Ascendance! Not really someone that needs an introduction, and certainly not a name you'd expect to see on the comments for osu!standard, but he actually ranked a standard map this year! Aside from standard, his set of senya - Utakata, Ai no Mahoroba also features taiko and ctb difficulties. Will he rank more standard maps in 2019? Who knows, but I'm sure he won't be leaving ctb any time soon!"},{"username":"Asphyxia","userId":1715720,"isRookie":"FALSE","commenter":"lcfc","comment":"While Asphyxia's activity in the mapping scene has dropped, his mapping skill certainly hasn't! Despite having ranked only one set (which the one writing this had the honor of participating in) as well as a couple of guest difficulties in 2018, this was enough for the community to still acknowledge his existence, and made us hopeful we'll see more of him in 2019!"},{"username":"Asuka_-","userId":7905848,"isRookie":"FALSE","commenter":"scub","comment":"osu! needs more eroge! Eroge has been a pretty underrated source of great music, and it's awesome that a lot of mappers have picked up on this the past few years, Asuka_- being one of them! This mapper has been actively ranking quite an amount of eroge maps that showcase a cute and simple style, a style I would say is widely enjoyable by many, including myself! I'm definitely looking for more eroge stuff to fap to play in 2019!"},{"username":"Atalanta","userId":7543834,"isRookie":"FALSE","commenter":"Gottagof4st","comment":"Ranking 3 maps in 2018, Atalanta showed how alt mapping is done; with their high difficulty and their constantly high intensity their maps never give you a break and make you invested until the ending. 2019 so far has shown that he also doesn't become fully locked into one style, so there is much more to look out for in the future."},{"username":"Atsuro","userId":2279351,"isRookie":"FALSE","commenter":"yaspo","comment":"Atsuro is a name that needs little introduction at this point. They have a spot on many popular mapsets, while also pushing forwards their own love for One Piece and Dragonforce. In 2018 they continued doing just that; the slower \"Hope\", electronic \"Showdown\" and their own stream-heavy map of Dragonforce's \"Inside the Winter Storm\" show us just how easily Atsuro can adapt to just about any style and genre. They've built up a memorable list of maps at this point, and looking at their pending maps makes me excited about how it will be extended."},{"username":"Avena","userId":2198472,"isRookie":"FALSE","commenter":"scub","comment":"Avena, otherwise known as Priti, has always been known for making great and clean maps of popular arcade rhythm game songs. They've done the same this year too with the ranking of Arabian Rave Night, their only ranked mapset throughout the entire year, unfortunately, as they've decided that it was time to leave the game as a whole. Whatever decision they may make, we can only wish them all the best for every single one of their future endeavors, and were they to return to the game in the future, we will always welcome them back with open arms!"},{"username":"Axaptice","userId":4395077,"isRookie":"TRUE","commenter":"yaspo","comment":"Even though the difficulty name might be silly, Axaptice's first ranked map on Kikuo's \"Neko no Shokutaku\" is nothing to scoff at. Not only does he provide us with a map for a severely underrepresented artist, the way he handles this full length song shows clear signs of experience. Undeniably impressive for a rookie, we're eagerly awaiting his next release."},{"username":"AyanokoRin","userId":5376866,"isRookie":"TRUE","commenter":"uc","comment":"AyanokoRin surprised even themself in 2018 when they were accepted into the BNG. During their time as a BN they helped out a wide group of mappers, and their hard work during this time is very appreciated. After they left they pushed their own \"MitiS - Living Color (Original Mix)\" mapset, setting a good foundation for their mapping career in the future, should they ever decide to continue again."},{"username":"Azunyan-","userId":3361661,"isRookie":"TRUE","commenter":"yaspo","comment":"Under the arguably less adorable name \"Xexyz\", Azunyan- started off by mapping \"Hitorigoto\" alongside many other Claris fans. While their entry drowns on the ranked listing, it being the only full version makes it definitely worth checking out! Azunyan's other maps are clear evidence of their love for full songs, so we're anticipating to enjoy more of them this year!"},{"username":"Azzedd","userId":8889054,"isRookie":"TRUE","commenter":"Sulfur","comment":"A newer mapper who managed to rank 5 mapsets this year. All of their ranked maps are instrumental songs that make for a simple yet very pleasing experience!"},{"username":"B U R R","userId":8333834,"isRookie":"TRUE","commenter":"Nao","comment":"B U R R ranked his first map, a Normal diff on \"Greetings\" by VINXIS, in August of 2018. His other uploaded maps include an Easy diff on his set of \"Melty Land Nightmare\" and a collab with Namki dating back to March 2018."},{"username":"b00","userId":3929650,"isRookie":"TRUE","commenter":"yaspo","comment":"Don't be spooked, b00 is a cute mapper who made his first appearance in the ranked section this year! On both Nanahira's \"Petals\" and a completely self-made anime set, he convincly puts what he learned in mentorship to good use. Excited to see him take us by surprise again this year!"},{"username":"Bariton","userId":2026274,"isRookie":"FALSE","commenter":"yaspo","comment":"Even though Bariton was only a rookie with 1 ranked map in 2017, nowadays their insane expert difficulties are commonplace. By ranking interesting 1/4 patterns on \"Shape my Story\" and a surpising full version of Katamari Damacy OST, they definitely surpassed their newcomer status to become someone noteworthy. I'm curious to what other twists Bariton will make on their fun patterning approach in 2019!"},{"username":"bbu","userId":4118962,"isRookie":"TRUE","commenter":"scub","comment":"What else can I say about this mapper, other than the fact that bbu fits perfectly within the Korean mapping community! Despite being a 2018 rookie, he's already gained lots of connections, and in turn was able to rank his first map easily. Aside from all that, he's also a pretty good rookie, as his maps feature very solid structure with clean visuals and smooth gameplay. This mapper grew fast and furious in 2018, and I'm waiting to see more bbu maps this year too!"},{"username":"BeatofIke","userId":1103522,"isRookie":"FALSE","commenter":"yaspo","comment":"Known from the BAT days, BeatofIke is still present in today's mapping scene. With a short and cute anime set full of nice symmetry and blanket patterns, BeatofIke shows us that this mapping style is still as fun as ever. Hoping to see more of them this year!"},{"username":"Bergy","userId":7393632,"isRookie":"TRUE","commenter":"Nao","comment":"Bergy likes metal. His ranked maps in 2018 included his first and only hosted set, \"Mikasa\" by Veil of Maya, as well as several Foreground Eclipse GDs and two collaborations with DavidEd. He also took up storyboarding, creating the storyboards for popular maps like Fatfan Kolek's \"Megalovania\" and Ayyri's \"SAD!\" set. While he doesn't seem to map much any more, check out his graveyard for a collection of intense metal songs and maps."},{"username":"bigfrog","userId":1149962,"isRookie":"FALSE","commenter":"yaspo","comment":"It was quite a surprise to see bigfrog return so actively after a few years without any ranked maps. While she mostly shows up on sets with her carefully made guest difficulties, bigfrog's own set of \"Answer\" is definitely worth checking out. The way she lets you flow across the screen is a perfect fit for this song, hoping to see more of this in the future!"},{"username":"Bonsai","userId":987334,"isRookie":"FALSE","commenter":"uc","comment":"Bonsai is known for bringing a wide variety of unique music to the game, ranging from chiptune, to English rock, to the borderline untimeable mp3s. Unfortunately they were largely inactive in his own mapping this year, but they did help rank a set for a very old mapper named Sushi. These respectful gestures to the mappers of old are always appreciated."},{"username":"BOUYAAA","userId":405449,"isRookie":"FALSE","commenter":"scub","comment":"Being a mapper who mainly tackles western/progressive rock songs, BOUYAAA handles complex syncopated songs like none other, creating engaging maps no matter what sort of funky rhythmic pattern is thrown at them! Aside from that, they've also contributed to the game as a beatmap nominator, albeit for a rather short time. While he's gone somewhat passive in both mapping and modding, we can only hope that he can provide us with more content in 2019!"},{"username":"byfar","userId":4674054,"isRookie":"FALSE","commenter":"scub","comment":"Who could forget the guy who's influenced a literal new mapping meta within the wub mapping community? Bringing his proficiency in aesthetic and visual design along with him, byfar has brought some great-looking maps in 2018 too! His rendition of Function Phantom's \"Paradox\", for example, sets a good continuation to the map that started it all, Euclid, along with him ranking \"Kami no Kotoba\" this year as well, a map with elements that defy the current meta regarding jumps. He's brought great additions to the ranked section in 2018, and we can't wait to see more from him in 2019!"},{"username":"captin1","userId":689997,"isRookie":"FALSE","commenter":"Mirash","comment":"With new standards in mapping captin1 ranked a map this year, one of his older ones that was waiting for a long time. Contributing to the Mappers Guild and some other guest difficulties and unranked maps, you can say that 2018 was a pretty solid year for him. Glad that people like him still spend time on that game, making everyone's life better. Will see him in 2019, as usual."},{"username":"Chanci","userId":10510791,"isRookie":"TRUE","commenter":"Nao","comment":"Chanci ranked his first map, \"everything gon be alright\" by bo en, in the later stages of 2018. It's a short piece with some interesting snapping accompanied by a cute video. Don't be fooled though; most of his maps are 7* stream maps, by artists such as Xavlegbmaofffassssitimiwoamndutroabcwapwaeiippohfffx (no, really) and GYZE."},{"username":"Chaoslitz","userId":3621552,"isRookie":"FALSE","commenter":"StarrStyx","comment":"The god himself in not only one way, but three. Proficient in tournament playing, mapping and modding, Chaoslitz is a well-established figure in the community not only for his tournament carries, but also for his very clean mapping style. Most people, especially those in the Chinese mapping community, will certainly know him for winning Pending Cup two years in a row! Oh, and did I mention he is good at skinning and can do storyboards as well?"},{"username":"Chekito","userId":6070370,"isRookie":"TRUE","commenter":"Nao","comment":"Chekito, formerly known as Lince Cosmico, returned to the ranked section in 2018 after ranking a map in 2017 in a taiko mapper's marathon set and subsequently getting unbanned. He ranked several GDs as well as two sets of his own, and remains an active and helpful mapper of several genres including DnB, j-pop, and rock. We hope to see more development from him as time goes on, as he shows a lot of potential!"},{"username":"Chromoxx","userId":1881639,"isRookie":"FALSE","commenter":"yaspo","comment":"Always surprising to see an active taiko mapper also appear in the standard listing. Chromoxx really shows he knows how to handle mapping circles and sliders; their first ranked standard set on \"SAD!\" is nearly indistinguishable from more experienced mappers. His standard maps do have a clear bias towards gameplay elements taiko can't offer, like jumps. I'm curious to see if he'll continue this trend or if he will play more with sliders this year. Only one way to find out!"},{"username":"ChuuritsuTv","userId":8436185,"isRookie":"TRUE","commenter":"lcfc","comment":"ChuuritsuTv ranked two music box maps this year, sharing his taste of melodic and calm parts or remixes of two renowned songs with the osu! community. While they aren't the most difficult maps, it seems that he has plans to rank harder stuff in 2019 as well as more music box maps."},{"username":"Come[Back]Home","userId":1131716,"isRookie":"FALSE","commenter":"yaspo","comment":"Also known as CBH, this og mapper of electronic music has been around forever. By mapping many songs that most mappers deem too repetitive, CBH has found himself a niche in the mapping scene that only few can compete on. His intuitive, freeform placements make a perfect fit for songs like \"Wait For Me\" and \"Fade\". Personally, having found a new way of appreciating simpler mapping styles makes me hope Come[Back]Home continues doing what he's doing this year!"},{"username":"cosmiccc","userId":9700716,"isRookie":"TRUE","commenter":"Nao","comment":"cosmiccc began mapping k-pop in early 2017 and continues to this day. Along the way, he ranked his first map \"Bad Boy\" in mid 2018. If you enjoy k-pop accompanied by clean jumpy insane diffs, stay on the lookout for his future maps."},{"username":"Cosmolade","userId":2172778,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Cosmolade's music taste is a refreshing sight in the ranked section, ranking an english covery of a Fire Emblem song. Aside from this, she also ranked a few guest difficulties. Cosmolade's ranked sets are always a delight, so hopefully we see more from her in 2019!"},{"username":"CptSqBany","userId":3687666,"isRookie":"TRUE","commenter":"scub","comment":"CptSqBany is known for making challenging maps aimed at top players to flex their aim on everyone, but that does not mean he is not someone who can not make competent maps. In fact, he's ranked a lot of maps of Polish songs in 2018, just like he always does in the loved section. While these songs only click with a niche amount of players, they are always great additions to the ranked section, and his efforts in pushing a new, untouched genre will always be appreciated!"},{"username":"Cris-","userId":6175280,"isRookie":"TRUE","commenter":"Nao","comment":"Cris- joined the ranked section right at the start of 2018 and enjoyed a brief stint as a Beatmap Nominator. His maps are clean and represent the song without extreme spacing or excessive SV manipulation; most of them lie in the mid 4* to mid 5* range. Cris- mostly focuses on anime and k-pop in his GDs and sets. Be sure to check out his sets if you enjoy jump mapping set to cute female vocals."},{"username":"Crissa","userId":5405836,"isRookie":"FALSE","commenter":"Mordred","comment":"A member of the Demetori fanclub, Crissa makes his contribution by ranking quite a few Demetori maps himself. Exclusively being (usually fairly hard) marathon-style sets, they are sure to test your consistency skills to the extreme. He also started to become an active modder with the aim to join the Beatmap Nominators, in which he succeeded in early 2019."},{"username":"Croissant","userId":12481708,"isRookie":"TRUE","commenter":"Nao","comment":"Croissant ranked one map, a song from the Atelier series featuring some cute Japanese vocals. While the map is quite simple, it follows and highlights the unique features of the song. Unfortunately, they were restricted shortly after ranking it, so we probably won't be seeing any more maps from them for a while."},{"username":"Crystal","userId":1646397,"isRookie":"FALSE","commenter":"StarrStyx","comment":"Not to be confused with the CTB mapper, Crystal is a mapper who is also very well-known in the tournament scene, as well as the mapset host of one of the largest sets in 2017. He hasn't really been active in 2018, but has still managed to rank a mapset this year which contains interesting 1/3 rhythms."},{"username":"CrystilonZ","userId":2304063,"isRookie":"FALSE","commenter":"yaspo","comment":"Even though CrystilonZ's profile page shows a lot of pride as a furry, that's not the only thing they can be proud of. Their mapping is just as remarkable, always finding cool pattern gimmicks to add an interesting flavour to their style. Most notable in 2018 are the overlap gimmick on Junna's \"Here\" and the stream patterning on Paroto's \"Ju Tou San Chi Tian Qi Qing\". Curious to see how Crys will continue their march through the ranked section in 2019!"},{"username":"CXu","userId":84841,"isRookie":"FALSE","commenter":"Mordred","comment":"After 3 years CXu somehow managed to rank his set of sweet ARMS' \"Trust In You\", featuring fullscreen jumps pretty much everywhere! If you are looking for a challenging aim map you should definitely give this a try."},{"username":"DakiniBrave","userId":5174427,"isRookie":"FALSE","commenter":"scub","comment":"DakiniBrave is a fascinating example of an endangered species. After the near-extinction of modern Australian mappers, he is among the only ones left in the scene. As he is a lone kind, he has also come to terms with the anime mapping pack to keep his sanity as a human being with social needs. Despite adhering to his pack, he is quite the deviant compared to his anime-jump mapper mates with their TV-size rituals. More full-size anime maps, he hopes. Advocating for it, he does."},{"username":"Darcsol","userId":230432,"isRookie":"FALSE","commenter":"uc","comment":"Darcsol came back from a 4-year absence from the ranked section with their mapset \"IOSYS - Alice Dere,\" which was first uploaded 7 years ago. It was really cool to see it in the ranked section after all this time, and we hope to see them continue to stick around."},{"username":"Darksonic","userId":570042,"isRookie":"FALSE","commenter":"yaspo","comment":"With a name that will definitely bring up memories for some, Darksonic strikes the ranked section again after his long hiatus. Through his own ranked sets on \"Mugen Mirai\" and \"Endless Tears\", we can tell that he's on his way to finding a sweetspot between his older style and more modern mapping. He also made a retun to the GMT in 2018, looking out for all chat users once again. Whether it's for his cute blankets or for his moderation skills, we'll be happy to have him around in the coming years!"},{"username":"Dashyy-","userId":6513356,"isRookie":"TRUE","commenter":"Nao","comment":"Dashyy- ranked his first set at the beginning of 2018, a song by rock group Waterparks. He then immediately turned to anime mapping, ranking a few TV size sets over the course of the year. His GDs and uploaded maps encompass many genres, including rhythm game, rock, anime and electronic songs. Take a look at his maps if you enjoy a nice blend of sharp and rotational jumps reminiscent of pishifat's older rock mapping style."},{"username":"David-","userId":4436687,"isRookie":"TRUE","commenter":"yaspo","comment":"David- finds a comfortable start to his mapping carreer, ranking 3 GDs and his own mapset! Those who like the Pokemon Mystery Dungeon series will definitely find enjoyment in David's song choice. Hoping to see him explore mapping more this year; there still are a lot of really cool PMD tracks waiting to be mapped!"},{"username":"DaxMasterix","userId":264914,"isRookie":"FALSE","commenter":"gottagof4st","comment":"Ranking 1 ENH spread in 2018 may not look like much, but the map he ranked is of a rather unconventional genre and has multiple speedups and slowdowns which make it stand out over the other more normal ENH sets. They haven't done anything else recently but hopefully they'll try to show off more of what they can do with this type of songs in 2019."},{"username":"DendyHere","userId":4589786,"isRookie":"TRUE","commenter":"Mirash","comment":"Starting his career as a ranked mapper this year, he sadly got restricted after and was pretty much inactive the whole time, except some occasional guest difficulties. Will see news from him in 2019."},{"username":"Deppyforce","userId":5286213,"isRookie":"FALSE","commenter":"scub","comment":"This year, Deppyforce became absolutely infamous for mapping the full version of Harumachi Clover!!....In all seriousness though, Deppyforce is a Thai mapper who often experiments with lots of different mapping styles, techniques and mindsets in this maps. He does map anime for the most part, but that's not to say he doesn't know how to map anything else! Checking his ranked and unranked maps should show a plethora of maps made with various concepts and gimmicks, and it only goes to show that you shouldn't judge a book by its cover!"},{"username":"DeRandom Otaku","userId":5156153,"isRookie":"FALSE","commenter":"scub","comment":"If you've ever been in a multi lobby before, you should know him....or well, you should know him from one of his most famous maps, osu!memories! DeRandom Otaku makes pretty simple and clean but highly enjoyable maps for casual players, and that didn't change even through today! Not only should you appreciate him from his contributions to the mapping scene as a mapper, but DeRandom Otaku also achieved his beatmap nominator title and was responsible for ranking a good amount of maps this year! Overall it's been a great year for him, and we can't wait to see more!"},{"username":"Dilectus","userId":4287454,"isRookie":"FALSE","commenter":"scub","comment":"From the outside, Dilectus seemed like one of those mappers who only exclusively map western rock/metal songs, and his ranked map list certainly showed that. Despite that, he's also contributed lots of guest difficulties to anime mapsets! Although this dichotomy of personalities is already weird as is, what's even better is how he manages to utilize his style in BOTH genres, while still fitting the music well! Very weird combo, but I like it!"},{"username":"GIDZ","userId":2286528,"isRookie":"FALSE","commenter":"StarrStyx","comment":"GIDZ spent most of 2018 known as \"Dirty Farmer\" and established himself as a high level player. Despite this, he has also managed to put out a couple of quite decent maps this year, including a version of the Umaru opening and a couple of GDs on Chaoslitz and Regou's sets."},{"username":"DivineEnigma","userId":6599570,"isRookie":"TRUE","commenter":"Nao","comment":"DivineEnigma likes male vocals and j-rock. He ranked his first set in March 2018 and he also ranked an Insane GD in September. Most of the songs he's mapped are sung by male vocalists such as The Oral Cigarettes, Ryo-kun and amazarashi. He doesn't seem very actively currently, but we hope to see his return to mapping when he has more free time."},{"username":"DNR","userId":135630,"isRookie":"FALSE","commenter":"uc","comment":"Better known by their previous username \"CDFA\", DNR has been a staple community member for longer than most users have had accounts. After a brief period of restriction, DNR made their triumphant return to the ranked section by pushing polished sets that were years old, even picking back up a five-year-old collab mapset \"Aya Hirano - Hare Hare Yukai\", showing there is no need to hurry to the ranked section. While they may have since taken their leave from the game for personal reasons, their hard work in the community has left a lasting legacy that osu! will never forget."},{"username":"Doj","userId":4121612,"isRookie":"TRUE","commenter":"scub","comment":"After loads of work and effort learning through the mentorship program, Doj has finally gotten himself his very first ranked map! With the ranking of Masshiro na Yuki, a cute and simple map of a Halozy song, it marks his first steps in finding his untouched potential. However, it's been a pretty slow and inactive path, and we hope that with his skills, Doj will, some day, rise again and map some more stuff!"},{"username":"domSaur","userId":3806893,"isRookie":"FALSE","commenter":"scub","comment":"2018 has been domSaur's most active year yet, having ranked a total of 6 contributions, whether it be mapsets or guest difficulties. domSaur's maps are rather generic, yet very nicely structured with well-represented ideas and clean design. These maps are always well appreciated as additions to the ranked section, and we look forward to more activity from them in 2019!"},{"username":"Down","userId":4694602,"isRookie":"FALSE","commenter":"scub","comment":"Even though Down may be an underground name in the mapping community, he is certainly not someone who's incompetent. Being the winner of OMC #2 and beating mappers like Len and Taeyang, he's definitely someone who you should look out for! Aside from that, he has also brought solid maps to the ranked section with his fun and clean style! Definitely not a name to ignore in 2019!"},{"username":"DreaM117er","userId":1945090,"isRookie":"FALSE","commenter":"scub","comment":"DreaM117er, otherwise known as 117, is known for making maps highly representative of the song itself, and by playing them, you might feel like you're actually feeling the vibe of every single aspect of the song! Although 2018 has been a pretty slow year for them, 117 has brought lots of great stuff into the ranked section, whatever song it may be. They are trying to keep the activity up for 2019 with the revival of some graveyarded maps they've made, so let's see how this goes!"},{"username":"DTM9 Nowa","userId":5428909,"isRookie":"FALSE","commenter":"scub","comment":"If you're an avid osu!mapping Twitch stream chatter, this name shouldn't be too unrecognizable for you. DTM9 Nowa, a.k.a Nowaie, is a mapper who's capable of creating various competent maps of any genre! Aside from that, he's also contributed a lot into pushing more unconventional maps out there in the ranked section as a beatmap nominator which we all know is always great. Overall, he's been a great contributor to the healthy variety of osu! maps out there, and his efforts will always be appreciated!"},{"username":"ego_17","userId":1063607,"isRookie":"TRUE","commenter":"Mordred","comment":"ego_17 has been mapping for a long time, but only just ranked their first 2 maps! Not very often do you see someone rank a 3 or even 4 year old map as their first and 2nd, yet they did just that. I wonder if they'll keep doing that in 2019."},{"username":"eINess","userId":3789302,"isRookie":"FALSE","commenter":"scub","comment":"While 2018 has been a less active year for eINess (with an I and not L) compared to their last few years in the ranked section, they have made a good amount of contributions, both in guest difficulties and mapsets. eINess' style is quite simple, yet enjoyable, and with the maps they've put out over their mapping career, it shows that this mapper definitely has a solid place in the ranked section!"},{"username":"ACOMG","userId":1634443,"isRookie":"TRUE","commenter":"Hobbes2","comment":"ACOMG was an active modder who ranked his first map in 2018, a 30 second anime opening."},{"username":"dsco","userId":4330511,"isRookie":"FALSE","commenter":"VINXIS","comment":"My man climbed rocks while he maps he goes hard........... Also he ranked Utsukushii Kodoku this year, a really enjoyable top diff with a strong set to hold it up! That's one of his best so far, and he's got even better stuff in line for 2019!"},{"username":"ailv","userId":6933054,"isRookie":"FALSE","commenter":"Halfslashed","comment":"A self proclaimed follower of the \"Anxient Style\", ailv - not to be confused with aliv - brings a heavily pattern based approach to the ranked section, most notably on Diao ye zong's Touhou arrangements, but definitely not limited to them. His pattern based approach definitely doesn't neglect the song or gameplay though, which is refreshing. ailv also started his career as a BN earlier this year, promoting all kinds of great content, and also worked as a mentor in the community mentorship program. Last but not least, none can forget the four Saifu 'Kamiasobi no Uta' sets he ranked this year. Make sure you keep an eye out for kerokero again again again again, yet again in 2019!"},{"username":"Celektus","userId":4294993,"isRookie":"TRUE","commenter":"Halfslashed","comment":"Celektus starts out his mapping career with a heavily concept based take on Featured Artist Dictate & Culprate's \"Pencilina\". Subscribers to pishifat and handsome's schools of thought will be sure to find something they like in Celektus's style."},{"username":"CookieBite","userId":4835997,"isRookie":"FALSE","commenter":"StarrStyx","comment":"One notable thing about CookieBite would be that he ranked not one but two Tenacious D map in 2017. He still managed to rank a couple of sets this year as well."},{"username":"deadcode","userId":2688103,"isRookie":"TRUE","commenter":"StarrStyx","comment":"deadcode ranked a version of Yuc'e's Future Cider. We hope to see more from him in the future."},{"username":"eiri-","userId":3388410,"isRookie":"TRUE","commenter":"lcfc","comment":"Ever since her account has, on a happy note, been unrestricted, she has gone ham on the ranked section, with a whopping amount of *drumroll* 50 ranked maps in 2018! She contributed to the Standard and Taiko gamemodes almost equally; specifically, she ranked 22 maps in Standard, which is a very impressive amount! Only time will tell if she reaches a three-digit number of ranked maps before the end of 2019, but so far it seems definitely doable should she keep that speed up."},{"username":"Electoz","userId":6485263,"isRookie":"FALSE","commenter":"scub","comment":"Aside from being a pretty good mapper themselves, Electoz is also an active beatmap nominator responsible for pushing a huge amount of maps to the ranked section over the past couple of years. Not only that, but they've also arranged some modding puzzles for you to practice your modding skills if you ever want to try to become a beatmap nominator yourself! Electoz has made quite a lot of contributions to the mapping and modding community as a whole, and we can only thank them for all the work they've done thus far!"},{"username":"emu1337","userId":2185987,"isRookie":"TRUE","commenter":"Mordred","comment":"Usually you'd see someone get their first ranked map with some anime TV size set; however, this wasn't the case for emu. By making a set for the well known \"Heart of Courage\" by Two Steps From Hell, they managed to rank their first map, blessing us with an extremely underrepresented artist. They also ranked another song from the same artist near the end of 2018, and hopefully we'll get to see more of those in 2019!"},{"username":"EncoreW","userId":2775906,"isRookie":"FALSE","commenter":"Mordred","comment":"Previously known as T-Mac, EncoreW continued to show their love for Nightwish after a 2 year hiatus, mapping not just another set, but an entire 11 minute long compilation! Should you enjoy Nightwish as much as they do, you should definitely check it out."},{"username":"Enon","userId":2043401,"isRookie":"FALSE","commenter":"Mordred","comment":"If a map already has a very popular set, most wouldn't dare to create their own take on it. But this didn't stop Enon from mapping their own interpretation of Tatsh's \"Image Material\", a collab with Dailycare. Featuring quite a lot of rather long and spaced 260bpm streams, it is sure to challenge even the best players in this game!"},{"username":"-Keitaro","userId":3378391,"isRookie":"FALSE","commenter":"scub","comment":"-Keitaro is a fast-rising name within the mapping community, mainly for mapping a good amount of mapsets and guest difficulties, alongside his efforts to help the mapping community though modding! Will he be able to reach his goals of being a beatmap nominator in 2019? Will he become bigger than he already is? Only time will tell!"},{"username":"ErunamoJAZZ","userId":1869764,"isRookie":"FALSE","commenter":"yaspo","comment":"Sporting the alumni role, there's no doubt that ErunamoJAZZ has gone through quite the journey on osu!. Even so, he's definitely not done yet, ranking 2 of his older sets and a completely new one for \"To the Abyss!\". It was definitely inspiring to see their rendition of SoundTeMP's \"Title\", which cleverly combines complex timing with spacing usage to very closely represent the song's intense motions. One can only wonder what other hidden gems are to be found in Erunamo's graveyard; here's hoping we see more of them uncovered this year!"},{"username":"Euny","userId":3896865,"isRookie":"FALSE","commenter":"yaspo","comment":"Representing the Kpop scene, Korean native Euny keeps making sure players aren't missing out on this cool genre! Over the years she has proven that even the lowest of BPMs can be intense to play, and this year she continued her streak on \"Gashina\", a fun mapset full of engaging jump and slider patterns for kpop lovers to enjoy. We can only wonder how many more will fall in luv with her mapping this year!"},{"username":"F D Flourite","userId":2459589,"isRookie":"FALSE","commenter":"Mordred","comment":"F D Flourite ranked a set of Mamoru Miyano - Canon in 2018, mapping nearly all the standard diffs themselves, which is something I consider quite impressive for a 6 diff 4 minute spread. They also continued to work as a BN for about half of the year, which will always be appreciated."},{"username":"fanzhen0019","userId":418699,"isRookie":"FALSE","commenter":"scub","comment":"It has been 7 whole years since fanzhen0019 started mapping, and yet somehow he's still cranking out very unique yet representative maps to this day! Through his renditions of \"Gyogyotto Ningyo Bakkon Bridal\" and \"VOICE OF TRUTH\", he solidified his place yet again as the \"Steady Surprise\" of the mapping community."},{"username":"Faputa","userId":845733,"isRookie":"TRUE","commenter":"yaspo","comment":"Despite being an active Taiko mapper, Faputa also gave a shot to Standard mapping last year. Even though mastering two modes can be a demanding goal, their lower difficulties are a solid start. We wish them the best of luck in juggling both modes!"},{"username":"fartownik","userId":56917,"isRookie":"FALSE","commenter":"Mordred","comment":"Not very often do you see someone disappear from the ranked section for a whole 6 years and then come back with a map that has a style even older than that. However it doesn't just have 1 style, but 7 different ones, all done by the same mapper! Will fartownik quit ranking maps for 6 years again or will we see more of them in 2019?"},{"username":"FiddleBlue","userId":7984965,"isRookie":"TRUE","commenter":"Nao","comment":"FiddleBlue started mapping in late 2016, but ranked his first map in early 2018. The map is a 5* marathon of \"Hoshi Miru Koro o Sugite mo\" by HAG. Aside from that, he mostly maps anime and j-pop"},{"username":"Finshie","userId":2018960,"isRookie":"FALSE","commenter":"scub","comment":"Inspired by mappers like dsco and guy, Finshie's maps represent a mindset between those two mappers. Visually compelling maps are definitely in the checklist, as well as looking natural and not being too strict with aesthetics. In pairing these concepts with their versatility in representing the song, Finshie definitely made some great maps in 2018. Play them and you'll what I'm talking about!"},{"username":"Firis Mistlud","userId":2433720,"isRookie":"FALSE","commenter":"Gottagof4st","comment":"Improving a lot in 2018, Firis also showed he can map other genres and styles than just Japanese songs with female vocals; they did this in their collab with Miura, which resulted in \"Amenohoakari\", a great map to play which shows off the nice flowing movement they have in their maps. Hopefully 2019 will bring more of this!"},{"username":"Foxy Grandpa","userId":5580983,"isRookie":"FALSE","commenter":"Gottagof4st","comment":"2018 was a varied year for Foxy Grandpa, as he didn't stick to one genre but instead showed his mapping skill across multiple types of music from melodic dubstep tracks like Thrones to high intensity, high BPM songs like Abyss by Asriel. 2019 also shows great promise as Foxy Grandpa continues his trend of not sticking to one particular style, putting forth a wide variety of maps."},{"username":"FrenZ396","userId":9531903,"isRookie":"TRUE","commenter":"Nao","comment":"FrenZ396 managed to rank his first map in September of 2018, shortly followed by another one in December. While both of those top out at the Insane level, most of his maps are Extra difficulty stream maps, featuring songs from xi, Ice, and other popular rhythm game artists. This is definitely a mapper to follow if you enjoy rhythm game music and well-constructed stream challenges!"},{"username":"Fursum","userId":4865030,"isRookie":"FALSE","commenter":"scub","comment":"A newcomer to the osu!mapping scene, Fursum has followed the route taken by mappers like Fort and Asphyxia which is to map a lot of drum and bass music. Through his knowledge in the editor and powerful rhythms, he is able to bring the genre he always wanted to bring to the ranked section in style!"},{"username":"Fycho","userId":1876867,"isRookie":"FALSE","commenter":"StarrStyx","comment":"Any pp farmer will have played at least one Fycho map; his jumpy mapping style has defined pp mapping since the times of Best FriendS. This year he was mostly known for his position as a QAT, but still managed to put out a few maps including \"Daisy Blue\" by his beloved Kano."},{"username":"Gaia","userId":2683648,"isRookie":"FALSE","commenter":"scub","comment":"Gaia absolutely knows how to make engaging and really fun maps of any J-pop song out there! Inspired by mappers like Kibbleru and iyasine, Gaia maps feature design that is rather simple but very well executed. This year is no different, as Gaia has gotten a couple of maps and guest difficulties to osu!'s ranked section with quality just as great as ever! This mapper won't disappoint you for sure, especially if you're a big fan of good anime maps."},{"username":"GalenTori","userId":5057420,"isRookie":"TRUE","commenter":"yaspo","comment":"GalenTori's Christmas must have been as exciting as their avatar, they got exactly the present they've been waiting for: a very first ranked map! Even though it's a simple start, their pending and graveyarded maps are signs of untapped potential. If they keep it up, there is no doubt that a wonderful mapping year awaits them!"},{"username":"Gamu","userId":611174,"isRookie":"FALSE","commenter":"Mordred","comment":"After being absent from the ranked section for 3 years, Gamu returned with their take on Memme's \"Marionette\". Mapped in a clean style, it is sure to please both the eyes and the player."},{"username":"Garden","userId":2849992,"isRookie":"FALSE","commenter":"Mordred","comment":"Ever since their first ranked map, Garden has consistenly been pushing high quality maps to the ranked section, and 2018 was no exception to that. Ranking both long and short versions, nearly everyone should be table to find something to enjoy in their maps. Aside from ranking their own maps, they also maintained a high level of activity as a BN for almost all of 2018, helping countless mappers to rank their own sets. It is sad to see them leave the BNG in early 2019, but it looks like they're still mapping so I'm excited to see what they'll do!"},{"username":"gary00737","userId":6029467,"isRookie":"FALSE","commenter":"scub","comment":"This guy is everywhere! Whether you've seen him within the ludicrous amount of guest difficulties he's made or through his own maps, gary00737 is definitely a recognizable name. Though he has a particularly simple style, this doesn't stop him from making really fun maps of any difficulty, of any song, and of any genre! This guy definitely has lots of knowledge in making difficulties of all kinds, and he does it within only a bit over a year of mapping! With this level of improvement, I won't doubt that we will get even more enjoyable maps from gary00737 this year!"},{"username":"Godot","userId":6466477,"isRookie":"TRUE","commenter":"Mordred","comment":"Godot ranked their first map towards the end of 2018, an interesting take on Agent Fresco's \"Dark Water\". Featuring multiple concepts, it expresses the song surprisingly well, utilizing different concepts for different sections of the map."},{"username":"Gottagof4st","userId":6122935,"isRookie":"TRUE","commenter":"Nao","comment":"Gottagof4st truly lived up to his name, speedrunning the entire mapping system and ending up as a QAT after a few short months of high-activity BN work. He mostly maps utaite covers and anime songs, but also ranked a few songs by Touhou doujin circle Akatsuki Records. In addition to mapping, he maintains high nomination and QAT activity alongside reviewing BN apps and keeping the system running smoothly."},{"username":"GreenHue","userId":4967662,"isRookie":"TRUE","commenter":"scub","comment":"GreenHue is a newer mapper, only ranking his first map in 2018. Despite that, he's made absolutely ludicrous amounts of maps, whether it be in the form of mapsets, or through his guest difficulties! Aside from that, he is also a versatile mapper who has ranked maps of various songs spanning numerous genres. Whether it be his rendition of *namirin's \"only my railgun\" or Hatsuki Yura's \"Lunicode\", GreenHue has proven his competence, and we're pumped to see more maps from this dude in 2019!"},{"username":"HabiHolic","userId":1974436,"isRookie":"FALSE","commenter":"yaspo","comment":"Where to even start. HabiHolic, a Korean mapper who is in no need of introduction nor one who is easy to summarize. They're pretty much a machine, ranking multiple GDs each month and hosting their own sets on top of that. -On top of that- , every single one of their maps keeps up an impressively high level of polish and enjoyment. Fans of My First Story will definitely find a welcome home on Habi's userpage, offering more high quality maps they could wish for. There's no doubt they'll keep going throughout 2019, so only one question remains: how do they keep doing it? This level of productivity is beyond me, so I'm hoping to find out about their secret techniques this year!"},{"username":"egg and cheese","userId":3789276,"isRookie":"FALSE","commenter":"gottagof4st","comment":"In 2018 egg and cheese, also known as Hakura, showed us the variety of mapping styles he can use for different genres, from lower insanes of calmer songs utilizing wide angles to bigger challenges on more intense songs like Fairytale. Some of his well known maps from 2018 that weren't ranked - like Paris Taxi Ride and Duck Tales - may also make their return in 2019, so there is plenty to look forward to."},{"username":"Hakurei Yoru","userId":3280555,"isRookie":"FALSE","commenter":"scub","comment":"Ever since winning Newspaper Cup #2, Hakurei Yoru has definitely not wasted his potential in becoming a competent mapper! Through his growth within the Chinese mapping community, he's developed a complex sense of patterning and slider velocity control, and he was able to use these to make some interesting maps in 2018. His recent maps feature usage of unusual slider velocity handling that is nonetheless weirdly fitting to the music, and you will never know where this unique niche will bring Yoru in 2019!"},{"username":"Halfslashed","userId":4598899,"isRookie":"FALSE","commenter":"Mordred","comment":"Sadly a somewhat unknown name, though mostly because he rarely finishes and ranks maps. As one of the lead organizers of the community mentorship program, Halfslashed went above and beyond to provide an opportunity for a ridiculous amount of new mappers to improve their skills in a guided environment. During his time as a BN he kept up a very solid level of activity and nominated a lot of maps most BNs wouldn't even dare to touch. While he did get removed from the BNG in mid 2018, rumor has it he's been farming activity to reapply soon. While doing all of that, he also ranked a map of SYNC.ART'S - Graveyard in lake. It is also noteworthy that he is extremely talented in procrastinating to do his collab parts."},{"username":"Hanazawa Kana","userId":2345298,"isRookie":"FALSE","commenter":"scub","comment":"When I first heard about this mapper, I thought of some random who ranks generic anime stuff. After playing some of their maps, though, I can assure you that this is not at all the case with Hanazawa Kana! While they do upload some cutesy maps from time to time, that doesn't stop them from mapping some great vibey stuff nicely. Their most recent maps should show off their ability too, with highly entertaining gameplay and movement. With all this in mind, I'll be sure to check out more from this mapper, and recommend you do too!"},{"username":"Hari","userId":7197903,"isRookie":"TRUE","commenter":"Nao","comment":"In 2018, Hari ranked two k-pop GDs as well as a set of \"ONLYWONDER\" by frederic. Their song taste is quite diverse: they've mapped rock, all varieties of pop, and even some electronic music, and they don't seem to be slowing down. Stay on the look out for more of their sets hitting the ranked section soon!"},{"username":"Haruto","userId":3772301,"isRookie":"FALSE","commenter":"scub","comment":"Haruto told me in DM once that he's been trying to copy more appleeaterx this year, and traits of this definitely show in his more recent maps! Through this clean and fun style, he's brought good additions like his rendition of yanaginagi's \"Haru Modoki\" to the ranked section. He's also told me that he may be planning to explore more styles, so I'm hyped for what he makes in 2019!"},{"username":"Hazu-","userId":4668230,"isRookie":"FALSE","commenter":"scub","comment":"To Hazu-, 2018 was the year of Osomatsu-san songs! Bringing two Osomatsu-san maps into the ranked section, they have definitely done the justice of giving this anime more traction within the osu!community. While not particularly complex or special, these maps do have their own good aspects! I would recommend playing these maps, both because of the maps themselves and the anime the maps came from!"},{"username":"Hey lululu","userId":4086497,"isRookie":"FALSE","commenter":"scub","comment":"Having a literal addiction to the artist \"Diao Ye Zong\", it should be clear that this guy also brought a proficiency in alternator style maps along with him. He's ranked a truckload of fun and challenging alternator style maps ranging various tempos, and it doesn't like he'll stop soon, either!"},{"username":"Hiicantpk","userId":2065771,"isRookie":"FALSE","commenter":"Mordred","comment":"The mapper of the famous \"Weaponized\" returns with their interpretation of Sawano Hiroyuki's \"sh0ut\". While the song has a rather high bpm, the map compensates for that by utilizing a really simple style, allowing tons of players to enjoy a map of this song should they not be able to play the harder versions, or if they simply wish to relax to a nice piece of music."},{"username":"Hikan","userId":7968702,"isRookie":"FALSE","commenter":"scub","comment":"Hikan is a mapper who ranked a clean map of an idol song in 2018, yet sadly disappeared from the mapping community soon after. They are showing signs of life in 2019 though, so let's see how this year goes!"},{"username":"Hishiro Chizuru","userId":8402897,"isRookie":"TRUE","commenter":"Nao","comment":"Also known as [ amb1d3x ], Hishiro Chizuru ranked a collab map of Sayuri's \"Tsuki to Hanataba\" in October before getting restricted. He also had a few other sets uploaded, including a collab with Hailie and Shanipika, and a few anime GDs. Hopefully he keeps mapping and GDing as he was showing a lot of progress in the past few months!"},{"username":"Hobbes2","userId":8157492,"isRookie":"FALSE","commenter":"uc","comment":"Hobbes2's contributions to the mapping scene in 2018 cannot be understated. They were omnipresent in the qualified section, helping rank a wide variety of mapsets as a BN and being one of the most active members of the QAH we've ever seen, with their dedication to assuring quality being rightly rewarded with a promotion to the QAT midway through the year. They also added diversity to the ranked section with their own ranked sets, both in terms of song choice and mapping style. While it appears they may be fading away from the game to pursue a career in the Smash community instead, they will always be remembered as a good friend to everyone in the community. Oh, and make sure to follow them on Twitch!"},{"username":"Hokichi","userId":6607303,"isRookie":"FALSE","commenter":"scub","comment":"Although more known for his storyboard work, Hokichi is also a skilled mapper whose abilities definitely showed when they brought, for example, a fun, relaxing, and cohesive mapset of yanaginagi's \"landscape\" to the ranked section! Please keep us entertained in 2019 as well!"},{"username":"HonKAn","userId":2489741,"isRookie":"TRUE","commenter":"yaspo","comment":"HonKAn has finally opened the door to their mapping career by ranking their first map: Garnidelia's \"Mirai\". Taking full advantage of the gentle 80bpm, this map's flow feels both nuanced and impactful. With their clean style, there's no doubt HonKAn will have a succesful mapping future."},{"username":"Vespirit","userId":5425046,"isRookie":"TRUE","commenter":"yaspo","comment":"Hearing the opening of \"My Life As A Teenage Robot\" is a nostalgia trip I didn't expect to have while writing this. However, Vespirit is here to bring back memories of a joyful past. Nostalgia aside, Vesiprit definitely blasted into the ranked section last year with their own ranked set and a list of ranked gds. Even though HC likes to map shorter songs, that doesn't hold them back from filling every difficulty with a ton of fun patterns. With all the OSTs in their graveyard, I wouldn't be surprised if Vespirit triggers my nostalgia again this year!"},{"username":"hypercyte","userId":9155377,"isRookie":"TRUE","commenter":"Nao","comment":"hypercyte uploaded his first map in early 2017 and showed steady improvement until ranking a map in March of 2018. He went on to join the BNG in April, continuing to map and mod actively. His song taste leans heavily towards anime and j-pop, and his mapping style focuses on using overlaps, unique sliders, and stacked patterns to represent changes in song structure. Take a look at his maps if you enjoy mid 4* to 5* mapping with more of a focus on representing unique parts of the song than your average anime map."},{"username":"Imakuri","userId":6100837,"isRookie":"FALSE","commenter":"scub","comment":"Imakuri is a small guy with BIG plans! Despite never ranking anything above a hard difficulty, this doesn't stop him from connecting with more mappers to plan out the biggest mapping contest in the history of osu! for the coming year! Let's see how this contest will hold up!"},{"username":"Imouto koko","userId":7679162,"isRookie":"FALSE","commenter":"Mordred","comment":"Despite only ranking 3 sets in 2018, the types of maps Imouto koko ranked are surprisingly diverse. Ranging from a simple NH map for a calm song to a full size eroge spread to a marathon USAO map, they are sure to have something that suits your taste."},{"username":"IntellectualBoy","userId":873758,"isRookie":"FALSE","commenter":"scub","comment":"IntellectualBoy, or better known from their previous in-game moniker, Gloria Guard, is an old mapper who's shifted their style towards mapping songs from the Japanese Drum and Bass genre. In 2018, they ranked an approval length mapset of an USAO remix, but sadly, it might be the map that marks the end of their osu!mapping career, as he's shown to have quit pretty recently. Whatever their endeavors may be, we can only appreciate their efforts within the mapping community and wish them all the best!"},{"username":"InternalLight","userId":6221637,"isRookie":"FALSE","commenter":"lcfc","comment":"While ranking only only one N-H set in 2017, InternalLight has nonetheless made sure to showcase more of his mapping capabilities this time around, ranking another set as well as several interestingly designed guest difficulties, including one that seems to be a... cover of Yuima-ru*World? His mapping skills aren't limited to those difficulties, though, as his maps in the graveyard are only better and are surely worth checking out!"},{"username":"Ipas","userId":3262377,"isRookie":"FALSE","commenter":"scub","comment":"While Ipas isn't a particularly well known name, he should be! His maps always feature very fun and relaxing gameplay, and though this was the first time he was active since 2015, his skills definitely haven't rusted one bit; some would even say he's the opposite of rusty! Ranking two mapsets and two guest difficulties this year, Ipas has definitely made positive progress on his mapping activity, and we hope he keeps it up for 2019!"},{"username":"Irohas","userId":4403937,"isRookie":"FALSE","commenter":"scub","comment":"If you've ever indulged in anime mapping or just marathoning J-pop maps before, Irohas shouldn't be a strange name to you! This mapper created loads of fun maps for you to enjoy this year, whether through his guest difficulties or through his own maps. This shouldn't be too surprising either, considering some of his inspirations are appleeaterx and Milan-, who are known for making seriously fun maps themselves! This year has been great for Irohas, and I'm looking forward to what he'll be doing the coming year!"},{"username":"Irreversible","userId":1287964,"isRookie":"FALSE","commenter":"StarrStyx","comment":"The CS7 man himself."},{"username":"Irya","userId":2996670,"isRookie":"TRUE","commenter":"yaspo","comment":"Formerly known as [XV], Irya ranked their first 2 maps under 2 different names. Both feature cleanly mapped normal and expert diffs as well as a ton of different guest difficulties for players to enjoy. Especially notable is Irya's cute song choice, and we hope they'll return to the mapping scene this year!"},{"username":"iYiyo","userId":3919785,"isRookie":"FALSE","commenter":"Monstrata","comment":"Would you believe I've known iYiyo since before I even had a ranked map?! iYiyo maps are characterized by a loose geometric style that emphasizes fun jump patterns while still being faithful to the song's emphatic structure. He's been a significant contributor to osu's growing collection of ranked Naruto, One Piece, and other shounen anime songs. Oh, and he also does k-pop! In addition to being a mapper, iYiyo also contributed to the ranked section as a BN in 2018. He has since retired, but we thank you for your service man!"},{"username":"Jabba","userId":6068934,"isRookie":"TRUE","commenter":"Nao","comment":"Jabba ranked his first map, a set of \"Jounetsu Utopia\" from Koi to Koisuru Utopia, in 2018. It features interesting techniques like jumpstreams, kickslider streams, and unique rhythm. His other maps include various energetic anime songs like My Sweet Maiden and Uncontrollable as well as some more electronic stuff."},{"username":"jas","userId":8920907,"isRookie":"TRUE","commenter":"Nao","comment":"jas ranked a well known song from Stranger Things at the start of 2018. However, his focus in mapping mostly lies in creative use of slider patterns and mechanics; check out his Marble Soda map if you want a taste of some interesting Aspire-style techniques. Aside from electronic music, he has mapped anime, punk rock and pop - truly a man of many tastes. It's hard to summarize jas's mapping in one or two lines, so go and play his maps yourselves: each one will be sure to provide a unique experience from the others."},{"username":"Jean-Michel Jr","userId":4430948,"isRookie":"TRUE","commenter":"yaspo","comment":"Even though he's only a junior when it comes to ranking maps, Jean-Michel's mapping shouldn't to be underestimated. With cleanly handled stream design on \"The MadPiero Laughs\" and his recent \"Sakura Mirage\", it's clear that he isn't afraid of challenging the stamina and accuracy of top players. Definitely looking forward to burning through my keyboard on his future maps!"},{"username":"Joe Castle","userId":4890427,"isRookie":"FALSE","commenter":"Hobbes2","comment":"In a year of 8 star extras, 7 star extras, 6 star extras, and, dare I say ... 5 star extras?, Joe Castle stood out among the crowd with his dedication to ranking Easy / Normal difficulty sets. 2019 showed an evolution in Joe Castle's technique, with his mapsets now having Hard icons in them. Maybe in 2019 we'll see an Insane? Only time will tell."},{"username":"jonathanlfj","userId":270377,"isRookie":"FALSE","commenter":"Mirash","comment":"Consistently doing his job as a part of the Beatmap Nominators group he also mapped a great deal; he ranked a total of 7 mapsets of his own as well as several guest difficulties. Some of those mapsets were mapped and ranked on behalf of Mappers' Guild, a group that he is a member of that helps the game grow through music that is licensed for the game to use. His style changes slightly every once in a while, taking into account yearly trends in mapping; we will see where this leads him in 2019."},{"username":"Jounzan","userId":1848318,"isRookie":"FALSE","commenter":"Mirash","comment":"Despite leaving the game and coming back many times, Jounzan (who still is better known as EvilElvis) managed to create a bunch of maps for his graveyard folder and also ranked two sets. He also worked as a part of the Mappers' Guild, won MCA 2018, taught newcomers via the mentorship program, and was active in supporting Russian community enthusiasts. Throughout 2018, he continuously worked to create a style that he was satisfied with, which many enjoyed and even now consider to be a \"Russian\" style. He also had ambitions on doing a \"birthday maps\" project, though this fell by the wayside. Jounzan made great contributions despite his numerous attempts to leave the game - as always we will see him in 2019!"},{"username":"JrSzZ","userId":8845986,"isRookie":"TRUE","commenter":"Nao","comment":"JrSzZ ranked his first map in November, an upbeat USAO song full of jumps, streams, and creative slider patterning. If you enjoyed that one, he has plenty of similar maps in his graveyard - he's mapped USAO, aran, Panda Eyes and Yukacco. Unfortunately, he's also restricted, so we probably won't see much more than what's already there for a while."},{"username":"KaedekaShizuru","userId":2248417,"isRookie":"FALSE","commenter":"Gottagof4st","comment":"Previously a pretty active ranked mapper, Kaedeka only ranked one map of an eroge song in which they mapped the Normal and the Insane. Maybe 2019 will bring more as they have ranked a map every year for the past couple of years."},{"username":"Kagetsu","userId":6203841,"isRookie":"FALSE","commenter":"Mordred","comment":"Known for their incredibly comfortable maps, Kagetsu ranked 2 more sets this year, both featuring songs by The Oral Cigarettes. While this artist wasn't really mapped a lot in osu before, Kagetsu's sets sparked the inspiration for tons of other sets to follow, which ultimately resulted in The Oral Cigarettes becoming as popular in osu as they are now. They also continued their work as a BN for half of the year before resigning in mid 2018."},{"username":"Kalibe","userId":3376777,"isRookie":"FALSE","commenter":"Mirash","comment":"Taking a 180 degree turn in his mapping style, Kalibe began creating what are considered \"anti-pp\" maps; to be more specific, he started copying Jounzan's style, one with which many were previously unfamiliar. This style utilizes unconvential movements such as lower spacing on strong sounds and slider shapes that may not impress on their own but work together as a composition. His mapping started to heavily depend on contrasts between different sections in music, and his hitsounding went from the point of \"just being there\" to a level where it greatly improved his maps. 2018 was a very productive year in both mapping and modding for Kalibe, as he even became a member of the BNG, pushing maps to ranked that tickle his fancy. We'll see him in 2019, of course!"},{"username":"Kalindraz","userId":2313166,"isRookie":"FALSE","commenter":"yaspo","comment":"If you're looking for a tough but consistent challenge, then Kalindraz is a perfect fit for you. Their mapset of \"Avalanche\" and guest difficulty on \"KAEDE\" are deceptively tricky but still balanced, ideal for those who are looking to improve. Here's hoping that Kalindraz can keep this up in 2019; players can always use someone who catches them off guard!"},{"username":"kanor","userId":3131236,"isRookie":"FALSE","commenter":"scub","comment":"Despite them rarely ranking anything that reaches an extra icon, kanor is still a competent mapper who's made some great contributions, especially in the Chinese mapping community, through his very well made and visually compelling guest difficulties of various songs! Despite having made lots of high-effort contributions, they don't seem to be stopping. This only goes to show how dedicated they are to contributing to the ranked section of osu!, and we can't wait to see more!"},{"username":"Karen","userId":3143784,"isRookie":"FALSE","commenter":"Mirash","comment":"Despite being less active than he used to be as well as being retired from the Beatmap Nominators Group and generally being less interested in mapping, Karen ranked one mapset of his own as well as creating several guest difficulties and maps for the graveyard. This decrease in activity doesn't mean that Karen's mapping skill decreased, as his style still manages to capture songs' rhythm and provide the joy of clicking diligently. Hoping to see his mapping stay alive in 2019!"},{"username":"lolia","userId":1596078,"isRookie":"FALSE","commenter":"yaspo","comment":"Karia hasn't stopped the ranking train ever since they started in 2014, and the massive search listing is proof of just how much energy they have. With this much experience it's no surprise that they have developed a consistent style that they can adjust to just about any song. Especially notable are their full version set of \"Ashita no Kimi sae Ireba Ii.\" and the bouncy fun 1/3 jumps \"Jin Jin Jingle Bells\". Whether it's on their own maps or on guest difficulties, they never seem to run out of fun patterns, making them a favorite amongst players. There's no doubt they'll continue to be a big figure in the Korean mapping scene under their new, sensational ... and also questionable name \"lolia\"."},{"username":"Kashima","userId":4370368,"isRookie":"TRUE","commenter":"scub","comment":"Taking inspiration from mappers like Karen, it should be no surprise that Kashima also becomes a mapper who makes challenging maps of generic anime maps. Despite seemingly appearing just now in 2018, Kashima has actually been mapping since the year before, and even won runner-up places in several contests such as the 3rd iteration of Newspaper Cup! It's almost certain that this guy is going to be very well respected once he reaches his peak, hopefully in 2019!"},{"username":"Kawa","userId":4588894,"isRookie":"TRUE","commenter":"Mordred","comment":"After mapping for 3 years, Kawa finally managed to rank their first map, a 7 minute long DnB marathon collab. As expected, it provides a relaxing gameplay experience, accompanied by a nice storyboard."},{"username":"Kawashiro","userId":1533796,"isRookie":"FALSE","commenter":"uc","comment":"Kawashiro ranked a couple interesting mapsets this year, with their most popular being the very serious original metal remix \"Kizuna AI - FUCK YOU!\" Unfortunately, they had to leave for the army halfway through the year. We wish them the best, and hope they return in full in 2020."},{"username":"Kayne","userId":1474421,"isRookie":"FALSE","commenter":"yaspo","comment":"2 years of waiting was only the calm before (Fury of) the Storm. Kayne, also known as Kiyro, finally added another Dragonforce map to the game this year, ready to test the streaming ability of all who dare to atempt it. After going through the \"Valley of the Damned\" and conquering \"Fury of the Storm\", I wonder what the next step will be in their Dragonforce mapping journey."},{"username":"Kencho","userId":3178411,"isRookie":"FALSE","commenter":"StarrStyx","comment":"Aside from his GDs, Kencho ranked a Cantopop song this year, which is a breath of fresh air from oversaturated genres. If you are looking for something different to play, especially if you are a Cantonese speaker or even a Cantopop lover, look no further."},{"username":"Kibbleru","userId":3193504,"isRookie":"FALSE","commenter":"uc","comment":"Kibbleru was a huge contributor to osu! in 2018, offering countless GD's and ranking some of their most unique and memorable sets yet alongside all their hard work as a BN. Their expertise and work ethic resulted in them being promoted to the QAT, where they further worked in the Qualified section. Their commitment to this game is admirable, and while we hope to see them continue to promote high quality maps in 2019, we understand they may be too distracted playing Risk of Rain 2, the 3d shoot and loot game with gradual difficulty scale that makes infinite replayability on top of rogue like elements, sequel to Risk of Rain, the 2d side-scrolling class-based roguelike."},{"username":"Kite","userId":134572,"isRookie":"FALSE","commenter":"scub","comment":"Kite has long been known for mapping some of the more famous intense and challenging maps, and this certainly remained the case in 2018. Their most recent map of TERRA's EDEN shows their ability, with map elements that test aim to the fullest while remaining a fun map overall! They've made really solid additions to the ranked section, and we hpe to see more good maps in the coming year!"},{"username":"KKipalt","userId":6889573,"isRookie":"TRUE","commenter":"Mordred","comment":"Not a lot of mappers can say that they ranked a full 4 minute set as their first ranked map, even less if they've created four whole difficulties all by themselves, yet KKipalt did exactly that! Sharing their map of Hatsuki Yura's \"Dark Night Fairy: finis\", a severely underrepresented artist, they own all the bragging rights when it comes to first ranked maps. They also ranked another marathon set towards the end of the year, featuring an underrepresented artist yet again."},{"username":"Kloyd","userId":1574070,"isRookie":"FALSE","commenter":"Mirash","comment":"The Japanese CS5 god, luckily for us, descended from the clouds and delivered to us the pleasure of playing his map \"Team Grimoire - C18H27NO3(extend)\" for ranked scores at long last. We will be waiting for another such delivery in 2019 as well!"},{"username":"Kotori-Chan","userId":4060979,"isRookie":"FALSE","commenter":"scub","comment":"Ever since his finalist-worthy map of Aspire 2017, Kotori-Chan has been mapping on the lower end of the spectrum, with the ranking of a cute low-diff solo mapset of a Christmas song at the end of 2018. As osu! lacks them, low star rating maps of calm and relaxing songs are always appreciated, especially coming from a mapper who specializes in them! All in all, it's been a pretty nice year for Kotori-Chan, and we can only hope to see more stuff from them in 2019!"},{"username":"Kowari","userId":5404892,"isRookie":"TRUE","commenter":"Mordred","comment":"Joining the ranked section in 2018, Kowari presents \"nameless x toa - Patchwork Staccato\", a simple cs5.5 Insane. However, they also helped others to complete their sets by creating quite a few guest difficulties!"},{"username":"kpx-x","userId":6709675,"isRookie":"TRUE","commenter":"Nao","comment":"kpx-x entered the ranked section in December 2018 with \"Futatsu no Kage\" by Harukaze Mayuki. The map is a cute 3.8* marathon matching the similarly cute vocals of the song. He doesn't seem to map much anymore, but his other uploaded maps include several eroge and rhythm game songs, so give him a shot if you enjoy those genres."},{"username":"Krfawy","userId":1478292,"isRookie":"FALSE","commenter":"uc","comment":"Krfawy has been around the scene for a good while, promoting the importance of caring about lower difficulties. They continued this in 2018 by ranking a plethora of lower diff GD's, along with a set of their own where they mapped the Easy and Normal. Mappers like this that focus on the less-popular aspects of mapping are always appreciated, and we hope to see them continue in 2019."},{"username":"Wuab","userId":7725544,"isRookie":"TRUE","commenter":"Nao","comment":"Wuab ranked his first map in May 2018. He then name changed to kuaib in order to get a BN check on what became his second ranked map in November. His maps are mostly j-pop, anime, and eroge songs, coming in around the Insane difficulty level. He recently began mapping more actively, so stay on the lookout for more of his stuff in the ranked section."},{"username":"kunka","userId":1741295,"isRookie":"FALSE","commenter":"yaspo","comment":"With a ranked set count that vastly surpasses their graveyarded maps, kunka is probably one of the most reliable set hosts you can find. Reliability in ranking sets isn't the only proof of their experience: their maps show this off even better. With interesting angle usage on \"Grand Symphony\" and unconventional low bpm patterns on \"Shiny Days\", it's clear that kunka has no issues handling less common mapping ideas. Definitely hoping to see more kunka this year.. as long as they don't apply it to their username."},{"username":"Kurai","userId":77089,"isRookie":"FALSE","commenter":"scub","comment":"Despite their work as Global Moderator, Kurai still had enough free time to whip up a simple and vintage yet entertaining map in 2018! I am, of course, talking about their rendition of capsule's Hello, a cute normal-hard mapset of a chiptune-composition style song. With a map this entertaining and cute, I can only hope for more stuff from Kurai!"},{"username":"Kuron-kun","userId":2697284,"isRookie":"FALSE","commenter":"yaspo","comment":"2018 was a phenomenal year for Kuron-kun. Rejoining the BNG in early january was a great start, and things only improved from there, as they followed up by ranking their intense 8 star rendition of SOOOO's \"Happpy Song,\" which landed with a huge impact on the community. Little did they know this artist would later be added to the Featured Artist listing -and- that the map would end up highly rated in Community Choice. It doesn't end there; climbing up to QAT later in the year was an ideal way to close it out. There's no doubt Kuron can look back on 2018 positively in the years to come, and we're hoping they keep up their great efforts. Thank you!"},{"username":"kwk","userId":365586,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Kwk started off this year by ranking \"Nadeshiko color Heart\", continuing his mission of producing quality alt maps with interesting challenges. However, later in the year with his \"Paradise\" mapset, he showed the community that he can handle more complex songs with his clean and well thought out style. Definitely a mapper to keep an eye out for if you're looking for high quality challenge maps."},{"username":"Kyle73","userId":3767927,"isRookie":"FALSE","commenter":"scub","comment":"Recently I was in a multi with a bunch of people when someone chose a Kyle73 map. Going in blind, I didn't have high expectationg as it was a name I'd never heard of before. But to my pleasant surprise, he actually turned out to be a pretty good mapper! After the multi was over, I went to check more from him, and I can say that Kyle does have very solid additions to the ranked section himself! While it's true that TV size anime mapping has been pretty abundant over the past few years, I can safely say that I genuinely enjoy his maps, and I hope to see more from this guy in the coming year!"},{"username":"KyotoYushiro","userId":5843473,"isRookie":"TRUE","commenter":"Nao","comment":"KyotoYushiro enjoys calm amazarashi songs. His first ranked set \"Seikatsu-kan\" clocks in at 84 bpm and 2.4 stars, and his next set featured a similarly peaceful song. As calm music is a severely lacking genre in osu!, we hope to see more from him in the future!"},{"username":"Kyuukai","userId":5337374,"isRookie":"FALSE","commenter":"scub","comment":"A lot of people would recognize their name, as Kyuukai's name has been on a lot, and by that I mean a LOT, of osu!'s most played (24 hours) maps. Despite mapping almost exclusively anime songs, they also show competence in mapping lots of different tempos, from the calmest to the most intense! With this level of versatility, especially within their few ranked maps that were not tied to the anime genre, they are able to satisfy a great amount of players, and additions such as this are very much appreciated within the osu! community."},{"username":"Lafayla","userId":5312547,"isRookie":"TRUE","commenter":"Mordred","comment":"New to the ranked section, Lafayla makes their debut with a single Insane diff set of Hanatan's \"Kokoronashi\", showing that not everything has to be an Extra diff to be enjoyable. On top of ranking another short set with a lot of difficulties, they also joined the Beatmap Nominators, helping lots of mappers to rank their own sets!"},{"username":"Lami","userId":899031,"isRookie":"FALSE","commenter":"scub","comment":"Lami is definitely no stranger to the anime mapping community, as they've ranked lots of competent maps of cutesy songs, as well as contributing a great amount of guest difficulties to other sets! Despite these maps being simple and straightfoward, Lami's anime maps are always pretty fun to play, and are good additions to the ranked section! Definitely looking for more moe~Kyun☆ maps from Lami in 2019!"},{"username":"Lanturn","userId":1446665,"isRookie":"FALSE","commenter":"Icekalt","comment":"Not only did they join the QAT this year, but they also ranked a total of 3 mapsets as an addition to their existing 24 ranked sets. Normally their mapsets focus mainly on lower difficulties, but in 2018, they ranked their very first expert difficulty on the set \"Aozora Jumping Heart\". Aside from their mapping work, Lanturn is also a major contributor in the metadata team. We really hope to see his contribution for the game remaining for the future!"},{"username":"Lasse","userId":896613,"isRookie":"FALSE","commenter":"uc","comment":"Lasse was a huge standout in the modding community this year, being promoted to QAT early on and being an omnipresent force in the Qualified section ever since. He also pushed out a ton of high quality Japanese music sets and even more GD's and collabs throughout the year. He also has by far the most lit Twitter account among the QAT. We don't know what we'd do without him."},{"username":"Lavender","userId":3850859,"isRookie":"FALSE","commenter":"Mordred","comment":"Lavender might not have been the most active mapper in 2018, but they made up for it by ranking an entire compilation of Shimotsuki Haruka & Suzuyu songs right before the end of the year. I'm not sure how much they'll do in 2019, but let's hope for the best."},{"username":"Len","userId":1686145,"isRookie":"FALSE","commenter":"Mirash","comment":"After being afk from osu! for a long time during their military service, Len reappeared and ranked his \"Ghost Rule\" mapset at long last; becoming ranked was the icing on this mapset's 1000 favorites cake. This Korean mapper will surprise you even more next year for sure!"},{"username":"leo16834","userId":1026904,"isRookie":"FALSE","commenter":"yaspo","comment":"Avid low diff mapper and pokemon fan leo18634 definitely graduated from their rookie status. Seemingly easily multiplying their ranked difficulty count by almost 10, they gained the experience to conquer the ranked section on their own. I'm hoping to see this cute Hydreigon come back with more ranked pokemon songs!"},{"username":"LeQuack","userId":7121588,"isRookie":"TRUE","commenter":"Nao","comment":"Chino in 2018? Really? LeQuack ranked his first map, \"Mirai Puzzle\" by Minase Inori, in September 2018. Unfortunately he seems to have fallen victim to his university workload - but check out his graveyarded maps, which present a mix of intense streams on artcore songs and anime jump maps. Hopefully we'll see more from him when the school year ends!"},{"username":"Lian2002","userId":9048124,"isRookie":"TRUE","commenter":"Nao","comment":"Lian2002's first ranked map, \"LINE\" by SUKIMASWITCH, is an iconic Naruto opening sure to incite wistful feelngs of nostalgia and thoughts of a simpler time. His other maps are from similar shounen animes - JoJo, Boruto, Assassination Classroom, and Dragonball Super. He mostly maps lower difficulties, so if playing jumpy extra difficulties isn't your strong suit, you'll want to check out Lian2002's maps."},{"username":"Lily Bread","userId":5384962,"isRookie":"FALSE","commenter":"scub","comment":"While not being particularly active, Lily Bread has brought some solid additions of their favorite songs to the ranked section, those being two nice songs originating from different anime series. Being competent at making lowdiffs, we can only expect, well, competently low made diffs that are relaxing to play! Overall, we would definitely enjoy more stuff from Lily Bread, should they keep it up in the coming year."},{"username":"Lilyanna","userId":8144098,"isRookie":"FALSE","commenter":"scub","comment":"Literally no one is more known for mapping K-pop songs more than she is. Lilyanna has accelerated the growth of K-pop songs in the ranked section, and her burning passion for such a niche genre doesn't seem likely to stop soon. She's continuously whipped out maps one by one towards the end of 2018, finishing the year with the absolute finisher pose of a map that is her rendition of K/DA's POP/STARS! She's made great impact towards the K-pop scene in the ranked section, and we appreciate all the effort she's brought into popularizing this genre!"},{"username":"Linada","userId":5239047,"isRookie":"FALSE","commenter":"Mordred","comment":"Linada might mostly be known as a GD mapper, but that shouldn't distract you from their own sets, as they are definitely worth checking out! It is rare to see good cs7 maps, and even rarer for them to be on 5 minute long maps. However, Linada managed to create a surprisingly well done map for \"My Truth~Rondo Capriccioso\", making an interesting map for something you'd usually see mapped as a normal diff. Aside from that they also ranked a short Pokémon set as well as ranking a set of Shikata Akiko's amazing \"Akatsuki\". Again, despite the song being rather slow, the map is sure to challenge you, so be sure to give it a try should you seek a challenging map of a great song!"},{"username":"lit120","userId":3109248,"isRookie":"FALSE","commenter":"scub","comment":"lit120 has made a lot of additions to the ranked section this year with his clean yet challenging mapping style! If you are looking for a fun challenge to your aim hand, then his maps are for you, as lit120 maps feature lots of difficult jumps while still keeping his good mapping style on various J-pop/anime songs. With more maps to come, he is certainly a mapper to look out for in 2019!"},{"username":"LMT","userId":7262798,"isRookie":"FALSE","commenter":"Icekalt","comment":"For everyone who really likes rock and metal songs but has never heard of LMT, you are really missing out on a lot of great mapsets. He ranked a total of five sets in 2018, and every single one of them provides a unique and special gameplay experience, not just for high rank players but also for those who are less able to play hard maps. Aside from his mapping career, he also received the BN status later in the year. Really excited to see more from this talented individual!"},{"username":"Lobelia","userId":4030114,"isRookie":"FALSE","commenter":"scub","comment":"Lobelia is pretty unknown and underground as a mapper, but despite that, they're not a new mapper at all! In fact, Lobelia has worked with a couple of mappers since 2015 to popularize male vocal maps within the osu! community. Mostly known for their collaborative works with Regraz, Lobelia's brought in lots of clean and fun maps of male vocal songs, even in 2018. If you're absolutely starving for more male vocal maps, Lobelia will satisfy your hunger for them!"},{"username":"Log Off Now","userId":4378277,"isRookie":"FALSE","commenter":"scub","comment":"Log Off Now has definitely made a name for himself in the mapping community for bringing lots of visual novel openings into the ranked beatmaps section in 2018. With his clean and enjoyable style, he's managed to make great additions to the ranked section with maps such as Pleasure Garden and Girls' Carnival! Aside from that, he's also made lots of contributions in the form of normal difficulties for other sets as well, so if you're a person who enjoys well-done normal diffs of anime songs sometimes, Log Off Now is the mapper you're looking for. Needless to say, we can't wait for the guy to make more great visual novel maps in 2019!"},{"username":"Logic Agent","userId":6341262,"isRookie":"FALSE","commenter":"Hobbes2","comment":"Logic Agent, while not having his most active year in 2018, still managed to rank two highly popular mapsets, including one of Los! Los! Los!, a 7 star anime mapset that shows off Logic Agent's ability to create something that is enjoyable for the player. Aside from this, he also helped a couple mapsets by making quality Guest Difficulties. While his activity has declined in recent times, the return of Logic Agent should be something everyone can look out for."},{"username":"Loneight","userId":663131,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Returning from a hiatus of sorts, Loneight returns to the ranked section with \"Happy Halloween\", showing off his mastery of SV usage. Most of his maps cater towards people who just want to enjoy a quality map to a cute song, but the care he shows in his spacing/sv and movement really set him apart from most mappers with the same goal. 2019 will be a much better year if he's around, for sure."},{"username":"Lulu-","userId":4201715,"isRookie":"TRUE","commenter":"Icekalt","comment":"In early 2018, Lulu- ranked his first and only ranked map, his rendition of Nekomata Master's \"Greening\", which provides a very clean and chill gameplay experience. Aside from him being a Nekomata Master fanboy, he's also trying to change his mapping to a more technical style."},{"username":"Lumael","userId":5400261,"isRookie":"FALSE","commenter":"yaspo","comment":"Lumael is one of those mappers that stays extremely consistent over the years. Every single one of their maps is tidy and comfortable for the lower skill brackets to play. Though, this year they stood out with change in style on their Christmas map for nekodex' \"aureole\". Whether they keep experimenting or not, it'll be nice to see Lumael return this year."},{"username":"luxoDeh","userId":1385760,"isRookie":"FALSE","commenter":"yaspo","comment":"luxoDeh, an Italian mapper who is undoubtedly recognized due to his many years of presence in the mapping scene. This year they briefly pop in with their set for Moseek's \"Elliot\", a fun rhythmical challenge for everyone who wants to enjoy this song to the fullest. Even though luxo's mapping status is set to inactive, we'll be happy to find ourselves dazed if they rank more songs in the future!"},{"username":"Minorsonek","userId":5377178,"isRookie":"TRUE","commenter":"scub","comment":"Minorsonek changed their name to \"M2Usonek\" for much of 2018, so I think it's rather obvious which artist they admire. Towards the end of the year, they ranked a couple of mapsets featuring M2U songs, such as \"Velocity\" and \"Moon Halo\". These contributions are always appreciated in the ranked section, and we look forward to seeing more maps from them in 2019."},{"username":"Maffe","userId":4773855,"isRookie":"TRUE","commenter":"Halfslashed","comment":"Unremarkable at a glance, Maffe's clean style does a good job of incorporating particularly fitting ways to express the song. If he keeps this up, he could likely be a very popular mapper among both players and mappers; would be cool to see more from him in 2019!"},{"username":"Makeli","userId":3411824,"isRookie":"FALSE","commenter":"scub","comment":"Known in the metal mapping community as the \"Diet Mazzerin\", Makeli, or more known from his old nickname, Maakkeli, has been notorious for making outlandish and technically demanding difficult maps of some of the most rhythmically complex metal songs. This year is no different, of course! With the ranking of \"War Squids\" and \"Where Owls Know My Name\", you're dang right that he's still doing what he is infamous for. Will 2019 finally hold the king down, or will he rise to become one of the best metal mappers? We may never know!"},{"username":"makisokk","userId":3141886,"isRookie":"TRUE","commenter":"yaspo","comment":"Only few would dare to start off their mapping carreer on a hardstyle track, but this newcomer shows no fear. Makisokk shares his Russian nationality with the community on the iconic banger \"Wodka\". Aside from that he eagerly helped out his mapper friends with low diff GDs. Makisokk won't be holding back in 2019 either: he already has another hardstyle set coming our way!"},{"username":"mancuso_JM_","userId":521568,"isRookie":"FALSE","commenter":"yaspo","comment":"Despite their account being on a road to 10 years old, mancuso_JM_ is still present in today's ranking scene! Last year they ranked Owl City's \"Kiss Me Babe, It's Christmas Time\" .. in early March. Even though their timing is a little off, I'm really curious to find out when we get mancuso's Christmas present this year!"},{"username":"Mao","userId":2204515,"isRookie":"FALSE","commenter":"Icekalt","comment":"Not only did Mao become the QAT lead this year but he's also ranked a massive amount of 12 maps. Even though he has over 5 years of mapping experience, he is still unable to make proper waves and master basic aesthetics. Let's hope for improvement in 2019!"},{"username":"marcuddles","userId":6509223,"isRookie":"TRUE","commenter":"Nao","comment":"Formerly known as Marcuddles, marcuddles ranked his first set (TRUE's \"DREAM SOLISTER\") in March 2018. He also ranked two Insane GDs. Take a look at his maps if you enjoy a solid selection of popular female vocalists of all pop genres."},{"username":"MaridiuS","userId":4496961,"isRookie":"TRUE","commenter":"yaspo","comment":"When searching his name on the beatmap listing, you'd never realize that Maridius only started ranking maps last year. Kickstarting his career with a banger on \"Lost Emotion\" energized him enough to produce a steady stream of ranked maps and GDs. Even though these maps contain a clear love for jumps, some notable entries like \"K8107\" or GDs on \"Jue\" and \"Myosotis\" show he can handle a variety of complex styles and genres. Mapping this much -and- performing excellently as a BN made him a staple in the community, and his recent resignation from the BNG is quite sad in that regard, though we're 100% sure he'll use this time to map more top tier songs to bring to the players. Thanks for your good work, Maridius, and may this wind of chAngE be what you needed!"},{"username":"MashaSG","userId":6480305,"isRookie":"FALSE","commenter":"Mirash","comment":"Idolizing those with triangles in head, MashaSG ranked a bunch of mapsets in 2018; five, to be exact. As was said before, they try their best to create maps that are good looking, yet still playable and enjoyable for the player. Look to see him ranking another DragonForce song in 2019 too."},{"username":"Mazziv","userId":2919725,"isRookie":"FALSE","commenter":"yaspo","comment":"Yes. A mapper of few words, and also of few maps. Ranking his own set and first insane difficulty on Zebrahead's \"All For None And None For All\" means he shouldn't be counted out. With short but intense experience in mapping, there's no doubt players want more of his creations. I'm sure Mazziv has more potential as a mapper; let's hope he shows it off this year!"},{"username":"Mcen314","userId":9641731,"isRookie":"TRUE","commenter":"Nao","comment":"Mcen314 focuses on female j-pop artists like Shimotsuki Haruka and Nanjo Yoshino. He ranked \"Hikari no Hajimari\" by Nanjo Yoshino in August of 2018 and produces mid 5* maps for various artists that pique his interest. If you want a fresh take on some cute j-pop songs, make sure to check out his pending maps and GDs."},{"username":"Meg","userId":1872496,"isRookie":"FALSE","commenter":"Mordred","comment":"This should be a familiar name to most by now. After consistently ranking lots of maps for quite a few years already, Meg continues to do so in 2018, presenting yaseta's \"Bluenation\" and the full opening for the well known anime Blend S, a challenging alternating style map. If you like simple, fun to play maps you should definitely give them a try!"},{"username":"Mentai","userId":8554786,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Fans of future bass and house will love the mapsets Mentai brings to ranked. Improving significantly from only mapping normal difficulties in 2017, Mentai has brought consistently decent insane difficulties on a variety of electronic songs. Although his activity trailed off towards the later half of the year, rumor has it he's brewing up a new mapping style, so keep an eye out for that!"},{"username":"Milan-","userId":1052994,"isRookie":"FALSE","commenter":"scub","comment":"You might know Milan- from some of his high-star maps of fast Japanese rock songs, or from his contributions in the Mappers' Guild ... or from his renditions of obscure western music ... or ... you know him from a lot of places, that's for sure, and that's all because Milan- is one of those mappers without a real style! Milan-, bringing his versatility along with him, has brought some great additions to the ranked section this year, too. So with everything said, this mapper is bound to have made at least one map you enjoy, no matter what you choose to play!"},{"username":"mindmaster107","userId":8819496,"isRookie":"TRUE","commenter":"Nao","comment":"mindmaster107 uploaded his first few maps near the end of 2016. However, he held off on ranking a set till September 2018, when he ranked a Bill Wurtz song. He also has a few ranked GDs, including the top diff of \"Greetings\" and several other insane diffs around the 4.3* mark."},{"username":"Mitsuna-","userId":3821842,"isRookie":"TRUE","commenter":"scub","comment":"Mitsuna- is a new mapper with a mission to bring more idol songs to the ranked section, and so far this mission is going pretty well! Starting it with a big set of a Love Live! song, Mitsuna- definitely has a great future ahead of him as a mapper!"},{"username":"MkGuh","userId":5139042,"isRookie":"FALSE","commenter":"scub","comment":"MkGuh has certainly taken a much different mindset compared to mappers of today. Mapping almost exclusively western songs and taking a more conservative and old style inspired by Andrea and Gero while still complying with modern standards, MkGuh is definitely a unique mapper you shouldn't pass by in 2018! He's ranked a couple of maps this year, so if you ever feel like playing something simple but different from the norm, this guy's maps will definitely fulfill that thirst for you!"},{"username":"Moa","userId":2193723,"isRookie":"FALSE","commenter":"yaspo","comment":"Not to be confused with Mao, Moa picks up the ranking journey they started back in 2016 once again. They do so with their own groovy Nanahira mapset and the much calmer \"Naeirui Neoegero\". I wonder what they'll have in the mix for us in 2019, but there's no doubt Moa can keep pushing the mapping they True Truly Love with their friend Riana."},{"username":"Modem","userId":3962668,"isRookie":"FALSE","commenter":"Mordred","comment":"Modem is one of the very few people who keep making skins for every set they rank, coming up with new ideas every single time. They also like to include seemingly unrelated videos in their maps, but as unrelated as they may be, they always fit the map really well. That being said, Modem ranked a bunch of these sets, and you should definitely check them out!"},{"username":"Mohab500","userId":10520912,"isRookie":"TRUE","commenter":"Nao","comment":"Rank Escape! Mohab began mapping in early 2018, exploring several genres like rap, DnB and anime. He then pushed towards ranked status with \"escape\" by XX:me, steadily gaining notoriety in a similar fashion to Owntrolf. Upon finally ranking it after 6 months of hard work, he retired from mapping, but has recently returned to lead Team Egypt in the Mapping World Championship."},{"username":"MokouSmoke","userId":2601947,"isRookie":"FALSE","commenter":"uc","comment":"After a 2 year hiatus, MokouSmoke came back to the ranked section with their second FELT mapset, as well as a Normal difficulty on another FELT mapset. Their dedication to ranking the best music in the game is very appreciated, and we hope to continue to see them push these types of sets in the future."},{"username":"Momochikun","userId":2032824,"isRookie":"FALSE","commenter":"yaspo","comment":"Pyon! Gochiusa fan Momochikun jumps into the ranked section again this year. Even though they mostly appear on guest difficulties, their adorable set of \"Sekai ga Cafe ni Nacchatta!\" was enough to increase their following by a tenfold. Does osu need more Gochiusa in 2019? Momochikun will definitely be the first to answer that through their mapping!"},{"username":"Monarch","userId":4689083,"isRookie":"FALSE","commenter":"Mordred","comment":"Not many mappers have the motivation to completely remap their sets to rank them. However, Monarch didn't do this just once, but multiple times! After over 2 years of doing so the map finally reached the qualified section for the first time, where the one and only Azer saw it and decided to improve its hitsounding in order to make the map as enjoyable as possible."},{"username":"Monstrata","userId":2706438,"isRookie":"FALSE","commenter":"uc","comment":"A mapper that needs no introduction, Monstrata is one of the most well-known and respected of modern mappers. He continued to step out of his comfort zone this year by focusing on pushing some very polished alternator style beatmaps. He also killed mapping commissions, so it's safe to say he still remains as one of the most influential community members of our time."},{"username":"moonlightleaf","userId":1074648,"isRookie":"FALSE","commenter":"uc","comment":"moonlightleaf has been ranking clean maps for years, and in 2018 they continued their consistent output by ranking a new version of their first ranked song, \"Halozy - Secret Sister Complex\" in an attempt to show off the song with everything they've learned over the years. It's always cool to see mappers return to songs to give them their more modern approach, and we hope to see moonlightleaf continue to rank polished sets in 2019."},{"username":"moph","userId":2233878,"isRookie":"FALSE","commenter":"scub","comment":"This dude just wouldn't stop bringing us exciting and fun maps of obscure songs throughout the year! Although he is mostly known for bringing fun alternator maps of ethnic-folk songs, he's tried to branch out to more artists, seemingly as a form of exploration, and I think it worked well! All that being said, we can't wait for him to bring more fun maps throughout 2019 just as he always does!"},{"username":"Mortem","userId":2959862,"isRookie":"FALSE","commenter":"yaspo","comment":"In an age where maps are getting faster and harder, more flashy and spectacular, Mortem comes back from 2015 to remind us that sometimes simple is best. With his rather unique song choice, Mortem doesn't fail at providing players with a relaxing or even emotional experience as they get sucked into the game. It's a take on mapping that often falls outside of the spotlights, but definitely one that players will want more of in the coming years."},{"username":"MrKosiej","userId":7024544,"isRookie":"TRUE","commenter":"Nao","comment":"MrKosiej, founder of the Black Vultures, focused heavily on metal songs by groups like Whispered and ICDD. He ranked a map of Whispered's \"Upon My Honor\" and has a Loved map of \"Tsukiakari\" as well. His maps focus heavily on stream designs mixed with clean jump patterns and slider arrangements. Unfortunately, he seems to be taking a break, but make sure to check out his uploaded maps if you enjoy intense metal mapping."},{"username":"MrSergio","userId":2581696,"isRookie":"FALSE","commenter":"Halfslashed","comment":"After disappearing towards the later half of 2017, MrSergio made a comeback this year to his former roles of BNG and GMT. Mapping wise he wasn't very active this year, only completing the spread for one of his 2017 sets, but if you're a fan of highly structured mapsets, he's worth checking out."},{"username":"Murasaki Nova","userId":7030443,"isRookie":"TRUE","commenter":"Nao","comment":"Murasaki Nova ranked their first map in May 2018. It features rigid structures and engaging jump patterns not commonly seen in most modern maps. They only seem to have three other uploaded maps: a WALKUERE song, a ZUN song and a t+paz song."},{"username":"Muya","userId":153323,"isRookie":"FALSE","commenter":"Halfslashed","comment":"After a two year hiatus, 2018 sees the return of Muya with their set of \"JOINT STRUGGLE\" and many other sets. Their style definitely emphasizes the clicking based aspects of osu! as their maps feature complex rhythms, long streams, and simple yet fitting cursor movement -- a perfect way to complement their rhythm game based song selections. Hopefully we'll see more from this mapper in the coming years!"},{"username":"my angel yayoi","userId":3878832,"isRookie":"TRUE","commenter":"yaspo","comment":"Previously known as \"Nika Mika\", my angel yayoi took a spot on the ranked stage this year. While their map of \"Citrus\" is a ton of fun, they especially impress with \"Sanshi Suimei\". This map is full of tricky reading patterns that even the best of players trip up on. Let's hope they complete their resurrection spell succesfully, it's too soon for this budding mapper to die!"},{"username":"Myxomatosis","userId":2202645,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Previously known as Desperate-kun, Myxomatosis took his name change as a chance to change his approach to osu! as a whole. Throughout the years, he's been mainly known for his work as a QAT, making a few simple maps here and there, primarily on lower difficulties. This year though, we saw him return to modding work as a BN and rank a lot more higher difficulty sets on bizarre songs. If you're looking for quality spreads from top to bottom and want to see what kinds of crazy songs are out there, Myxo's a mapper you've gotta keep an eye on."},{"username":"Naitoshi","userId":2730086,"isRookie":"FALSE","commenter":"uc","comment":"Naitoshi is a well-known storyboarder and a mapper with a very passionate following. They ranked a single mapset this year, \"Aa... Hisui Chazuke... - Stardust Prism\", where they tried something very different from their previous mapsets, and ended up with a map that's still yet to be full combo'd. While it appears they have since left osu! behind, their contributions to the game so far will always be remembered, and they would be welcomed back with open arms if they ever show up again."},{"username":"Naitsirk","userId":8202998,"isRookie":"FALSE","commenter":"scub","comment":"Despite only recently starting off his career in the ranked section, Naitsirk, previously known as Icebolt, has definitely developed great knowledge into making visually clean and compelling maps! In 2018, he ranked a couple of great DnB maps, but his knowledge goes much further with the various genres he's mapped in the graveyarded section in the same year!"},{"username":"Nao Tomori","userId":5364763,"isRookie":"FALSE","commenter":"uc","comment":"Coming out of last year, where they near-singlehandedly carried the Qualified section during the tiers era, Nao Tomori continued to make a huge impact on the ranked section in 2018, not just with their own maps, but also with their insane work ethic as a BN. Pushing out the second-most ranked sets of the year, they were a near-endless presence in the Ranked section. Featuring a huge variety of music, mapping styles, and even gamemodes, Nao's efforts are some of the highest osu's seen. The day he decides to step down from the BNG will be a very sad one."},{"username":"Narcissu","userId":1826598,"isRookie":"FALSE","commenter":"Mordred","comment":"Narcissu is a name you'll hear praised a lot between mappers, and not without reason. After sadly only ranking 1 map towards the end of 2017, they returned with 2 maps in 2018: DJ NAGAI feat. Ayumi Nomiya's \"Mono Logic\" and Fujita Maiko's \"Hotaru\". Despite the latter only being an Insane difficulty, it captures the feeling of the song incredibly well with both really cute patterns and fitting additive rhythm. Really hoping to see more of Narcissu in 2019!"},{"username":"Nathan","userId":4785223,"isRookie":"FALSE","commenter":"scub","comment":"Nathan absolutely POPS (haha get it) OFF this year, ranking everything the community could have wished for in 2018, starting from his originally-loved rendition of YUC'e's \"Future Candy\", then PSYQUI's \"Hysteric Night Girl\" featuring Such, and finally climaxing it this year with the #1 most voted map of Community Choice 2018, POP/STARS! Seeing how much he completely exploded this year, we're absolutely terrified of what will come next in 2019. also read island."},{"username":"Natsu","userId":1953876,"isRookie":"FALSE","commenter":"scub","comment":"Although more known for his more challenging maps such as Chase Me and Sky of Twilight, Natsu has definitely mapped more great stuff, especially from the K-pop scene! With his usage of consecutive patterns and structured design, Natsu has definitely brought some great additions to the ranked section as well! Aside from that, Natsu is also a beatmap nominator with 4 years of experience bringing maps to the ranked section, but unfortunately he has decided to retire from the group in early 2019. Whatever his endeavors and reasons may be, we appreciate all the efforts he's put into contributing to the mapping and modding community!"},{"username":"Nekomata","userId":3748189,"isRookie":"FALSE","commenter":"scub","comment":"With the evergrowing demand for more K-pop maps, Nekomata joined the scene bringing their favorite stuff to the forefront of the ranked section. Despite not being particularly active, they have whipped out some cute maps over their career as a mapper. This year, they have brought a good solo mapset of a popular K-pop song, and while it's not innovative or special, it did get more people yelling \"osu! needs more k-pop!\", so you know Nekomata is doing something right!"},{"username":"neonat","userId":1561995,"isRookie":"FALSE","commenter":"yaspo","comment":"Neonat definitely isn't a new face in the mapping community anymore, keeping up their presence in 2018 as well. Despite the supply of their maps being limited, the constantly intense mapping on Nightwish' \"Storytime\" definitely meets the players' demand. Neonat also kept up with their work as a BNG member, earning themselves a badge for a whopping 3 years of contribution. We're happy to see them keep up their splendid mapping and modding, and hope they'll keep on going in 2019!"},{"username":"NeonLights","userId":5277199,"isRookie":"TRUE","commenter":"yaspo","comment":"With friends providing GDs, tournament organizer NeonLights placed their first mark in the mapping scene. Their rendition of ClariS' \"PRIMALove\" is definite proof that maps don't need high bpm to feel super upbeat! Neon isn't done just yet, as they already added another highlight to the ranked section in 2019. Hoping there's more to come!"},{"username":"Neta","userId":832084,"isRookie":"FALSE","commenter":"yaspo","comment":"Neta briefly peeks into the ranked section in 2018, ranking their cute old set for \"Glossy:MMM\". Even though they haven't showed any other activity mapping wise, we wish them luck in their tournament endeavours!"},{"username":"NEVlR","userId":8339126,"isRookie":"TRUE","commenter":"Nao","comment":"NEVlR began mapping in 2017, but ranked his first set in late 2018. He then created a tribute to Komore in \"Best of My Love\" while beginning to mod actively in order to join the Beatmap Nominators. He prefers female vocals, and most of his uploaded maps are of the anime genre. Be sure to check out his maps if you enjoy maps between 5* and 6* which focus on interesting jump patterns set to cute anime songs."},{"username":"newton-","userId":5875419,"isRookie":"FALSE","commenter":"yaspo","comment":"Another great year for newton- to show off their self-proclaimed equidistant mapping style. Even though in the past this often led to tightly controlled hexgrid arranges, recently newton has started to show different approaches to this idea. Most notable is their \"Kaze no Uta\", combining varied slidershapes and blankets to add a whole new layer to their mapping. Witnessing new iterations of newton's style will make the upcoming year very exciting!"},{"username":"nextplay","userId":7501935,"isRookie":"FALSE","commenter":"yaspo","comment":"Another solid showing from Nextplay this year. Even though they mostly reside in the bottom of mapsets with their easy and normal GDs, they're not a mapper to miss out on. With Nextplay's steady growth in the everchanging game of mapping, we can only wonder what their next play is."},{"username":"Nhawak","userId":1572385,"isRookie":"FALSE","commenter":"yaspo","comment":"Nhawak went for another banger this year, ranking a stacked set of Ocelot's \"Yukari\". Their map fits the song on a conceptual level, representing the mix of genres with a mix of gameplay elements for players to test their skill on. Even though they aren't very active recently, we're sure they'll be successful at Whatever they Do."},{"username":"Nikakis","userId":4351739,"isRookie":"TRUE","commenter":"lcfc","comment":"Nikakis, even as a newbie, managed to make the most out of 2018 by being an active modder as well as getting his name on over 20 mapsets ranked this year, either as guest difficulties or sets he hosted, which is quite a feat for someone's first year in the ranked section. It seems that he won't be stopping either in 2019, thus one can look forward to more cool sets and difficulties he'll be making."},{"username":"Nines","userId":2696453,"isRookie":"TRUE","commenter":"yaspo","comment":"Nines is looking to make an impact, taking a Full Dive into the ranked section with Psyqui's \"Hype feat. Such\". Matching this rollercoaster of a song with its mapping equivalent, it's no surprise that even top players are overwhelmed by this ride. For a first ranked map, Nines showed a remarkable know-how of mixing and matching patterns and slidershapes. Keep your eyes open for when he drops his next one, certainly it will be a blast to play!"},{"username":"niruko","userId":7635646,"isRookie":"TRUE","commenter":"Nao","comment":"niruko ranked the first of their two uploaded maps, \"Takane no Hanako-san\" by Kobasolo and Lefty Hand Cream, in April. They also ranked an easy GD, and are currently working on their other uploaded map, a Honeyworks set."},{"username":"Nitrous","userId":7293512,"isRookie":"FALSE","commenter":"yaspo","comment":"Let's start the year right with cute girls doing cute things!\" is a flawless description by Nitrous themselves. This idol lover definitely isn't afraid of sharing his fandom, sneaking in a guest difficulty on any idol related set they set their eyes on. It all comes together in the completion of \"our masterpiece\", a giant collaboration between all leading figures of osu's idol scene. With a new focus on BanG Dream, we're sure Nitrous will keep creating fun memories like these!"},{"username":"Niva","userId":197805,"isRookie":"FALSE","commenter":"Mirash","comment":"An old mapper coming to us from 2010, Niva ranked 5 mapsets this year, all of which were copyright-free, many through the Featured Artist program or the Mapper's Guild. His maps seem simple at first glance or on sightread, but that is just what is needed from them. As soon as you start looking at what's actually going on, you'll be amazed at how thoughtful his maps are. I really like the movements and shapes he uses; pattern-heavy maps like his will always stand out from others. Something that is also worth mentioning is that Niva can map a wide range of BPMs - whether 115 or 210 - while still creating highly playable maps that you will surely be satisfied by. Niva's contributions to osu! do not show any signs of stopping, and it's always a pleasure to work with him, so we will be watching his 2019 closely."},{"username":"NotEnough","userId":7204748,"isRookie":"TRUE","commenter":"Nao","comment":"NotEnough began mapping in June 2017 and ranked his first map in 2018. He mostly maps anime; his ranked maps include Bang Dream and supercell. His other uploaded maps are similar genres: j-rock and j-pop. He's been more and more active lately, so stay on the lookout for more maps from him hitting ranked soon!"},{"username":"Nozhomi","userId":2716981,"isRookie":"FALSE","commenter":"yaspo","comment":"2018 was yet another super productive year for Nozhomi. They added more to their considerable ranked listing with standouts like the virtuously mapped \"Help\" and short yet super fun Saradisk maps. Combined with their continuous activity in the BNG, it's no wonder Nozhomi has become a staple in the French mapping community. We'll be happy to see Nozhomi extend their well-deserved badge for longstanding contribution this year!"},{"username":"Nuvolina","userId":10974170,"isRookie":"TRUE","commenter":"Nao","comment":"Nuvolina began mapping in 2018 and focuses on the EDM and Nightcore genres with a modern take on the traditional symmetry-oriented style. Check out their ranked and pending maps if you enjoy S3rl and similar artists. They've also recently began modding with the intent of joining the BNG, so if you enjoy the same type of songs be sure to keep track of that for all your mod requesting needs."},{"username":"Nyantiaz","userId":6223841,"isRookie":"TRUE","commenter":"Nao","comment":"Nyantiaz focuses mostly on mapping low diffs; his diffs on his 4 ranked sets in 2018 all cap out around the Hard diff level, and most of his GDs are also in the Normal and Easy range. He's recently been branching out into higher difficulties though, so stay on the lookout for more from him."},{"username":"Ohwow","userId":3028729,"isRookie":"FALSE","commenter":"Monstrata","comment":"As his name implies (haha, original joke) Ohwow consistently produces top quality maps, even very early on when he started mapping. As someone who was able to mentor him and watch him develop as a mapper, I am super proud of the high quality work he consistently pumps out."},{"username":"Onlybiscuit","userId":7785535,"isRookie":"TRUE","commenter":"Nao","comment":"Onlybiscuit ranked his first map, \"Korekara\" by Machico, near the end of 2018. He also has several ranked GDs, generally in the mid-high 5* territory. He maps j-pop and has a particular liking for LiSA, having mapped more than 10 of her songs since March 2018. His maps feature high intensity jumps and simple rhythm, so if that's your taste, make sure to check out his maps!"},{"username":"Owens","userId":6239835,"isRookie":"TRUE","commenter":"Nao","comment":"Owens began his ranked career in January 2018 with \"Climber's High\" from Fuuka. He went on to rank several GDs in the 4-5.5* range, as well as another anime set of his own."},{"username":"P A N","userId":1285234,"isRookie":"FALSE","commenter":"scub","comment":"Having been in the mapping community for a long time, P A N has certainly developed advanced knowledge in applying patterns, especially with geometrically placed jumps! In 2018, P A N ranked a map of the instrumental version of TWICE's CHEER UP. Although it's nowhere near innovative or creative by P A N's standards, these maps are always appreciated in the ranked section for being something fun for a lot of players. Definitely looking forward for more in 2019!"},{"username":"Pachiru","userId":2850983,"isRookie":"FALSE","commenter":"yaspo","comment":"Pachiru really is a free birb who flutters around the community. Having been involved in spotlights, mentorship organization, and running the Mapping World Cup and French mapping contests, he really shows that he wants to help out whereever he can. Of course that doesn't hold him back from mapping: 2018 really helped with solidifying \"Pachiru's Normal\" and the artist Marshmello as commonplace terms. I can only wonder where Pachiru's wings will take him this year!"},{"username":"Pandize","userId":5490937,"isRookie":"FALSE","commenter":"Mordred","comment":"A rather new face to the ranked section, Pandize ranked Blaster & Extra Terra - Spacecraft right before going inactive for a year. As you'd expect from a dubstep map, this map challenges both reading and aim with its slider-heavy style. Lets see what else they'll show us in 2019."},{"username":"pappl e 104","userId":2126338,"isRookie":"TRUE","commenter":"Mordred","comment":"A new Chinese mapper, pappl e 104 joined the ranked section with their map of \"fripSide - an evening calm\". Mapped in a really simple style, it allows lots of players to enjoy the map even if they struggle with rather high bpm. Curious to see if they will continue this style in 2019."},{"username":"Pappy","userId":3080783,"isRookie":"FALSE","commenter":"yaspo","comment":"Solitude. Relaxing. Difficulty names that don't necessarily tell the player about the difficulty level but rather about the emotion they convey. With \"Somewhere Far Away\" Pappy offers something that goes a lot deeper than just circles and sliders. An emotional confrontation. There's something special inside here, and we're curious to see what else Pappy will do to enhance this mapping approach."},{"username":"Pata-Mon","userId":6149313,"isRookie":"FALSE","commenter":"Mordred","comment":"As a fellow fan of anime music, Pata-mon continues to do their part in ranking anime songs, albeit only 1 set this year. However, they also did make quite a few guest difficulties for other mappers in order to help them progress to the ranked section."},{"username":"Peter","userId":8623835,"isRookie":"FALSE","commenter":"yaspo","comment":"Even though Peter cut the EU part from their name, nothing was cut from their mapping in the slightest. 2018 really marks their Break Away in the ranked section compared to the humble beginnings in 2017. Peter provides us with a nice collection of lower bpm EDM songs, all accompanied with equally fun maps. It's no wonder players are so positive in the beatmap comments, so we're glad to see that he isn't done yet!"},{"username":"pimp","userId":328615,"isRookie":"FALSE","commenter":"Mordred","comment":"The kudosu police. When he's not denying unjustified kudosu, there is a high chance he's helping people with complex timing! Aside from those endeavors, he also ranked his marathon of 3L's \"Macrophylla Parasol\", one of the few ranked maps that still use tickrate 4 nowadays. He also joined the BNG in early 2018, helping lots of mappers rank their own sets."},{"username":"PinkHeart","userId":1269067,"isRookie":"FALSE","commenter":"uc","comment":"A mapper that needs no introduction, PinkHeart has made a huge impact on the mapping scene, winning multiple awards in previous MCA's and influencing many prolific mappers. In 2018 they took a bit of a break from ranking their own sets, instead making multiple guest difficulties for short anime and eroge songs. They did, however, rank their \"Denkishiki Karen Ongaku Shuudan - Gareki no Yume\" set, a very different song than they normally map. We hope to see their impact continue into 2019."},{"username":"pkhg","userId":343624,"isRookie":"FALSE","commenter":"Mordred","comment":"pkhg was mostly active in 2016 and 2017, but that doesn't mean they did nothing in 2018! While only ranking one set themselves, they helped a bunch of others to rank their sets by making guest difficulties for them, something that will always be appreciated."},{"username":"Present","userId":5645691,"isRookie":"TRUE","commenter":"Nao","comment":"A consummate fan of cute anime girl vocals, Present (formerly known as AngelSnow) ranked two sets in 2018: the opening to Aho Girl and a mimimemeMIMI song. His other uploaded maps feature a litany of cute female vocalists such as ClariS and Sangatsu no Phantasia. He's been mapping quite actively recently, so watch for more of his stuff getting ranked soon!"},{"username":"_handholding","userId":4276114,"isRookie":"FALSE","commenter":"uc","comment":"Better known by his previous username \"Kisses\", _handholding is a mapper who more commonly shows up in sets other than their own with a huge portfolio of GD's. This year they pushed forward 3 ranked sets, with their most recent being a very polished stream map \"Ice vs. Morimori Atsushi - RE:UNION -Duo Blade Against-\", where they stepped well out of their comfort zone of simple anime songs. They also helped push a wide variety of mapsets as a BN throughout the first third of the year. We hope to see them back and active again someday."},{"username":"ProfessionalBox","userId":3250792,"isRookie":"FALSE","commenter":"uc","comment":"One of the biggest household names for fans of EDM maps, ProfessionalBox continued to make a huge impact on the ranked section. They have cemented themselves as a primary influencer on the mapping styles of the genre, with their incredibly popular \"Camellia - Exit This Earth's Atomosphere (Camellia's ''PLANETARY//200STEP'' Remix)\" marathon rocketing through the Qualified section with over 4000 favourites. Their impact on mapping cannot be understated and we hope to see them continue to push boundaries in 2019."},{"username":"Pulse","userId":6341751,"isRookie":"TRUE","commenter":"Nao","comment":"Pulse ranked a collab marathon with several other members of the Brazilian community in March 2018. It features interesting \"alternator style\" mapping on a classic Touhou arrangement. While Pulse hasn't returned to the ranked section since then, he still has a few other maps uploaded, including a Bring Me The Horizon song and an Eminem song."},{"username":"pw384","userId":1343783,"isRookie":"FALSE","commenter":"Mirash","comment":"How long does it take to map a single difficulty? Well, the answer doesn't matter here, as we're talking about a mapper who can create a full spread for a 5 minute long song featuring tons of different patterns and unusual gimmicks completely by himself. He ranked three mapsets in 2018 and has several pending maps as well. pw384 (formerly known as 384059043) dedicates his mapping interest to Western songs exclusively. We'll be watching his amazing perseverance in 2019 as well."},{"username":"defiance","userId":6816873,"isRookie":"FALSE","commenter":"","comment":"Previously known as osuskrub and quanhitter39, defiance has not only advanced in his display of memes, but also in mapping, where he moved on from strictly low difficulty sets to having an insane on his M2U mapset. Fans of cleaner mapping styles will be sure to find something they like among his maps!"},{"username":"RanthFox","userId":7673101,"isRookie":"TRUE","commenter":"Nao","comment":"RanthFox ranked his first map, \"Zetsubo to no Wakare ~Kyozo to no Tatakai~\" by Ohtani Kow, in September 2018. It's a song from Shadow of the Colussus accompanied by an insane diff full of long slider patterns which represent the prominent brass instruments in the song. His other uploaded maps encompass a variety of genres - give them a try yourself; each one has its own unique way of presenting the songs."},{"username":"Realazy","userId":918297,"isRookie":"FALSE","commenter":"StarrStyx","comment":"The Skype x Can Can mapper has increased his amount of ranked maps tenfold this year; if you have played osu at all in the last year, you are bound to have seen his maps hit the ranked section either as a GD or of his own mapsets every now and then. His maps also encompass a wide range of songs; whether it's anime, or electro, Realazy's maps are bound to fit your music tastes."},{"username":"Regou","userId":419954,"isRookie":"FALSE","commenter":"StarrStyx","comment":"What more is there to say about Regou? He is not only a man of clean, structured mapping, but also able to throw in a lot of cool concepts from time to time. Despite most of his maps being quite unorthodox and at times unpleasant to play, there is no denying that his maps are some of the best that we have ever seen. Truly a hell mapper in his own right."},{"username":"Regraz","userId":3076909,"isRookie":"FALSE","commenter":"yaspo","comment":"If you're looking for song variety, Regraz' ranked maps are a perfect fit for you. With sets for various Western pop artists, Chinese vocalists, j-rock and more, you can find anything you'd possibly want. The way these fit the song's intensity just right often leads to low diff sets, though sometimes Regraz takes a real twist and releases an intense 7 star SDVX map. That said, Regraz is so much more than just a mapper. 2018 really was a year for them to showcase their modding profiency to the community by joining the QAT and judging contests like the osu Mapping World Cup. All summarized, Regraz follows up many remarkable years with another one, and we're glad to see that they're still around to help out the community!"},{"username":"Reisen Udongein","userId":232942,"isRookie":"FALSE","commenter":"Halfslashed","comment":"Likely one of the bigger comebacks this year, Reisen Udongein returns to osu! to rank their 2013 set of \"squall\". Having mostly been active between 2011-2013, they sport an older style of map design but also feature compelling gameplay to boot, allowing them to appeal to fans of both modern and older styles. I sure wasn't expecting to see them come back after such a long period of inactivity, but I'm definitely hoping to see more of them in the future!"},{"username":"RepL4y","userId":1974797,"isRookie":"FALSE","commenter":"yaspo","comment":"Even though Repl4y ranked just their second map last year, judging by the map alone doesn't give that impression in the slightest. Their rendition of kamome sano's \"starlights feat. TEA\" really is a great match for the song, covering all its complex rhythms and fluctuating vocals all in one cohesive package. Now that they've shown the skill to map cool full songs, I'm curious about what we'll get to see next!"},{"username":"Riana","userId":1997633,"isRookie":"TRUE","commenter":"yaspo","comment":"Riana had a blast in 2018, a great start for a great rookie. He made a very eager entry to the ranked section with spacing-heavy maps like \"Infinite Sky\" and \"Shine\", a style that players enjoy greatly. Riana knows how to make full usage of jumps, going for more unconventional designs like wide angles and anti-jumps. Even though he only started out last year, the start of 2019 is full of progress for Riana. We hope he'll keep going and continue making the maps they True truly love!"},{"username":"Rieri","userId":5379679,"isRookie":"FALSE","commenter":"yaspo","comment":"While they've moved on from their old name ProEzreal, the Pro part still reflects through Rieri's mapping. With fun jump maps like \"Dear Brave\" and \"Fireworks of shoes\" they have no trouble getting love from players. Judging from their recent activity, they even seem to be venturing into ctb. 2019 will undoubtedly be an interesting year for Rieri!"},{"username":"Rin Desu","userId":2466181,"isRookie":"FALSE","commenter":"Mordred","comment":"As someone who likes English-language rock music, and especially the Red Hot Chili Peppers, Rin Desu made their contribution by ranking 2 RHCP sets. Should these not be enough for you, feel free to check out their pending maps and graveyard for a lot more of those!"},{"username":"Riven","userId":3638005,"isRookie":"FALSE","commenter":"uc","comment":"Despite only ranking 2 sets in 2018, Riven made a surprisingly large impact on the mapping scene, as one of those sets was the first ever R3 Music Box extended mp3. This created a trend of maps that partially led to the complete rework of mapset spread drain time rules that happened later in the year. We hope to see Riven continue to break boundaries in 2019 .. just preferably in map design and not in mp3 design."},{"username":"Rizen","userId":3056732,"isRookie":"FALSE","commenter":"Mordred","comment":"A familiar name to most in the mapping and modding community. After failing to get into the BNG countless times, he finally succeeded in mid 2018, making his long dream come true. Aside from that, he also ranked 2 sets, one 5 min collab and a 4 min spread."},{"username":"Rolniczy","userId":8331132,"isRookie":"TRUE","commenter":"Nao","comment":"Rolniczy began mapping in late 2017. His first ranked map, \"crystallized\" by Camellia, featured intricate 1/4 rhythm. In October, he ranked \"Manten\" by Kalafina, which earned a spot on the seasonal spotlights for its use of extended sliders and non-standard circle patterning. His music taste includes anime, DnB, and electronic songs; his uploaded maps display incredible diversity in both mapping and song style."},{"username":"Rose Pacifica","userId":1393255,"isRookie":"TRUE","commenter":"yaspo","comment":"Players better put on thick gloves before they come near Rose Pacifica's first ranked map if they don't want to hurt themselves on its thorns. With countless complex patterns and spaced 1/4 at 200bpm, Rose's \"put' l'da\" is deceptively difficult for its 6.37 stars. We can only wonder if the world is ready for their potential return this year."},{"username":"Rtyzen","userId":2439822,"isRookie":"FALSE","commenter":"Gottagof4st","comment":"Ranking a map after a 3-year break, Rtyzen still shows he can map really well, taking this normal sounding opening and mapping the chorus in an alternator style which packs a big extra punch when you get to it. Apart from that they sadly haven't done much."},{"username":"rui","userId":74313,"isRookie":"FALSE","commenter":"yaspo","comment":"The lack of rui maps in 2017 was quite worrying, but luckily they made a return in 2018. With a full 4 minute set on \"Justitia of Life,\" they combine old ideas with new ones, reminding us of the fun style they've built up over the years. Having been reminded, we hope rui has enough weekends to spend on mapping another set this year!"},{"username":"Rukaru","userId":1501974,"isRookie":"FALSE","commenter":"yaspo","comment":"Is this rukaru's rebirth? After not ranking anything in 2017, this Neptunia-loving mapper returns with a mapset for their favorite game series' OST! It's a nice mapset full of cute patterns that match the song's rhythm and intensity nicely; rukaru definitely hasn't lost their touch. I'm surely hoping rukaru will continue sharing the things they love with the community!"},{"username":"Rumia-","userId":1787171,"isRookie":"FALSE","commenter":"yaspo","comment":"Rumia- is a mapper who, despite their history in mania mapping, has made a full conversion to standard. They're not afraid of providing players with a similar level of challenge in both modes however. Rumia's maps like \"S.A.T.O.R.A.R.E\" and their GD on \"New World\" are filled with complex and varied patterns that keep players on the tips of their toes. Players appreciate this mapping style as well, granting Rumia 2 loved maps on top of their ranked repertoire. Comparing Rumia's first standard maps to their latest work is a big difference, so they're definitely someone to keep an eye on this year!"},{"username":"RVMathew","userId":3718151,"isRookie":"FALSE","commenter":"yaspo","comment":"RVMathew is a Touhou fan primarily known for hard difficulties that quite often defy generic trends. With good usage of patterning, they really establish a clean relation with the song. Unsurprisingly, these hards easily become a lot of fun with any mod combination you can think of. Their geometric mapping style culminates in \"Summer time Heaven -after\", a well done solo set utilizing ar8 on the highest difficulties. RVMathew's fun mapping style fills a nice niche in the ranked section, so we're glad to see them keep it up this year!"},{"username":"saggi","userId":8027395,"isRookie":"TRUE","commenter":"Nao","comment":"saggi, previously known as DominiGG, ranked a cut version of Dreamcatcher's \"Chase Me\" at the start of 2018. Most of his maps are over 6*, so if you enjoy high intensity mapping on j- or k-rock songs, take a look at his graveyard as well."},{"username":"sahuang","userId":5318910,"isRookie":"FALSE","commenter":"StarrStyx","comment":"This year has seen a slight decline in the amount of maps sahuang has put out, but he has still managed to rank a couple of very decent maps; the most notable one, for example, would be his rendition of Meramipop's Gensou Roman Kikou (is the limit.)"},{"username":"Sakurauchi Riko","userId":5710809,"isRookie":"FALSE","commenter":"yaspo","comment":"Formerly known as Phyloukz, Sakurauchi Riko changed their name to be even closer to their beloved idol. This is also reflected through their mapping, as Riko and Riko make a great combo to convey the feeling of the idol's voice. Especially notable in their maps is great usage of small circles, like on \"Loveless World\" and both versions of \"Pianoforte Monologue\". We hope Sakurauchi Riko can find what they're looking for in 2019, and we pray that love won't be so unforgiving."},{"username":"samosita","userId":6090289,"isRookie":"TRUE","commenter":"uc","comment":"samosita snuck in to the ranked section near the end of the year with their first ranked map, \"FELT - Day after,\" a pleasant marathon map that shows off the song's nice piano melody and vocals. We hope to see this mapper keep up their strong start to the ranked section in the future."},{"username":"samplefish","userId":573722,"isRookie":"FALSE","commenter":"yaspo","comment":"Skipping 2017, samplefish returns to the ranked section with more solid mapsets for players to enjoy. These maps can be heartwarming like the Undertale OST \"An Ending\", or full of bouncy fun on \"winter tale\". Samplefish definitely knows how to bring a song's vibe to the player, so we're hoping that they're not skipping this year!"},{"username":"Sandrew","userId":4142332,"isRookie":"TRUE","commenter":"yaspo","comment":"One map away from being a rookie, Sandrew had a great year to start out his mapping career. It's clear that this mapper has high appreciation for lower difficulties, as even on their own sets, Sandrew keeps their focus on high quality Hards and Normals. It was actually quite surprising to see Sandrew GD a nice top difficulty on \"nonfantasy\". Whether Sandrew branches out to higher star rating in 2019 or not, their name will definitely be worth keeping around!"},{"username":"Satellite","userId":1661227,"isRookie":"FALSE","commenter":"Mirash","comment":"Lord and Kami-sama of Youhei Satellite - better known by their singer's name, senya - Satellite (forgive my repetitiveness) ranked one mapset of a song by, once again, Youhei Satellite, \"Utakata, Ai no Mahoroba.\" Besides that, he took part in some ambitious collaborations that remain hidden ... I hope to see them revealed in 2019!"},{"username":"scanter","userId":1742622,"isRookie":"FALSE","commenter":"uc","comment":"scanter, also known as \"Anais\", made a bit of a splash in the mapping scene back in 2014. They returned to the ranked section this year with their set \"Roselia - LOUDER\", a nice clean set showing everyone they haven't lost their charm. We hope to see them continue ranking more sets in the future, hopefully before 2022."},{"username":"sdafsf","userId":3523418,"isRookie":"FALSE","commenter":"Halfslashed","comment":"More often seen for his GDs than his mapsets, sdafsf is one of those talents that made themselves known last year. This year he ended up hosting a set with entries from Just Another Beatmap Contest #3, as well as making his own set of Racemization, which received praise from fanzhen himself. Skilled at mapping any genre of music well, it'd be nice to see him pop in again during 2019 to show us what else he's got in store."},{"username":"Seni","userId":4830261,"isRookie":"FALSE","commenter":"yaspo","comment":"Seni's name has become synonymous with the artist Foreground Eclipse. With 5 ranked sets all under this same artist, complete with a songs compilation, they're really building up quite the collection. Even so, Seni's work definitely doesn't lack variety. Maps like \"Storytellers\" and \"In A Night When Her Sorrow Resounds Around\" show that they can easily adapt different styles within a similar genre. For 2019 we can only wonder one thing: which will be longer, Seni's mapping career or these extensive song titles?"},{"username":"Serizawa Haruki","userId":6642617,"isRookie":"TRUE","commenter":"Nao","comment":"Serizawa Haruki, formerly known as J a c k, spent most of 2018 mapping Honeyworks and other similarly pleasant j-pop tracks. He enjoys low diffs and joined the BNG after founding the Low Diff Assurance Team, a modding queue focused on low difficulties in all modes. If you like cute girls (or cute guys) singing cute things, be sure to check out his pending and ranked difficulties - he's mapped several male vocalists, like Galileo Galilei and mafumafu, as well as several prominent female j-pop singers."},{"username":"seselis1","userId":7321833,"isRookie":"TRUE","commenter":"Mirash","comment":"By ranking a great set in which he mapped every difficulty by himself, seselis1 impressed with the ability to map so cleanly and consistently. He provided such a good difficulty progression that you could say that if a player was stranded on an uninhabited island, with no chance of escape, and only a PC with osu! installed to keep them company, and only this mapset to play, that player could still have the ability to improve to greatness even starting from zero. Wishing the best of luck in his mapping adventures in 2019!"},{"username":"Seto Kousuke","userId":2857314,"isRookie":"TRUE","commenter":"Gottagof4st","comment":"Certainly not a no-name, Seto achieved a lot in 2018 not only ranking multiple maps but also getting bn in the summer. His positive attitude also makes him a great addition to every team. When talking about his mapping he sticks mostly to anime songs, but occasionally dabbles in the more exclusive songs like Pepsi Man. Here is my message to Seto for 2019 in which I hope to see more of him: \"HAEOHOEAHOEUAHUEOAE\"."},{"username":"Shad0w1and","userId":798668,"isRookie":"FALSE","commenter":"yaspo","comment":"Good artists copy, great artists steal.\" An inspiring quote straight from Shad0w1and's userpage, though one can only wonder just how many aspiring mappers are stealing patterns from their maps these days. Even while closely sticking to Japanese music, Shadow has built up an impressively varied portfolio of mapping styles over the years. It's hardly a surprise that they've become a staple in the Chinese community. Shad0w1and hasn't hit the brakes on ranking maps ever since they started, so we hope they keep pushing forwards their colorful mapping!"},{"username":"Shanipika","userId":6336729,"isRookie":"TRUE","commenter":"Halfslashed","comment":"Few mappers dare to create maps as interesting as Shanipika's. Though he mainly sticks to more popular song genres like anime and vocaloid, his style consistently makes use of obscure yet fitting techniques to represent the songs and does so well enough that I didn't even believe he was a rookie this year. Hope to see more of this mapper in the future!"},{"username":"Sharlo","userId":1622450,"isRookie":"FALSE","commenter":"yaspo","comment":"Despite their rather inactive status \"AFK for all\", Sharlo still briefly peeks in. In 2018, she did so with one ranked map, a collab on \"chrono diver -fragment-\". It's easy to forget the time while playing this map: the way the patterns play and the beautiful storyboard make for a wholesome experience. Even if she doesn't return in 2019, we're sure the community won't forget her voice!"},{"username":"Sharu","userId":5597639,"isRookie":"FALSE","commenter":"scub","comment":"Sharu's main strength is versatility. Looking through his few ranked maps, he seems to have made some really well done J-vocal and anime maps of various genres, but, as I've said, that's not to say he's not good at everything else. Quite the opposite, in fact, as he's also known in the mapping community for making high-quality and visually compelling maps of various maps in the wubs scene. This just goes to show that you shouldn't judge a book by its cover, especially when talking about mappers!"},{"username":"Shiratoi","userId":5728295,"isRookie":"FALSE","commenter":"yaspo","comment":"Continuing what they started last year, Shiratoi established themselves in the scene. Teaming up with Nevo gives them plenty of ranked insane diffs, though their own maps on \"Mirai\" and \"Deep in Abyss\" really are a step ahead. They also deserve praise for their placement in the mentorship traditional contest, granting them the top expert difficulty on \"confusion\". With how much they've grown over the past year, there undoubtedly is a bright future ahead of them!"},{"username":"Shunao","userId":7901324,"isRookie":"FALSE","commenter":"yaspo","comment":"Even though they're formerly known as ShogunMoon, at this point \"Shunao's Hard\" is a trademarked product. While they might seem inseparable from Sotarks' sets, Shunao has plenty of own work that is worth appreciating. Both \"Hibiwareta Sekai\" and \"Panorama Blue\" are excellent examples of their ability to stand their own ground. The amount of work Shunao is putting out is quite a feat, so we'll be excited when their ranked difficulty count finally reaches 100!"},{"username":"Shurelia","userId":3807986,"isRookie":"FALSE","commenter":"scub","comment":"Despite having almost no experience in playing the Standard gamemode at all, Shurelia managed to break through and create very relaxing maps throughout 2018, showing through in his collaborative renditions of \"Chata's Hoshizora no Memoria\" and stellatram's \"EXEC_with.METHOD_METAFALICA/. ~at A.D.3310~\"! That being said, we are thrilled to see and relax to more maps from this guy in the future!"},{"username":"Side","userId":3442339,"isRookie":"FALSE","commenter":"Mordred","comment":"After not ranking anything for 2 years, they return with a set of \"USAO - Showdown\", featuring not one, not two, but three different game modes, giving lots of players an enjoyable set of this song."},{"username":"Sidetail","userId":2036217,"isRookie":"FALSE","commenter":"yaspo","comment":"If you think girls with sidetails are adorable, then the extensive list of them on Sidetail's profile is just the place for you! Aside from the many anime girls, you'll also be able to find their equally charming ranked maps and GDs. There's no way you won't enjoy these, as Sidetail's gentle and simple mapping is a perfect fit for yaniginagi's smooth vocals. Here's hoping to seeing more of their work, or cute girl choice, in 2019!"},{"username":"Sieg","userId":1404615,"isRookie":"FALSE","commenter":"Mordred","comment":"Despite not being very active in 2018, Sieg still managed to rank 3 maps, including EPICA's cover of the second Attack on Titan opening, a finger control challenging low bpm map. They also rejoined the Beatmap Nominators for a few months, helping others rank their own maps."},{"username":"Sing","userId":3795679,"isRookie":"FALSE","commenter":"StarrStyx","comment":"It'd be best to describe Sing in two styles. One would be his RLC-like style, which draws heavy inspiration in the form of cleanly structured patterns and shapes; the other would be around the fast-slider mapping meta, which involves quite distinctive slider velocity changes frequently throughout a map. Regardless of the style he chooses to go for, there should be no shortage of maps to cater to your tastes, whether it be the cursor flying around the screen or if you just fancy some nice looking patterns while playing."},{"username":"Skidooskei","userId":10079029,"isRookie":"TRUE","commenter":"Nao","comment":"Skidooskei started mapping in early 2017 and ranked his first map in late 2018, a marathon of a song by electronic artist mrsimon. His mapping style is oriented around interlocking slider patterns and blankets with moderate visual spacing rather than having massive jumps between everything. We hope to see more unique progression and development in the future!"},{"username":"smallboat","userId":243049,"isRookie":"FALSE","commenter":"Mirash","comment":"A big name in the osu!community who was a long-serving beatmap nominator and mapper, smallboat went to his rest in 2018 as he resigned from the BNG and only ranked one mapset (though not an uninteresting one) of a song called \"Yoshifumi Ushima - FLYING IN THE SKY.\" Wish to see him ranking another map in 2019."},{"username":"SMOKELIND","userId":9327302,"isRookie":"TRUE","commenter":"Nao","comment":"SMOKELIND, perhaps dubiously known for arousing suspicions of being a Sotarks multiaccount, gained popularity throughout the year while ranking several anime GDs as well as a few sets of his own. He has a passion for Japanese rock, mapping My First Story and Oral Cigarettes extensively. We hope to see more from him in the coming years - hopefully without the 1-2s."},{"username":"Smokeman","userId":2140676,"isRookie":"FALSE","commenter":"yaspo","comment":"Even though he's informally known as (the) WOKEMAN, Smokeman might seem like just another low diff mapper at a first glance. No less is true, as he manages to provide deep and daring map designs to the lower brackets of players. Opting for the largely unexplored orchestral genre with songs like \"Kyoumen no Nami\" and \"Shinsha\", Smokeman really leaves an emotional impact for everyone to enjoy. I'm excited to see what other adventurous slidershapes he can come up with during 2019."},{"username":"Smug Nanachi","userId":10063190,"isRookie":"TRUE","commenter":"lcfc","comment":"Smug Nanachi ranked his first two maps this year, with the most notable one being a cut of Feryquitous' Central Nucleus, featuring interestingly designed difficulties that cater to many types of players."},{"username":"SnowNiNo_","userId":2506267,"isRookie":"FALSE","commenter":"scub","comment":"SnowNiNo_ has really made a name for themselves in 2018 with the ranking of maps like Sidetracked Day and Shukusai no Elementalia. With a good understanding of visual composition derived from mappers such as Monstrata and Nathan, they are able to bring Insane additions to the ranked maps listing, and we hope to see more from them in 2019!"},{"username":"sodarose","userId":986714,"isRookie":"FALSE","commenter":"Mordred","comment":"sodarose sadly was not very active this year, however they still managed to rank a full size spread with all diffs made by themselves, something I will always consider impressive."},{"username":"Sonnyc","userId":11771,"isRookie":"FALSE","commenter":"Mirash","comment":"A modder and mapper who was sent to us from the heavens, Sonnyc took part in the BNG for almost the whole year while mapping and ranking 8 mapsets in total, including several as part of the Mappers' Guild. His style has been developing to utilize modern fast sliders - shown in his mapset of Cranky's \"Rave 2 Rave\" - but he also occasionally maps \"gimmicky\" mapsets, for example his map of \"Los! Los! Los!\" where he used zero sliders. Let's hope his contribution to the game keeps being present in 2019 as well."},{"username":"Amiya","userId":7601720,"isRookie":"TRUE","commenter":"Nao","comment":"Formerly known as Sparhten, Amiya uploaded his first map in 2018 and improved quickly under the direction of Kibbleru, ranking his first map \"Jitter Doll\" by the end of the year while focusing on modding with the aim of joining the Beatmap Nominators. He maps mostly female vocals, focusing on Reol and LiSA songs with the occasional anime map thrown in. Check out his maps if you enjoy a mix between intense jump mapping, streams, and extended slider designs. We look forward to seeing great things from him in the future!"},{"username":"SquareTude","userId":6280862,"isRookie":"TRUE","commenter":"yaspo","comment":"They say \"be there or be square\", but Squaretude is a notable exception to the rule. As a rookie they quite literally dabbed their way into the ranked section, getting their first ranked map \"More One Night\" into top played. For All I Know, that was enough to keep Squaretude Glued to the ranked section. They really Rise to the occasion by adding another 5 ranked sets to the listing. Whatever he does, Squaretude has carved his name into the game, and he definitely won't be forgotten anytime soon with his most recent and upcoming works!"},{"username":"squishi","userId":8171954,"isRookie":"TRUE","commenter":"Nao","comment":"squishi ranked \"Mimikyu no Uta\" by YUPPA at the start of 2018, an upbeat Pokemon song. He doesn't seem to map too much anymore, but make sure to check out his other uploaded maps, which are set to a mix of Pokemon and j-pop related songs."},{"username":"SrSkyPlayer","userId":3860376,"isRookie":"FALSE","commenter":"yaspo","comment":"Even though they weren't very active in 2017, SrSkyPlayer definitely showed their presence last year. Both sets and GDs they ranked are a testament of their ability to map clean and engaging insane diffs. Especially notable is their GD on \"Kaen\", proving that SrSkyPlayer can make any type of pattern work smoothly. Can't wait to see more of this Senhor in 2019!"},{"username":"Starfy","userId":2045914,"isRookie":"FALSE","commenter":"StarrStyx","comment":"Starfy, despite not being an exceptionally popular name, is still fairly well known within the mapping community for his very nicely executed mapping concepts in maps such as Little Little Wish and Six Trillion Years. Although this year he only ranked a version of X-encounter, he is still semi active in mapping, and we look forward to what this hell mapper will bring us in the following year."},{"username":"StarrStyx","userId":4600383,"isRookie":"FALSE","commenter":"lcfc","comment":"Even though StarrStyx's activity has dropped since, say, 2016 (having made the mapsets he's mostly known for, such as Paradisus-Paradoxum as well as the trio of seal songs), he still has made meaningful contributions to making the ranked section a better place, mapping many different genres. Whether you have liked or disliked his maps previously, his new ones are undoubtedly worth a look for they show his improvement throughout the years!"},{"username":"Stjpa","userId":2954693,"isRookie":"FALSE","commenter":"Mordred","comment":"Despite having more or less quit mapping, Stjpa still ranked a set of Cream puff's \"Mermaid girl\" in early 2018. While he was aiming to get back into the BNG after leaving it in early 2017, it appears he lost motivation to do so. Lets hope he regains some of that in 2019!"},{"username":"Sulfur","userId":5297447,"isRookie":"FALSE","commenter":"scub","comment":"An avid follower of the \"pathing\" style developed by big mappers like kiddly and Kloyd, Sulfur's maps feature powerful rhythms and placements you can ever get bored of playing. Go play some of his recent maps like \"Une mage blanche\" and \"FAFNIR\" and you'll see what I'm talking about!"},{"username":"Sure","userId":70730,"isRookie":"FALSE","commenter":"Sulfur","comment":"After roughly one year of a break from mapping, Sure ranked Believe -- their 55th ranked set, done in an old fashion with a clean, based around symmetry mapping style. Let's hope their contribution to the game keeps being present in 2019 as well."},{"username":"Otosaka-Yu","userId":3170678,"isRookie":"FALSE","commenter":"StarrStyx","comment":"Better known as Suzuki_1112, Otosaka-Yu has made quite the name for himself not just within the mapping community, but also among some players ever since he won Pending Cup 2017. His maps not only contain very well executed and sometimes quite well thought out ideas, but also feel very fun and intuitive to play. His choice of electro songs while mapping will be a delight for those who like electro music as well."},{"username":"Syph","userId":4858573,"isRookie":"FALSE","commenter":"yaspo","comment":"Syph had another great year in the ranked section with maps that can be both unsurprisingly or surprisingly difficult. The high bpm aim challenge \"Sky of the Ocean\" and the creeping build-up in \"Marigold\" are prime examples of this. 2019 shows no signs of pausing for Syph, though with their maps' difficulty we aren't sure if we are ... Ready For It?"},{"username":"SyraxAxoJaxco","userId":4119110,"isRookie":"FALSE","commenter":"yaspo","comment":"Another pleasant year for the digidestined SyraxAxoJaxco. With a second ranked map on the Digimon Universe OP \"DIVE\", their love for lower difficulties only becomes more apparent. It's only a small thing, but many small things can make something great! We're hoping to see SyraxAxoJaxco continue just that this year."},{"username":"Tatan","userId":5646529,"isRookie":"TRUE","commenter":"Nao","comment":"Tatan maps various genres of pop music - k-pop, j-pop, and even reggaeton. His uploaded maps show a unique blend of Love Live, Post Malone, and several other rarely mapped styles of music. Be sure to keep up with his mapping if you enjoy pop genres that are rarely mapped in osu!"},{"username":"TheKingHenry","userId":5128277,"isRookie":"TRUE","commenter":"yaspo","comment":"TheKingHenry is a rather surprising name on this year's rookie listing. Where most upcoming mappers get told to start off with something that isn't 8 minutes of high bpm deathstreams, this metal fan went the complete opposite direction. He pushed out an insane total 45 minutes drain time across only 6 ranked maps, topped off by \"Libera\" which is over 12 minutes long. Players who wanted more maps in this niche couldn't have asked for more. That's not even mentioning that he also got into the BNG in January. Undoubtedly this is an incredible start for a mapper, so let's see if TheKingHenry can keep it up!"},{"username":"Sylas","userId":3906405,"isRookie":"FALSE","commenter":"yaspo","comment":"More recognizable as TheKoala. Sylas is a fellow Belgian mapper I 100% support. Even though there wasn't really any need for another version of \"Granat\", they made up for it by ranking one of Camellia's new bangers: \"Quaoar\". This map has literally everything you'd expect for a song like this, from exotic slidershapes to tricky stream patterns. An intense map paired with an insane difficulty that does a solid job at introducing it, TheKoala shows what he's made of to both mappers and players. Hoping to see them keep up the great work this year!"},{"username":"TheNexus","userId":6420489,"isRookie":"TRUE","commenter":"Nao","comment":"TheNexus ranked their first set, a marathon map of \"The Undertaker's Daughter\" by steampianist, in November 2018. Their other maps feature various EDM artists like Aero Chord, Noisestorm and Panda Eyes. They don't seem to be very active recently, but take a look at their graveyard for a litany of other Insane and Extra difficulty maps."},{"username":"thiev","userId":1028922,"isRookie":"TRUE","commenter":"yaspo","comment":"2018 is an exciting year for thiev, as he adds another entry to Hype feat. Such listing for players to enjoy. Being new to the ranked scene, this map shows that he's plenty capable of bundling a bunch of interesting patterns into one fun package. With their super groovy start of 2019, thiev undoubtedly is someone worth checking out."},{"username":"Tigger","userId":7856835,"isRookie":"TRUE","commenter":"Nao","comment":"Tigger, formerly known as Xoul and [Soul], ranked his first set in February 2018. While that set is a chill spread on a calm anime song, many of his uploaded maps are much more intense; he's mapped things like Unlucky Morpheus, Reol, ICDD and My First Story in addition to the calm piano songs."},{"username":"Tofu1222","userId":6089608,"isRookie":"FALSE","commenter":"Niva","comment":"Tofu1222 may be best known for his plethora of contributions to the osu!mania sphere in and out, but beyond that he is actually someone who had done a lot of hybrid sets and has a firm grasp on other game modes as well! Despite on last year thoughout the osu!standard ranking scene he only contributed on a single Normal diff on his Datte Atashi no Hero mapset, Tofu1222 also has some other osu!standard maps on his graveyard to be sought out for the curious."},{"username":"tokiko","userId":2836455,"isRookie":"FALSE","commenter":"Mordred","comment":"Certainly not a new name to those familiar with the Touhou mapping scene, tokiko returns to the ranked section once again, bringing you 4 really cute simple maps, including their own take on Demetori's \"Kourou ~ Eastern Dream\", showcasing that you can make very nice experiences without the need of concepts. They seem to be staying for longer so I'm excited to see what 2019 will bring!"},{"username":"Tomadoi","userId":5712451,"isRookie":"TRUE","commenter":"Mordred","comment":"Not many mappers can say they've completed over a 100 maps. Tomadoi is one of those. Having submitted 130 maps by the time of writing this comment, it is sure to say that he seems to enjoy what he's doing. And all that hard work paid off in the end resulting in him ranking his first map in october 2018, and another right at the end of the year. Now that he's set the cornerstone for his mapping career, only time can tell how far he'll go in 2019."},{"username":"toybot","userId":2848604,"isRookie":"FALSE","commenter":"Mirash","comment":"toybot has ranked 10 of his mapsets in 2018 and showed good activity throughout almost whole year, but eventually found himself as an osu! gamer. Now he clicks circles, not places them. Clean maps that catch song very well, accompanied with thoughtful movements provide a pleasant gameplay experience. He was a part of Mappers Guild and did some cool beatmaps for new featured artists too. Will see if 2019 will bring us more maps from toybot!"},{"username":"Toyosaki Aki","userId":4044376,"isRookie":"FALSE","commenter":"yaspo","comment":"A pretty quiet year for Toyosaki Aki, just ranking one set in March. That set does not disappoint however. Matching DJ Totto's energetic \"Illumina\" with a very compatible map, Aki really shows that they shouldn't be underestimated. Even if they weren't very active in 2018, Toyosaki Aki's pending maps look promising for the year to come!"},{"username":"Troponoop","userId":4697757,"isRookie":"TRUE","commenter":"yaspo","comment":"With a play history graph that flatlines in recent times, it's clear that Troponoop has Forsaken playing to dedicate himself to mapping and modding. In 2018 that dedication finally got rewarded with a first ranked map! Troponoop's mapping style is all about not holding back, perplexing the player with one unique slidershape after the other. I'm certain they'll make a return this year if they keep up the good work."},{"username":"Trust","userId":1470352,"isRookie":"FALSE","commenter":"Mordred","comment":"A rather old member of the community at this point, Trust once again decides to push something to ranked, the map being SMiLE.dk - Koko Soko. Featuring a simple style, it shows that maps can be enjoyable without any complexity."},{"username":"TT Mouse","userId":2495509,"isRookie":"FALSE","commenter":"Mordred","comment":"If you like Sawano Hiroyuki, you should take a look at TT Mouse's maps from this year. Coming back to the ranked section after taking a break for a few years, they continue to deliver quality nzk maps, one marathon and one shorter full spread."},{"username":"Ultima Fox","userId":3198109,"isRookie":"FALSE","commenter":"Icekalt","comment":"After ranking two sets in 2016 and 2017, Ultima Fox really started to get active in 2018 with 6 different mapsets in the ranked section. His rendition of \"M2U - Stellar\" in particular, showed their ability to create maps with exciting gameplay, without being too hard to play. Another great achievement or theirs was joining the BNG in early 2018. Let's hope that they will show his mapping skills as well this year."},{"username":"Underdogs","userId":4675839,"isRookie":"FALSE","commenter":"Mordred","comment":"The one and only updog. Being a fan of idol and especially Roselia, they ranked 4 maps this year, with 3 of them being Roselia songs. I am fairly certain that Underdogs contribution with these maps resulted in Roselia becoming a lot more popular later on in 2018."},{"username":"Underforest","userId":6753180,"isRookie":"FALSE","commenter":"yaspo","comment":"UnderForest was super active again this year, easily doubling their amount of ranked maps and gds. All of them them are crispy clean and better than the previous ones. Most notable is that each of Forest's own sets is a lot more fleshed out than in 2017, making them enjoyable by all imaginable audiences. It's great to see that UnderForest has turned over a new leaf, they certainly will be welcomed back after their mapping break!"},{"username":"UnitedWeSin","userId":1778050,"isRookie":"FALSE","commenter":"uc","comment":"UnitedWeSin was a respected mapper during the 2013-2014 era, but went on a roughly 4 year hiatus from the ranked section. In 2018 they returned to rank their interpretation of \"Fujijo Seitokai Shikkou-bu - Best FriendS\". It's always cool to see older mappers returning, and always cool to see different interpretations of well-known osu! songs. We hope to see them rank more stuff before 2022."},{"username":"val0108","userId":243917,"isRookie":"FALSE","commenter":"scub","comment":"val0108 is a great example of a mapper who's adapted their style to modern standards well! Bringing his signature style, with a few modern refinements, he's managed to rank his \"Chiisana Koi no Uta\" map and get to have a say to both the mapping and playing community that despite being an old mapper, he can, indeed, still keep up with the community's roaring expectations! With his recent upsurge in mapping activity in 2018, I'm hyped to see more from val this year also!"},{"username":"Venix","userId":5999631,"isRookie":"FALSE","commenter":"Mordred","comment":"After being absent from the ranked section for nearly 2 years, Venix decided to start ranking maps again, mostly really short sub 1 minute ones. Glad someone is trying to help people who easily get nervous to fc maps."},{"username":"Veridian","userId":4191702,"isRookie":"FALSE","commenter":"Mordred","comment":"A mapper who really likes animal crossing. After exclusively ranking songs from it, including the legendary 12 low diff set \"Manaka Kataoka & Atsuko Asahi - Gozen 1-ji (Rain)\", they decided it's time for a change of pace and made a very challenging map of \"AAAA - carnation\". If you've grown tired of animal crossing, you should definitely check this out!"},{"username":"Vert","userId":3420746,"isRookie":"FALSE","commenter":"Mirash","comment":"Mentee of a yf_bmp, good and unconventional mapper from China, ranked a pretty straighforward mapset for a song called \"nano - DREAMCATCHER\" in 2018 with some guest difficulties, that are also not trying their best at being unconventional. Change in pace is good for maintaining fun in what you do sometimes. Hoping to see Vert coming back in 2019, as for the most part of previous from it year, he did nothing."},{"username":"victorfernando","userId":9187001,"isRookie":"TRUE","commenter":"Mordred","comment":"victorfernando ranked their first set in mid 2018, a short version of nameless x toa - Patchwork Staccato. Lets see if they will continue ranking maps in 2019."},{"username":"Wafu","userId":888955,"isRookie":"FALSE","commenter":"Gottagof4st","comment":"Only ranking one normal diff in 2018 and not really doing much aside from that, the good thing is that its an Aimer song and I will always welcome that. 2019 also hasn't showed any activity at all, maybe with a future Aimer song they'll come back to bring us more."},{"username":"wajinshu","userId":6339790,"isRookie":"FALSE","commenter":"Mirash","comment":"wajinshu wasn't that active as she used to be, but still ranked three mapsets for a variable songs of languages: Ukrainian, Korean and Japanese. Providing that content she spent 2018 well and will do so in 2019 as it seems."},{"username":"Walshy","userId":7136934,"isRookie":"TRUE","commenter":"Sulfur","comment":"After roughly 2 years of mapping Walshy finally managed to rank their own mapset -- walls, a lo-fi song to relax/study to."},{"username":"wcx19911123","userId":376831,"isRookie":"FALSE","commenter":"Mirash","comment":"Well known mapper, that wasn't too active for past few years, has ranked a mapset, full made by himself, on a song called \"BAND JA NAIMON! - METAMORISER\", shows his vibes in anime shows. Wasn't so active otherwise, definitely will be waiting for his appearance in 2019."},{"username":"William K","userId":2261651,"isRookie":"FALSE","commenter":"uc","comment":"William K ranked 2 mapsets in 2018, both on calmer, more relaxing songs than the usual ranked map. Their clean style is a good fit for these types of songs, making for a nice relaxing experience. They also supported other sets this year through lower difficulty gd's. These sorts of contributions to the ranked section are always appreciated."},{"username":"wolf3211","userId":5741153,"isRookie":"TRUE","commenter":"yaspo","comment":"GD'ing for the similarly named friends Cris- and Crissa, Wolf3211 hits the ranked section for the first time in 2018. While they had a humble start, with strides of improvement they also ranked their own mapset for \"Kowareyasuki\". Contrary to their favorite mappers, Wolf's maps are simple but still heaps of fun. Here's to seeing more of them this year!"},{"username":"FlyingTurbina","userId":2686293,"isRookie":"FALSE","commenter":"yaspo","comment":"Contradictory with his prior username \"WORSTPOLACKEU,\" FlyingTurbina is not the worst in the slightest. In 2018 he really showed the ranked section what he's made off, with as highlight finally ranking his \"Necro Fantasia\". Polack generally showcases a very different, refreshing approach to geometric styles in his mapping. So, even without many signs of new maps, we'll be happy if he does appear in the ranked listing again this year!"},{"username":"Xarr","userId":7262065,"isRookie":"TRUE","commenter":"yaspo","comment":"Making his debut on the energetic dnb song \"When Time Sleeps\" by Helblinde, Xarr shows us he has a knack for mapping in a clean and enjoyable style. On top of that, it's clear that he can competently map every difficulty level. This set is no small feat for a newcomer to the ranked section, let's hope he keeps up the good work!"},{"username":"Xayler","userId":3649657,"isRookie":"TRUE","commenter":"yaspo","comment":"Taking clearly after his inspirations and mentor, Xayler finally makes his first steps into the ranked section in 2018. Both \"Slow Dive\" and \"Onward\" feature insane difficulties that allow players to get absorbed into the song.\nEven though Xayler's style is simple, it's a solid foundation that makes me curious of how he will journey Onward in 2019."},{"username":"Xenok","userId":3256600,"isRookie":"TRUE","commenter":"yaspo","comment":"If you're looking for more Hatsuki Yura, then Xenok is your new go-to. This rookie's debut on \"Fairlady:Reincarnation\" is only the beginning of their love for strong vocals and intense instrumentals, as it's soon followed by impressive gds on \"Amatsu Kitsune\" and Mili's \"Vulnerability\". Sadly Xenok doesn't seem very active lately, though we hope they stick around to share more of this incredible song choice!"},{"username":"xLolicore-","userId":4525153,"isRookie":"TRUE","commenter":"StarrStyx","comment":"Ah, yes. A mapper that has the infamous Harumachi Clover as their first ranked difficulty. xLolicore- is mostly known for his GD's, especially on sets such as Realazy's Dropz -Line- and Grayed Out, but he still manages to rank a set of his own, a version of the the popular Lost Emotion hardcore remix. He certainly is a fast improving mapper, and we hope to see more of his stuff in 2019!"},{"username":"XVoIR","userId":2845588,"isRookie":"TRUE","commenter":"yaspo","comment":"Not afraid of mapping a song in his native language, Xvoir makes his first entry in the ranked section with the polish \"Tarzan JJayJoker\". I wonder if this mysterious joker will make a return in 2019, but I'm certain he'll make progress as a high level player."},{"username":"Yahuri","userId":4682629,"isRookie":"FALSE","commenter":"Monstrata","comment":"I had the opportunity to nominate Yahuri's first ranked map, and immediately saw a lot of promise in her unique take on hex-grid mapping. Yahuri's mapping style incorporates a wonderful combination of equidistant patterns and spacing techniques, along with a looser mapping structure. This results in visually pleasing patterns while still giving a wealth of variety to her maps. If you like Bungo Stray Dogs, male vocals, BL, or just want to play some high quality and enjoyable maps, definitely look up Yahuri!"},{"username":"Yamicchi","userId":6486831,"isRookie":"FALSE","commenter":"yaspo","comment":"Yamicchu? Yamichui? Yomochoi?? Yummycchi?! As a mapper with as many nicknames as maps, Yamicchi definitely was well received again this year. They stand out with engaging electronic maps which will easily catch you off guard, like \"Tuy Am\" and \"Venom\". Their tv size maps also are just a blast to play. We're happy to see Yamicchi continue what they're doing this year, as all the praises they've collected are definitely well deserved!"},{"username":"Yasaija 714","userId":423548,"isRookie":"FALSE","commenter":"Mordred","comment":"Ranking 15 maps in a single year is no easy feat, yet Yasaija accomplished just that! Exclusively ranking songs with female japanese vocals, they are sure to have something to fit people's taste. It's also worth noting that they often give up the highest difficulty on their sets to let others take the spotlight or just have lots of guest difficulties above their own difficulties in general in order to have as many different takes on a song as possible."},{"username":"yaspo","userId":4945926,"isRookie":"FALSE","commenter":"Halfslashed","comment":"A rookie in 2017, yaspo has definitely taken the past year as chance to improve from being hopeful to accomplished. This year he became a member of the BNG, as well as ranked more concept based sets for both mappers and players to enjoy. He's also taken on a great amount of responsibility in the community mentorship program, both as an organizer and mentor. Really hope we'll continue to see more great things from him in years to come!"},{"username":"Yauxo","userId":898306,"isRookie":"FALSE","commenter":"yaspo","comment":"Yauxo shows their love for energetic rhythm game music once again, following up 2017's \"We're so Happy\" with \"I'm so Happy\". This even more rhythm-oriented map definitely is worth checking out! We can only wonder if there will come a part 3 this year on a track called \"They're so Happy\" ..\nYauxo also briefly joined the BNG during 2018, but stepped out before the end of the year. Even though his stay was short, his efforts are highly appreciated!"},{"username":"yf_bmp","userId":1243669,"isRookie":"FALSE","commenter":"scub","comment":"yf_bmp has never disappointed us, not even this year! With his mastery on visual-patterning coherence, he has made lots of very great maps, despite most of them being guest difficulties for other mappers. His renditions of sakuzyo's \"Laplace\" and Camellia and Akira Complex's \"Railgun Roulette (VIP)\" proves this, and all in all we can't wait to see more maps from this guy in 2019!"},{"username":"YooA","userId":1079625,"isRookie":"TRUE","commenter":"yaspo","comment":"Priorly known as \"Revia\", this newcomer adds another solid set to the \"Re:Tryment\" listing. With an overflow of guest difficulties, they ensure every player has something they'll love playing. YooA's difficulty absolutely doesn't fall short to some of the experienced mappers on the set. Sadly, they haven't been very active recently, but we're still hopeful for their return!"},{"username":"Yoshimaro","userId":3823413,"isRookie":"TRUE","commenter":"Sulfur","comment":"New to the ranked scene, Yoshimaro managed to rank two fantastic beatmaps, and easily stands out from other rookies with DANCE ALL NIGHT -- their first ranked mapset with 10 difficulties, being a pleasant experience to everyone who appreciates variety in rhythm choices and challenging patterns. Hope to see more from them in 2019!"},{"username":"yShadowXOP_","userId":7754679,"isRookie":"TRUE","commenter":"Nao","comment":"yShadowXOP_ ranked two sets in 2018, the opening from Katanagatari and the opening from Pan de Peace. Both cap out around the Insane difficulty level. However, his maps are not exclusively of anime songs: he's also mapped Imperial Circus Dead Decadence as well as various other metal artists. We look forward to seeing him continue his fast improvement into the future."},{"username":"Yudragen","userId":8406396,"isRookie":"TRUE","commenter":"Nao","comment":"Yudragen, formerly known as ChaoticRed, entered the ranked section in April 2018 with a Sawano Hiroyuki songs compilation. He maps nearly exclusively anime, and most of his top difficulties reach around the 6* mark. He has a particular taste for Sawano, Kawada Mami and other female vocalists. Be sure to give his maps a try if you enjoy those artists."},{"username":"Yugu","userId":3161834,"isRookie":"FALSE","commenter":"yaspo","comment":"With how established Yugu has become, you'd almost forget they only barely weren't a rookie in 2018. No matter what gd or set, Yugu's CS4-avoidant style always has an interesting aim challenge to offer. Stand-out examples are the precise cs4.5 aim map \"Towa ni Saku Hana\" and surpising 1/4 patterns on both \"Feel it\" and \"Jue\". I'm interested in seeing Yugu's progress this year, will he push his circle sizes even further, or will he find even more inventive ways to use them? Only one way to find out!"},{"username":"Yukiyo","userId":4541873,"isRookie":"FALSE","commenter":"gottagof4st","comment":"Starting 2018 as a mapper known purely for supercell that has changed for sure. Branching out to other kinds of music and away from the pretty hexgrid style from before has opened up a lot of new ways of mapping which can very clearly be seen in all of his recent maps like kyuutie ladies. Not only that as he has also become a bn later in the year. All in all yukiyo has proven their capability in all different kinds of fields!"},{"username":"YukiZura-","userId":7272036,"isRookie":"TRUE","commenter":"Nao","comment":"YukiZura- enjoys mapping anime and Kano. He entered the ranked section with a map of \"Daisy Blue\" by Kano, and followed it up with two TV sizes later in the year, along with two Easy GDs. His other uploaded maps include various other Kano and anime songs, so give YukiZura- a shot if you like clean Insane and Extras accompanied by cute j-pop vocals."},{"username":"Yusomi","userId":4174940,"isRookie":"TRUE","commenter":"lcfc","comment":"While previously known for several of his maps in the graveyard, Yusomi decided to step his game up and rank 3 maps this year, all of which showcase the mapping experience he's accumulated over the years very well! Should you be looking for irregular yet fun and well designed maps, look no further; Yusomi's creations might just be your cup of tea!"},{"username":"Zer0-","userId":4260033,"isRookie":"FALSE","commenter":"Halfslashed","comment":"A mapper who made his debut last year, Zer0- both appealed to players and mappers alike with a ranked set and a loved set of popular songs. If you're into electronic songs, he's definitely someone to check out."},{"username":"Zero__wind","userId":1822830,"isRookie":"FALSE","commenter":"uc","comment":"Zero__wind has been a prolific mapper and active BN for many years now, as well as helping the community as a GMT. In 2018 they started to drift from the mapping community, and resigning from BN at the start of the year. They did still rank 2 mapsets this year, with their \"Lynn - Fair wind\" set made to show off a collab difficulty from two ancient mappers. We hope to see Zero__wind return to the ranked section or the BNG another day, but wish them the best in their life should they choose otherwise."},{"username":"zhu","userId":8034889,"isRookie":"TRUE","commenter":"yaspo","comment":"Zhu had an insane start to their mapping carreer in 2018. A debut with a whopping 11 own ranked sets turns them into a mapper who's already known around the community. Even more impressive is the variety in their mapping, the alt styled \"Ooedo Ranvu\", slow \"Ref:rain\" and unique stream designs on their \"5150\" really show just how versatile Zhu can be. We've seen a lot of growth from Zhu throughout the year, so we're excited to see how much further they can take it this year!"},{"username":"ZinedineZidane","userId":7810803,"isRookie":"TRUE","commenter":"Mordred","comment":"Not to be confused with the french football player, ZinedineZidane joins the ranked mappers club with their map of Waterflame's \"Wingless\". It is noteworthy that they made the entire set themselves, something you don't see that often for new mappers."},{"username":"Zinreu","userId":6225427,"isRookie":"TRUE","commenter":"Mirash","comment":"Zinreu had joy mapping meme Russian song and fun maps for a while, but he eventually decided to make something with a clear goal of ranking in mind and has succeeded with his \"Liz Triangle - Who Killed U.N.Owen\". It turned out to be a pretty solid ar8 map that keeps players attention attached to the song greatly. Let motivation not leave him in 2019 and ideas to come."}]