[{"username":"_Asha","userId":11103764,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"_Asha is a new mapper who only started mapping in April 2018, but has shown an impressive dedication towards learning by ranking his first set only 5 months later! His hard work is clearly paying off, as he is developing a talent for making comfortable yet fun patterns based off flow as well as well-executed LN usage. We can't wait to see more of his growing talent!"},{"username":"_Stan","userId":1653229,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"With a positve attitude and an increasing mapping skillset, _Stan has been making waves through the mapping world. Though 2017 was quiet for _Stan, 2018 has been quite an exciting year. Besides his impressive BN work and his amazing modding talent, he has ranked 2 mapsets this year as well as one GD, allowing him to show his ability to juxtapose cozy patterning and comfy LNs with ambitious SV usage in order to create visually exciting and challenging mapsets for players of all levels. His dedication to the mania community is incredibly admirable and we'll greatly appreciate his work in the coming year."},{"username":"_underjoy","userId":2235750,"isRookie":"FALSE","commenter":"Maxus","comment":"_Underjoy comes back stronger each year with ranking some of the hardest maps in the mania community. His Volcanic and Deublithick pushes musical layering to the upmost limit as well as bringing high level content that is quite scarce to be seen in the ranked section nowadays. He focused on bringing dense chordstream and slipped some bracketstream in-between to enhance the technicality and the difficulty level of the map to fit more with the star rating expectation from the players. Overall a really intriguing mapper that constantly brings a different style focus each year."},{"username":"_VianK_","userId":6889055,"isRookie":"TRUE","commenter":"Hydria","comment":"A mapper for a couple years now, _VianK_ pops his head into the ranked section this year on K a b i -'s citrus set. Whilst being a low star difficulty, the map focuses more on comfortable patterning than anything else, being an enriching experience for newer players, and hopefully we can see more maps from them in the future!"},{"username":"- Aries -","userId":6639880,"isRookie":"FALSE","commenter":"qqqant","comment":"A talented mapper in both unranked and ranked, - Aries - ranked the Bang Dream cover of Guren no Yumiya this year in a period around June when it was quite popular to rank Bang Dream maps. With a simple and enjoyable approach to the song, people from a wide variety of skill levels have been able to enjoy the map. The map's popularity partly has to do with its source was well, and - Aries - is continuing to map more Bang Dream songs, potentially for rank."},{"username":"- Ly0572 -","userId":4861005,"isRookie":"FALSE","commenter":"Hydria","comment":"A pretty established mapper at this point, - Ly0572 - brings a number of sets into the ranked section this year alongside a number of GDs, mainly Torikago and Kotoba no Iranai Yakusoku. Torikago features heavy LN usage in it's highest diff collab with Ibrahim as well as featuring hand biased LN-based patterning in the HD diff below, each diff containing a unique aspect to it, making it stand out from the usual TV Size maps out there. Meanwhile, Kotoba no Iranai Yakusoku tries to keep it simple, with repetitive comfortable patterning for users, making it a good map for acc players overall. A generally nice sight to see in the ranked section, hopefully we can see more from them in the future!"},{"username":"-H i k a r i-","userId":7109287,"isRookie":"TRUE","commenter":"Lusty Platypus","comment":"Known as Das-[Hikari]- when they ranked their first beatmap this year: Magical Musical Masterpiece by Sakuyzo garnered quite a lot of attention from players of all different skill levels due to its accessible and somewhat traditional patterning, the easier charts featuring good PR usage as well as the occasional minijack, whilst the harder charts featured general comfortable chord patterning but with daring jumpstream-designed bursts and a beautifully crafted LN solo in the middle. Being -H i k a r i-'s first ranked beatmap we can hope to see more coming from them in the future."},{"username":"-MysticEyes","userId":6253266,"isRookie":"TRUE","commenter":"Maxus","comment":"Even with -MysticEyes only just appearing in the mapping scene as of 2018, the influence and contribution he has brought to the community is arguably one of the topmost within mania history, especially in the modding department where he managed to become mania BN as of October. His mapping features LN based layering that differs in style in both currently ranked beatmaps. While his Xperanza has a hefty usage of stacked 1/4 LN to emphasize certain hard instruments which adapt each sound to a specific length, his Quaoar brings it to an entirely new dimension when it emphasizes the inverse LN layering with irregular releases and abnormal hold length variation that looks intimidating at first to read, but in actual gameplay can be executed flawlessly for players at this level. This is proof of his mapping prowess and level of mastery towards pattern understanding that not a lot of people have. With him keep being a prominent member of the community, it's not surprising that he will bring a new wind to the mapping meta and it's best to be promoting his style to be an inspiration towards other mappers."},{"username":"[ A v a l o n ]","userId":4632359,"isRookie":"FALSE","commenter":"Maxus","comment":"[ A v a l o n ] returns to the mania mapping scene once again after being in hiatus for quite some time. He still retains his comfortable and conventional approach of mapping with his latest ranked beatmap that focused more on casual players. The map deserves the respect it has because of how the majority of the community prefer his mapping style. Alongside that, his maps have a generally high playcount, favourite count, and overall positive reception which makes him a clear idol in the community."},{"username":"[Shana Lesus]","userId":2881789,"isRookie":"FALSE","commenter":"Hydria","comment":"A mapper truly known by all at this point, Shana works from beyond the wall to bring us another two GDs for the ranked section this year, breaking away from the normality of 4K and extending their skills into the realm of 8K. Whilst none of his maps feature the complexity the community has come to know, they still stand out well in their own right, focusing mostly on comfortness and enjoyability whilst still keeping density and pitch relevancy in check, leading to the skills of an experienced mapper. Hopefully we can see more GDs from them in the future!"},{"username":"Abraxos","userId":5025064,"isRookie":"FALSE","commenter":"qqqant","comment":"A well-known mapper with a unique approach in mapping, Abraxos snuck back in this year to the ranked section with one guest difficulty on riunosk's Heaven's Fall. His difficulty, being an Insane on the set, included fast jumpstreams, structured with fine use of repetition and vocal layering. Of course, this difficulty alone does not give anywhere near the credit that Abraxos deserves, what with two of his spectacular maps getting into the Loved section this year. Abraxos is a very expressive and detailed mapper, as can be seen in his maps in Loved, but most especially in his Rhuzerv, an underplayed chart with a unique LN release style. We hope that Abraxos will be back to the ranked section with more of his amazing maps!"},{"username":"AchsanLovers","userId":6368737,"isRookie":"FALSE","commenter":"Maxus","comment":"AchsanLovers, being notable in mania community as the Qrispy Joybox mapper, keeps bringing content that expresses himself the best to the players. Starting his first ranked beatmap of the year back in January 2018, AchsanLovers didn't stop trying something new as proven by his latest ranked beatmap in October 2018, where he did a piano-based keysound map, which is uncommon within the mania ranked section, alongside giving an extremely beautiful interpretation of the song. To add even more to how astounding the map is, the patterns themselves also feature complex snapping such as 1/6, 1/8 or even 1/12 slipped in-between, making it quite a challenge to read properly but, at the same time, enhancing the intricate layering to the fullest."},{"username":"Agayers","userId":8525528,"isRookie":"TRUE","commenter":"Hydria","comment":"A relatively new mapper to the scene, Agayers grants the ranked section an extra map this year with the full marathon Isuzu no TRACK. This full 5:40 track and map give the feel of old-style DJ SHARPNEL maps, though you have to be careful as the SVs inside can catch you out if you're not paying attention! Definitely a wonderful sight to see in the ranked section and we hope we can see more from this mapper in the near future."},{"username":"AJIekceu","userId":940656,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Though 2018 was a quiet year for him, AJIekceu, a mapper known for his Pump it Up sets, had his first 7k difficulty featured in the ranked section in Nysrogh's Mama ft. William Singe set, bringing out the calm pop song to the fullest using comfortable yet slightly challenging patterns for intermediate players."},{"username":"AlisceaSparku","userId":3063218,"isRookie":"FALSE","commenter":"Maxus","comment":"AlisceaSparku is one of the earliest members of the modding community, making quite a noticeable presence in the old times and certainly still not forgotten now. His layering approach in his GD, Kotoba no Iranai Yakusoku, consists of the solid and rigid patterning and structured that are focused on the usage of more advanced type of LN that are consistently been applied throughout the chart as the main foundation of the map."},{"username":"Alsty-","userId":8122392,"isRookie":"FALSE","commenter":"Hydria","comment":"A pretty old mapper by today's standards, Alsty- takes another shot at the ranked section this year with his normal GD on Mama Minta Pulsa. With it's focus on melody, it takes a daring trip into 1/4 notes for a normal, though still focusing on comfortable patterning throughout, something a user can definitely find enjoyment in playing. Hopefully we can see more ranked sets for them in the future!"},{"username":"AYAYAA","userId":4980256,"isRookie":"TRUE","commenter":"Unpredictable","comment":"Better known as Alternater, AYAYAA is a high ranked, well skilled, and extremely talented player and mapper that seems to improve not only in playing mania, but his mapping proficiency too, making him a well-versed mapper within the mapping scene. When it comes to mapping, he preferably makes 4K based maps, but with interesting concepts to follow up with them. Last year, he was able to put some of his maps into the ranked section which really showcased some of his SV and jumpstream mapping capabilities which really shed some light on interesting, conceptual ideas through his in which many players seem to enjoy. With the amount of dedication and passion he has for the game, we hope to see more him and his maps in the future."},{"username":"Amiichii","userId":9228569,"isRookie":"FALSE","commenter":"Hydria","comment":"Amiichii blows away the ranked mania collection this year, ranking 4 sets of their own whilst also GDing in 5 of them. Focusing mainly on anime-related tunes, their distinct LN-mixed chord based style mixed with the occasional anchor-based jumpstream is definitely one to stand out and catch the eye of the community. We hope to see more wonderful maps from them in the future!"},{"username":"AncuL","userId":2449200,"isRookie":"FALSE","commenter":"Hydria","comment":"AncuL, a name nearly as old as mania itself, finally treats the ranked section with one of his own mapsets, and what a first map to start with! Given the title for mania's longest map this year at a whopping 9 minutes, it features a wonderful flowing mixture of LNs accompanied by an inspiring and uplifting folk song, a map easily bringing tears to the eyes of many. We hope he can keep this top tier quality throughout the rest of his career and can be treated to more wonderous ranked maps in the very near future."},{"username":"arcwinolivirus","userId":2039089,"isRookie":"FALSE","commenter":"Maxus","comment":"Being a top player and well-known figure in the community, arcwinolivirus consistently ranked beatmaps each year starting from 2014 and is still doing so even in 2018 which is a respectable achievement to have. His mapping style moved from mostly challenging high level beatmaps that focused on top players to more casual friendly beatmaps which have relatively easy chording patterns along with pure-rice patterning. With his chart designs being for both 4 key and 7 key player, it expands the playerbase even more considering the scarcity for other keymodes."},{"username":"arpia97","userId":6363008,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"arpia97, a well known top-level vibro player, had his first appearance in the ranked section with his GD for Lude's I mapset. His focus on trill/stacked based jumpstreams and jack based handstreams made for a unique interpretation of the fast-paced chiptune track. Make sure to check out his vibro maps if you're interested in vibro, and watch out for his future ranked maps/GDs!"},{"username":"Arzenvald","userId":3027421,"isRookie":"FALSE","commenter":"Maxus","comment":"Arzenvald is already a long-standing figure and has developed a mapping experience that only a few other community members have due to him being a mapper, a modder and also a BN simultaneously. He always put an emphasis on the fact that maps need to have a decent amount of variation and layering in a way that it reflects the song to its fullest instead of only mapping the percussion that doesn't give the song justice. His mapping style isn't afraid to go overboard and even sometimes receives community controversy due to implementing something new and creative. However it's worth the effort when in the end, his mapping idea and techniques becoming more refined and better as time goes. Although Arzenvald only can contribute to the GD in 2018 due to in real life issues, we sure hope that he will mapping and ranking his own charts in 2019!"},{"username":"Asherz007","userId":9014047,"isRookie":"FALSE","commenter":"Maxus","comment":"Usually we see Asherz007's mapping style being rice-oriented that focuses on either jumpstream and handstream in most of his notable charts, but, specifically for 2018, he crafted an uncommon LN based map that is completely unusual given what he's known for. His S.O.S chart mostly substitutes the 1/8 jumpstream burst from 4 key to a pure 1/8 single LN stream for 6 key. This shows that Asherz007 is starting to develop an understanding towards incorporating other pattern styles that still retain his identity. With his tangible improvement that shows in his latest ranked chart, next year there will be a high expectation for him to bring something different to the scene once again."},{"username":"Aste-","userId":4915137,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Aste-, a mapper who first appeared in the ranked section in 2016, is an occasional GDer who has made a significant contribution to quite a few well-known ranked mappers' sets. This year he appeared in an Intermediate difficulty in Rivals_7's cyanine mapset, introducing upper-normal level players to 1/3 rhythms and simple 1/4 bursts. Though his appearances in the ranked section are spread out, Aste- always makes sure to make an interesting impression in the difficulties he makes!"},{"username":"atian540","userId":6316524,"isRookie":"TRUE","commenter":"Hydria","comment":"atian540 brings himself into the limelight this year with not one but two ranked mapsets. A fairly new mapper, his maps offer simplistic yet enjoyable patterns for every user to play, and with the slight play with LN patterning, it'll be nice to see what the future can hold for this aspiring mapper!"},{"username":"Benzopirene","userId":1887068,"isRookie":"FALSE","commenter":"Unpredictable","comment":"Benzopirene has been one of the longer lasting members within the osu!mania community, and has generally promoted various anti-keymodes through their maps, whether in ranked or in graveyard. For the most part, they map mostly 7K maps and through the ranked section of last year, they were able to show how capable they are when it comes to mapping. Through this, they were able to showcase a well-crafted jack heavy map and one that spotlights every keymode for everyone to enjoy. On top of this, they also make a lot of 7K maps that go to the graveyard, but their maps really display some interesting and well thought out concepts that many 7K players will enjoy. A very knowledge and highly experienced mapper that has proven their worth through their maps over the years and we hope to see more of them in the future."},{"username":"biemote","userId":799606,"isRookie":"FALSE","commenter":"Hydria","comment":"biemote, an old but not forgotten name in this community, has another go at the ranked section this year with two hard GDs on Koi and YUKARI. Featuring really dense jumpstream-style patterns alongside anchors and hand-bias bursts, the complexity in each difficulty truly shows that their years here have definitely paid off, and hopefully we can see more from them in the near future!"},{"username":"Blocko","userId":4075092,"isRookie":"FALSE","commenter":"qqqant","comment":"ET Blocko made a single appearance in the ranked section this year on _underjoy's set of Deublithick. This year was a good year for highly difficult 7K sets, and Deublithick was no exception. In his guest difficulty, ET Blocko uses challenging chordstreams to test the player's finger independence. Now, ET Blocko is pushing his set of goreshit - o'er the flood, a large 7K set with a variety of expertly crafted difficulties. We hope that ET Blocko can come back to the ranked section in 2019!"},{"username":"booty","userId":4605217,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Though he mostly makes 4k mapsets, booty's first ranked GD wasn't only in a famous mapset, specifically Insp1r3's Mazare Party, he also stepped outside of his norms to create an exciting insane-level 6k mapset that provides a good introduction to faster light chordstreams for 6k players. We're excited to see both 4k and 6k difficulties and sets from him in the future, so definitely stay tuned for his future maps."},{"username":"ByeForNow","userId":7199159,"isRookie":"FALSE","commenter":"qqqant","comment":"ByeForNow appeared in the ranked section with two guest difficulties this year, both on riunosk's set of Heaven's Fall, one being geared towards longer LN lengths, the other being a bit more speed-oriented. With this unique contrast in difficulty, we hope to see ByeForNow return in 2019 with more of his maps in the ranked section. Be it LN or speed, we know that ByeForNow can get any of it covered."},{"username":"Calcyon","userId":2412652,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Calcyon's progression from 2017 to 2018 was nothing short of astonishing, stunning the mania community with his latest ranked map, envidia. He showcased his prowess in creating unorthodox maps by perfectly matching daring patterns such as long 1/8 trills and ambitious jack/LN usage to the lush guitar-heavy melody in order to maximize musicality and to create an incredibly unique playing experience arguably never seen before in the ranked seciton. We are incredibly excited to see how he will showcase his sheer mapping talent and versatility in the future since his contributions to the ranked section have been absolutely amazing so far."},{"username":"capsafangirl","userId":4308015,"isRookie":"TRUE","commenter":"Hydria","comment":"A relatively old mapper by today's standards, capsafangirl finally breaks into the ranked section this year with their insane diff on underjoy's Deublithick. Diving into 7K, the patterns used throughout resemble similar to easier BMS-style charts, which, at 228bpm, makes the map feel more enjoyable instead of being a ridiculous speed race. With some tricky 1/4 streams trickled in as well, the map feels fitting and pleasant for users that are not quite used to the harsher patterns of 7K at this fast speed. Hopefully we can see more maps from them in the future!"},{"username":"Carol","userId":7495614,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Coming back into the ranked scene in September of this year, Carol's ranked (as well as unranked) mapsets have shown their talent for mapping out challenging jacks, chordjacks, and even exciting SVs in their unranked mapsets. Though Carol's new ranked set is short, it's interpreted in an interestingly unique way as they continue to create sets that simultaneously provide fun content for new players and provide accuracy challenges for experienced ones. Their enthusiam for mapping clearly shines through and we can't wait to see the new content they have to offer next year."},{"username":"Chilly-","userId":7792942,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Though he is a relatively new mapper, Chilly- has pleasantly surprised many through his rapid improvement in mapping, ranking his first mapset in November this year. With his first ranked set, he utilized a song with complicated time signatures in a well-polished and fun way by using excellently patterned 1/4 bursts and classy long LN usage that combined into a suitable and accessible mapset that any player can enjoy, a quality that is always appreciated and a sure sign of his future success as a mapper!"},{"username":"chouyaa","userId":8404646,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"chouyaa is a new GDer to the ranked section, but he showcased his style very appropriately in riunosk's Sweet Dreams (11t dnb mix). His normal difficulty provides a comfortable playing experience for novices through cozy 1/2 melodies, challenging 1/2 stacks of doubles and single notes, as well as friendly LN patterning. His unranked sets prove that he can map a variety of songs as well with his style, and we hope to see more of his work soon."},{"username":"Civilization","userId":6814203,"isRookie":"TRUE","commenter":"qqqant","comment":"Civilization has been known to create SV maps that appear simplistic in nature, but are rather quite difficult to hit accurately. This is demonstrated quite well in her ranked map, Interlude, a short but challenging map. Though this was Civilization's only contribution to the ranked section this year, she has been seen in the mapping scene outside of unranked quite frequently. Civilization hosted SBFB, an SV sightreading tournament, and also mapped for it along with Couil, Hydria, Evening, and me. In addition, Civilization's KAMISORI was featured in the semi-finals pool of 4K MWC 2018, with difficult anchor jack and technical patterns."},{"username":"Cokiiplay","userId":6760124,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Cokiiplay is an extremely prolific unranked mapper with quite a bit of experience behind him, especially in mapping unorthodox song choices. Therefore it wasn't a surprise when he came out with a well-made 4k hard GD for Insp1r3's Mazare Party mapset that focused on a variety of patterning including introductory LNs and simple yet elegant jumpstreams"},{"username":"Couil","userId":6872025,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"A mapper made famous for his absolute showstopper of a first ranked map, Couil started off 2018 with a bang. He displayed his incredible mapping talent by utilizing intense bursts and beautifully executed SVs in fuego (sakuraburst remix). While he is most famous for his first ranked map, Couil displays a remarkable versatility sought after in the mania community. His second ranked map, Harumachi Clover, proved his talent in making accessible mapsets and, to the delight of many players and mappers, he has continued to improve even more in creating experimental maps such as his loved SV mapset Epollo. Alongside that, he also has a variety of well-made unranked mapsets that show off his ability to make amazing jumpstream, technical, dump, and LN oriented sets along with his aforementioned SV talent. In addition to all of this, he also had an impact on the tournament scene as a mapper in SBFB, a sightreading SV tournament. Definitely a mapper who will continue to impress and excite us in the future!"},{"username":"Critical_Star","userId":3793196,"isRookie":"FALSE","commenter":"Maxus","comment":"Being one of the senior and veteran charter of the community, Critical_Star constantly proves himself that his technique and high level of prowess and execution for both 4 and 7 keymodes are one to be sought for, especially considering the difficulty of his charts being mostly an X icon to begin with. Starting from his first ranked map of the year, he utilizes a lot of chordjacks combined with short bursts that makes it really difficult for the map to be nailed properly even for top level players. Not to mention the amount of long trills combined with the stream, followed up with extremely harsh bump SV section that gives even more of a fervor for the player with how the chart emphasizes the instrument, which heightens musicality to the max. As for his 7K chart, he uses a lot of intricate bracketstream along with some advanced LN patterning that cannot be breezed through easily. Especially on his Destr0yer ranked chart, he did an additional gimmick that centered around his back and forth 1/16 burst that required high finger independency but at the same time fast finger reaction to properly hit the pattern. With a huge amount of variation, he consistantly brings his best to the ranking section for both keymodes; it's not an exaggeration to say that the amount of anticipation and the excitement that the community expect from him is getting higher and higher each year."},{"username":"CrumpetFiddler","userId":3518705,"isRookie":"FALSE","commenter":"Maxus","comment":"Through his latest ranked beatmap, CrumpetFiddler shows that he willing to branch into another genres of music that have different styles from his usual Dragon Ball maps. Although his map still mostly comprises of simple jumpstream type of pattern, he also incorporated new types of patterning within his chart such as a long minijack section and a small LN gimmick that shows his versality to keep improving throughout the year."},{"username":"Cryolien","userId":1626983,"isRookie":"TRUE","commenter":"Maxus","comment":"A well-seasoned and experienced player that was a runner up of OMWC 2018, Cryolien doesn't usually join the mapping scene which changed at the beginning of 2018 where he mapped more than 30 beatmaps throughout the year, to which one got ranked in April, making it his first ever mania ranked beatmap. The first section of the map mostly contained simple 1/2 chord patterning mixed with simple LN layering that reached the climax when the song arrived at the bridge section. For being relatively new in the mapping scene, he managed to create a decent chart worthy for ranked which is a great achievement."},{"username":"Crystal","userId":1646397,"isRookie":"FALSE","commenter":"Hydria","comment":"A famous quad-mode player and CTB champion, Crystal takes another shot this year into the mania ranked section with his collab on LiFE Garden.  With free-flowing patterns and column-based placements which show expertise in the field, we hope to see Crystal aim higher and higher in the future!"},{"username":"Curiossity","userId":6490035,"isRookie":"FALSE","commenter":"Raveille","comment":"As a follow-up to his previous ranked map Airborne Robots, Curiossity added Feelin Sky to the ranked section, as well as his guest difficulty on Ethnik Khemikal Teknologi, both maps having met great reception, with his very interesting and equally as unique designs and patterns. He has also been very active in mapping in 2018, notably mapping various Camellia songs, and with his interesting blend of LN and SV, he is a mapper to definitely look out for in the following year."},{"username":"DarckoSeth","userId":9229539,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"DarckoSeth, a new mapper to the ranked section, made an impressive effort over the span of five months to create an effective handstream oriented map from a beautiful piano-oriented instrumental track. His excellent work ethic helped him learn essensial mapping concepts and have greatly fueled his growth as a mapper, and will surely help him grow even more in the coming year."},{"username":"DE-CADE","userId":3734394,"isRookie":"FALSE","commenter":"Unpredictable","comment":"As someone who started mapping mania as early as 2014, DE-CADE as really stands out in the mania community as an outstanding mapper, pushing multiple 4K and 7K sets and GDs into the ranked section throughout his career. He typically chooses rhythm game based songs that's to his liking and always makes something enjoyable for everyone. He was also an excellent modder which helped him regain being a Beatmap Nominator during 2018 for a short period of time, helping people within the community by pushing mania maps into the ranked section. DE-CADE has done a great deal with helping the mania section grow, whether its making ranked or unranked or help push maps to the ranked section, we hope to see more of him in the near future."},{"username":"Dellvangel","userId":5186244,"isRookie":"FALSE","commenter":"Maxus","comment":"After being in hiatus for some time from the mapping and modding scene, Dellvangel came back strong in both departments by ranking his Axium Crisis map, along with being a mania BN once again. While in the past he was completely focused on providing a balancedand clean chart that was comfortable to read due to high visual readability, in 2018 he evolves his style to focusing on stacked 1/4 LN that accents the small essence of sound along with a  combination of basic and advanced LN pattern that spreaded across the chart. His chart indirectly gives the hidden message to other charters that variation changes throughout the map are indeed an important aspect, avoiding only doing one same unique concept for the entire map."},{"username":"Div","userId":3751116,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"With an eye for consistent patterning and a superb sense of structuring (as well as a hilarious sense of humor), Div made his way into the ranked section with Mou Ii kai?, a set with jumpstreams and chordjacks that provide an excellent introduction to players getting used to playing denser patterns and a fun accuracy challenge for advanced players. The preparation he put into his work was impressive since it was obvious that he had a clear vision of how he wanted his set to play and how to execute it. We will definitely expect more expertly crafted maps in ranked from Div in the future!"},{"username":"DoNotMess","userId":1596318,"isRookie":"FALSE","commenter":"Maxus","comment":"With a strong start that he showed back in 2017, he makes himself even more notable within the community by ranking total of 4 charts as of 2018. The highlight of his 2018 ranked list comes mainly from 2 beatmaps. The first one being Disperagioia, which focuses on high amount of dense chordjack and minijack that requires high amount of stamina to be nailed properly, combined with some intricate bursts that occur in the middle of chord patterning, combined with advanced long note patterns as well as some SVs to spice things up furthermore. The second map is Inverse World, which incorporates tricky LN releases and an Inverse wall LN that gets trickier when the song gets more intense, while the last kiai part arguably utilizes the hardest inverse releases in the difficulty. The amount of advanced patterning that DoNotMess is capable of executing flawlessly is astounding to the point where he manages to be a front runner mapper of this community."},{"username":"dosyeru","userId":448367,"isRookie":"TRUE","commenter":"Maxus","comment":"dosyeru is an old face that is known for mapping 7K+1, ranking his charts and GDs as early as 2014. Although he already retired from the mania mapping scene, the amount of anti-meta charts that already made are specifically good for newcomers that want to learn the modes, because his patterning mostly features a more basic approach to the scratching column that makes it more accessible. The example would be in his GD in Pocket-Gao's chart which he delivers light and convenient patterning by using a lot of linear stairs as one of the map's, and his own distinguishable feature."},{"username":"Dr_Marc","userId":4614127,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Featured in TheNewBungping's Iwai kedo ne. set, Dr_Marc's GD debut in the ranked section was an interesting departure from other normal level difficulties, utilizing creative 1/4 rhythms as well as 1/6 grace notes that allowed players to learn new rhythms in a safe, low-BPM enviornment. An accessible yet slightly unusual GD like this is quite interesting to have in the ranked section and definitely reflects the work he put into it."},{"username":"Draftnell","userId":3406652,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Combining density with accessibility, Draftnell continued his long and well-known career in the ranked section in 2018 with 2 mapsets: Jounetsu Utopia and Mama Minta Pulsa (Speed Up Ver.). Both sets are quite effective in introducing advanced players to insane-level mapsets via smooth SVs, frequent quad usage to emphasize stronger sounds, and longer jumptrill/ 1/8 sections in his upper level difficulties. His commitment to creating player-friendly maps and unique song choices have allowed him to create sets that appeal to a wide audience: from casual players looking to enjoy the song to higher-level players looking for a fun accuracy challenge. As such we're excited for him to continue making more fun beatmaps that anyone can enjoy!"},{"username":"Dreamwalker","userId":8946550,"isRookie":"TRUE","commenter":"Unpredictable","comment":"Formerly known as Otakujanai, Dreamwalker is definitely one of the most talented and noteworthy mappers we have seen this year. Although he's one of the newer faces of the ranked section, he's been actively mapping and modding for past two years and since then, he has really found creative and expressive ways in mapping distinctive song choices through SV usage and unique patterns that will definitely leave you on the edge of your seat. On top of that, he was incredibily active within the modding scene earlier of 2018, making his own modding team which specifically focused on mania maps in hopes of helping mappers get their maps into the ranked section. Truly, one of most influential mappers that has really left a mark on the mapping and modding scene and we hope to see more of his maps in the near future."},{"username":"dudehacker","userId":748722,"isRookie":"FALSE","commenter":"Maxus","comment":"A renowned member of the community for his hitsounding capability and flexibility to adapt his hitsounds to any instrument present within various type of songs, dudehacker surely doesn't fall short when it comes to charting prowess that extends to any keymode. Although most of his ranked charts are quite simple for lower skilled players and are more focused towards accuracy, he is still capable of mapping even anti-keymodes which is rare in today's ranking which deserves quite a recognition on its own. With the astounding 4 new beatmaps that he ranked in 2018, we can expect an even greater product for him to produce in the future."},{"username":"DustMoon","userId":8580764,"isRookie":"FALSE","commenter":"Unpredictable","comment":"Although they only has 2 guest difficulties in the ranked section, Dustmoon was one of the most active modders between 2017-2018 and continues to map every so often till this day. They often pick japanese based songs or rhythm game based songs to his liking and expresses these songs through interesting and unique maps that they create. He was also an active modder from previous years, making his modding and mapping experience grow with him as a whole. Overall, a mapper and modder we would like to see more of in the upcoming future."},{"username":"Eedow","userId":6670497,"isRookie":"FALSE","commenter":"Unpredictable","comment":"Although they only have a single guest difficulty in ranked, Eedow has been mapping for at least 3 years now and has been continuing to map every so often with their maps in the graveyard or as guest difficulties for other people. They preferably pick rhythm-game based songs or electronic music from japanese artists to convey their mapping through SVs and difficult patterning, making their maps enjoyable, but also challenging. They are always willing to try something new when it comes to mapping and they aren’t afraid of stepping over what they’re comfortable with. Overall, a mapper and player who is well-experienced in the osu!mania community in general and we hope to see of more of them soon."},{"username":"eiri-","userId":3388410,"isRookie":"TRUE","commenter":"Unpredictable","comment":"Although she might be a new face to the mania section during 2018, she’s not a new face to the ranked section as eiri- has dedicated her work to over 150+ beatmaps in the ranked section and is currently still going strong through her many taiko and standard maps. Many people recognize her by her previous alias being Ayyri and before her account change, she was putting maps into the ranked section since mid-2016 and since last year, she was able to push 2 mania maps that showed how capable she is when it comes to mapping other modes she’s not too familiar with. Although both sets showed she wasn’t too experienced with mapping anything with high SR, both showcased some interesting concepts and ideas through her maps with things such as interesting snapping arrangement and LN usage that her made her maps a bit hard than something you might typically expect, but it was also enjoyable as well. With how active she is in the osu! community, we plan to see her produce more content for the ranked section and hopefully for mania as well."},{"username":"Eldergleam","userId":8786907,"isRookie":"TRUE","commenter":"Hydria","comment":"A well known though hidden talent in the community, Eldergleam finally shines through to the ranked section this year with his GD on MEGAtive's Minus 2. Despite it only being of easy difficulty, the repetitive patterning to follow the music alongside the technicality of the continuous column usage shows that this mapper definitely has a lot of potential if they want to try something more daring this year!"},{"username":"Envory","userId":8557462,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"2018 proved to be a very successful year for Envory! He made his first foray into the ranked section with his first ranked set, &Z (TV Size), and his first GD in DoNotMess' Inverse World mapset. &Z focused on dense yet comfortable layering, moving between light LN sections that brought out the song's emotional vocal parts with dense regular note layering for the more intense parts of the song. On the other hand his normal difficulty in Inverse World showed his prowess at creating introductory LN patterns that help players prepare themselves for later difficulties, alternating between standard normal-level sections and fun LN sections that utilized 1/1 and 1/2 LNs. Surely a promising career is ahead for this new ranked mapper."},{"username":"error_exe777","userId":7975796,"isRookie":"FALSE","commenter":"Unpredictable","comment":"While he may have a low rank for mania standards, don’t let that distract you from what he’s really capable of when it comes to mapping as error_exe777 had showcased in 2018 some of the most unique and interesting maps we’ve seen yet in the ranked section. Not only is he extremely well adept in mapping, he is also really experienced in modding as well which also led him to be a Beatmap Nominator last year and promoted maps into the ranked section. To add onto that, he is very knowledgeable when it comes to SVs and experiments with songs from artists that he enjoys such as sakuraburst and KOAN Sound that will leave you stunned once you get a chance to play them. A very talented mapper indeed from his unique song choices and his eccentric mapping style to follow up with it, he’s definitely someone we really hope to see more of in the near future."},{"username":"ExNeko","userId":7590894,"isRookie":"FALSE","commenter":"Hydria","comment":"A relatively well known name in the community, ExNeko managed to rank 2 more sets this year, Horangpungnyuga and Crystal World ~Fracture~. Horangpungnyuga is quite heavily broken JS based, with dense chords filling the gaps in-between, whilst Crystal World ~Fracture~ follows similar structure but goes more into the full on JS aspect of the map, including a few triples in there as well, a sight that will excite most common players to date. With this, we hope to see more from this mapper in the near future!"},{"username":"ExPew","userId":665612,"isRookie":"FALSE","commenter":"Maxus","comment":"A former mania QAT that holds the elite mapper title for his award in winning 2014 mania mapping contest, Expew leans towards patterns that generally are uncommon to be seen, even outside the mapping ranking scene which means that he already has a hold on his own style and his own understanding on what kind of chart he wants to be known for. The layering that he normally uses requires players to learn the muscle memory and reading comprehesiveness that are rarely / never encountered in their previous practice, which makes it even more difficult because it's pretty much the same as re-learning patterns from beginning again. Despite that, his patterns in Glorious Crown flow really well with the instrument and he did a nice job incorporating note density that also following the music intensity, which means that from musical relevance standpoint, his chart does have a high mark and also great amount of creativity to even think of the idea in the first place."},{"username":"eyes","userId":7741797,"isRookie":"FALSE","commenter":"Unpredictable","comment":"Being such a memorable member within the mania community with a name like “eyes”, eyes in 2018 had shed some light on anti-keymode maps, especially with his 8K and 9K map they ranked and even made quite a feat with some maps that had impressive and remarkable SVs usage for ranked and graveyard. eyes typically has a distinct and unique set of song choices to showcase their mapping abilities to the world whether it be through anti-keymodes or SVs or even both, all these show that they have proven themselves as a well-skilled mapper and continue to make something interesting each time through each of their maps. Their song choices usually vary, but the maps that come with it really show interesting, conceptual designs that really showcase eyes’ full capability in what their able to produce. Truly, a distinguishable mapper that has a passion for making mania maps with their SV concepts or anti-keymode mapping, we hope to see more of them and their maps in the future."},{"username":"FadillSan","userId":7006830,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"FadillSan's easy level GD for atian540's MONSTER mapset provides a challenge for beginners by introducing them to consistent 2/1 double usage and simple 1/2 streams. However he has contributed quite a bit more to the mapping world than just one GD. He is an accomplished storyboarder as well, creating the storyboard for the aforementioned MONSTER mapset, Virtue-'s Stray Star map, and 2 more mapsets as well. His storyboards are quite well made with gorgeous particle effects alongside amazing backgrounds with well placed song lyrics. Whether he creates maps or crafts storyboards, his work will continue to be greatly appreciated!"},{"username":"Falcon","userId":3541394,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"A new face to the ranked section, Falcon's first GD was featured in DoNotMess' Inverse World mapset. As a prelude to later difficulties, Falcon helped introduce new players to excellently patterned LNs appropriate to the difficulty level. His balanced approach to this easy diff (and some nicely executed instances of repetition and stack usage) definitely shine through, providing a nice experience for beginners overall."},{"username":"FAMoss","userId":7707789,"isRookie":"TRUE","commenter":"K a b i -","comment":"Widely known as the hitsound god, FAMoss has made himself known throughout the community for his skill and passion on doing hitsounds. There are already over 70 maps that are hitsounded by him by request, while also ranking 3 of his maps this year. One of his maps, Tsukidokei ~ Luna Dial, was even featured in Seasonal Spotlights: Summer 2018 too! The outstanding usage of the positioning of the notes, and the spectacular hitsounds in this map have definitely earned him the spot in the Seasonal Spotlight. He's not done just yet though. We can totally see what's coming next for our hitsound god; obviously, ranking more maps with awesome hitsounds!"},{"username":"Feerum","userId":4815717,"isRookie":"FALSE","commenter":"Raveille","comment":"Despite retiring from all BN and QAT activities in early January 2018, he returned shortly in late March 2018 and has gone full force in the QAT once again! His 2 ranked maps in 2018, EARPHONES - Arakajime Ushinawareta Bokura no Ballad and Jason Hayes - War has shown that he has not ran out of fuel in his mapping career, despite having busy schedules. 2019 will be a big year of Feerum as he continues his QAT role and we hope that he serves his role well!"},{"username":"Fontes","userId":8875919,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Fontes had a small yet noticable impact on the ranked section in 2018 with 2 ranked GDs. One was in Dreamwalker's Lost mapset and featured streamlined patterning along with visually stunning SVs to back it up, providing an exciting yet accessible experience for players interested in more complicated yet approachable SVs. He also provided an extremely approachable GD for [A v a l o n]'s M1917 mapset, which maximized playability to create a fun introductory insane difficulty for intermediate level players"},{"username":"Fresh Chicken","userId":3984370,"isRookie":"FALSE","commenter":"Maxus","comment":"Undoubtedly, Fresh Chicken is one of the most popular charters in the mania community, with his reputation already spread and resided with all the mania players. Although he had to go hiatus from both mapping and BN works because of real life issues, he still managed to rank at least one beatmap in 2018 that still follow his SDVX roots. The highlight of the chart that still follows his previous gimmicks is undoubtedly the coarse SV bumps and 10x teleport which gives his map a memorization and reading challenge for players to figure out in conjunction with lot of other dense handstream and complex LN patterning. Although with his hiatus, he can still provide high quality chart that the community love, and we definitely wish for this expert mapper to be able to return and rank even more challenging and fun beatmaps!"},{"username":"Garalulu","userId":757783,"isRookie":"FALSE","commenter":"Maxus","comment":"Garalulu is, without question, always bring a distinct gimmick which is very special on its own considering that his layering approach often tries to break music boundaries by using excessive amount of patterning that doesn't hold high musical relevancy in general. That being said though, in his \"The Everlasting Guilty Crown\" chart, he is still capable of bringing a combination of layering that uphold good musical layering albeit not as high as other ranked chart in general, which is compensated by the inverse LN releases gimmick that is impossible to get through without experience and expertise in said field due to a very high HP drain. His other ranked chart, GO! GO! MANIAC, has generally decent musical layering to follow, however, due to very high BPM and irregular 1/3 patterning being condensed into a mainly advanced bracket pattern mixing with hefty LN layering, this one is very challenging to even get a pass. With how Garalulu is always bringing interesting concepts to the mania ranked section, it's expected that he will always bring creativity and inspiration for other members of the community as a notable figure."},{"username":"Hanss","userId":4728433,"isRookie":"FALSE","commenter":"Lusty Platypus","comment":"Hanss, previously known as Noxus (and six other names), gave us two beatmaps for the ranked section this year and both of them did not fail to deliver interesting and quality patterning and design. Intro + Dualive by Quarks, a collaboration between Camellia and Kradness is especially interesting of the two being a marathon length beatmap with a lot of tricky SV and LN patterning making it no cakewalk for even the best of the best. We look forward to seeing what comes from Hanss in the future as the innovative and unique mapping style brings with it interesting and high quality maps which we can never have too much of."},{"username":"Hilmi Ghazian","userId":3200342,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Hilmi Ghazian had a pretty nice start to his ranking career in 2018, GDing in 2 ranked mapsets. In Syadow's Zutto set he ran the highest hard difficulty. Here he focused on combining denser 1/2 patterning with simple LNs to follow the beautiful violin parts. However in atian540's The Party We Have Never Seen mapset, his main focus for his hard difficulty was on lighter patterning and mixing in light LN sections with faster 1/4 sections as well as hybrid sections mixing the two styles. We wish him luck in his mapping career and hope to see him next year!"},{"username":"Hlimak","userId":1340272,"isRookie":"TRUE","commenter":"Hydria","comment":"Hlimak, a relatively new mapper to the scene, brings forward a cheerful and perfectly balanced lapfox mapset for ranked, containing exactly 300 long notes and 700 normal notes. Despite being relatively new, his minijack usage and LN length usage show promising signs for this mapper's future career, hoping to see more wonderful sets from them in the future!"},{"username":"HXJ_Crafter","userId":7227507,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"HXJ_Crafter's clean style has proven quite successful this year as he has been featured in 3 ranked mapsets, a strong start for a new mapper. He had 1 hyper GD in Tofu1222's ENERGY SYNERGY MATRIX and NINJA IS DEAD IIDX ver. sets as well as 1 normal GD in _Stan's Dream to Nightmare set. With simple yet logical pattern, his GDs have proven to be quite accessible to players. One GD that stands out in particular is his ESM GD, where he helps introduce players to 1/4 jumpstreams in a flowing, comfortable way. New, accessible works will absolutely be seen in the future from this mapper!"},{"username":"Hydria","userId":808176,"isRookie":"FALSE","commenter":"Raveille","comment":"The man who maps too many, Hydria has been ranking maps consistently since 2016, and added 2 more to his collection in 2018 with olli - i want to tell you i love you but i can't (ft. tomppabeats) and M2U - A Bella! (feat. Lucy), the former having interesting SV usage and the latter having intriguing LN vocal mapping. It will be exciting to see where Hydria takes his mapping style to next!"},{"username":"Ibrahim","userId":2899823,"isRookie":"FALSE","commenter":"Maxus","comment":"Trying to rank charts as early as 2016, Ibrahim started to climb his way up with HoneyWorks as his artist preference as showed by first 4 maps he ranked, and he still continued, even in 2018. He started to rank his charts again around late june where he successfully ranked 2 beatmaps which comes from movie and anime. The patterning is mostly simplistic and yet have some uncomfortable sections that might seem like a challenge for accuracy players. However, his success mainly comes from his song choices that are quite straightforward with mapper intentions of having the target audience mainly be casual players that play beatmaps for the song they like and play together in multiplayer."},{"username":"Ichigaki","userId":2403444,"isRookie":"FALSE","commenter":"Maxus","comment":"Ichigaki is a former mania BN that has a ton of experience mapping instrumental music and has developed a huge understanding in using deliberate rythm choices that captivate players the most in the upper level difficulty. His charts truly shine when he mapped something around insane level which many also consider it as his main forte. Other than simply mapping on his own, he also works well in collaborating with people in a way where the chart transition flows well without feeling forced, which means that he also shows a compassion and humbleness to adapt his style according to other charter as shown in his collab GD in Glorious Crown. Truly an inspirational mapper that deserves his spotlight more often."},{"username":"Ilham","userId":3057154,"isRookie":"FALSE","commenter":"Maxus","comment":"Ilham is a well known o2i3 mapper that is still active charting songs from his favourite artist, consistently gaining quite a high amount of exposure from the community overall. Especially in 2018, Ilham still inherit his previous charting style with a little bit of a twist, which is an addition of couple SV that's quite soft and readable to made it more engaging and fun to play for the players but, also at the same time, to enhance the musical relevancy furthermore. The amount of anticipation that community waits from him is obvious based on the amount of favourites his maps get alone, already proof that he is becoming one of the more upstanding community members in mania."},{"username":"infilect","userId":10063786,"isRookie":"TRUE","commenter":"qqqant","comment":"Early in the year, infilect ranked Lifetheory's Daisy, a fairly well-known song in the mania community. infilect managed to capture the simplicity and beauty of the song in their set, which makes the map adored by many, from those first starting the game to top accuracy players looking for another map to SS."},{"username":"Insp1r3","userId":7131254,"isRookie":"TRUE","commenter":"qqqant","comment":"Insp1r3 hit the mapping scene with a daring first set of Mazare Party, containing both 4K and 6K sets that go up to beyond 5 stars. With guest difficulties by Chilly-, Cokiiplay, Asherz007, booty, and jakads, the entire set definitely did not disappoint, gaining an insane amount of popularity among beginner players all the way up to 6K 7* players. In November, with a guest difficulty by Jesuren, Insp1r3 came back with another set, Black Lotus, a 4K set that many have also enjoyed. We hope that Insp1r3 will be back with more daring mapsets in the future."},{"username":"Jakads","userId":259972,"isRookie":"FALSE","commenter":"K a b i -","comment":"Who wouldn't know this beast of a man? It is none other than the Mr.NumberOne himself. He came back into the ranked scene early this year by giving us a couple of mapsets, with one of them being an anti-meta keymode. Jakads is known for his outstanding skill in high level maps, as well as an unconventional approach to mapping. His maps usually features different style of creative patterning. From streams, jacks, LNs, bursts, which complements the music itself nicely. Also, his obsession to PP has led him into making maps that what people would call as \"PP map\". That being said, the maps themselves are not exactly easy as it seems, as only fairly experienced players can nail down his maps. We will be looking forward as to what surprises that he will give us in the near future."},{"username":"Janko","userId":2424823,"isRookie":"FALSE","commenter":"Unpredictable","comment":"Janko, being one of the older members of the osu!mania community, has generally been producing 4K maps over the course of their mania career and last year had really showcased their mapping capabilities through the ranked section with a 5K guest difficulty and a jumpstream-based 4K map that had caught everyone’s attention. Since mid-2015, Janko has been producing multiple mapsets, showing how not only how he’s grown as a player, but as a mapper as well and how his concepts on different maps really has taken shape over time. They generally pick different genres of music to convey multiple concepts, whether it be pattern-based or SV-based, they always create something new and innovating through their maps for everyone to enjoy. From his active presence in the mapping community, we hope to see more of them and their maps soon."},{"username":"Jesuren","userId":7516567,"isRookie":"FALSE","commenter":"Hydria","comment":"Jesuren showed promise this year with his ranked maps, mainly with the aptly named YUKINOFUNK, a map with a sick beat and an amazing map to follow, containing a mix of broken jumpstream along with a flurry of LNs and the occasional minijack, showing great promise for this mapper's future works, hopefully to which we can see in GDs relatively soon!"},{"username":"K a b i -","userId":6209713,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"A new prodigy of LN musicality, K a b i -, aka the \"kamome sano mapper\", had a strong first year as a ranked mapper with two fantastic LN-oriented mapsets: one for the beautifully flowing and aptly named </emotional>, and one for the upbeat yet slightly bittersweet citrus. Both maps rely on fluidly patterned, excellently emphasized LNs that perfectly represent the intensity of each section he maps. His ability to maximize quieter sections cannot be ignored, as his talent to use addictive patterns to draw out the full potential of simpler melodies makes his maps even more enjoyable. His proficiency has only increased over time as his 4k maps are getting more and more polished, and his lesser-known talent for making incredibly complicated yet gorgeous 7k LN oriented maps is being honed over time. Truely a mapper that any LN enthusiast can enjoy!"},{"username":"Kaito-kun","userId":4715184,"isRookie":"FALSE","commenter":"Maxus","comment":"Being well known for his handstream ranked map, aldnoah zero, Kaito-kun is a long time mania modding member that already established himself since the early days of mania. Preferring the style that makes the most out of player's enjoyment and being generous with it, his humbleness shows not only from the way he charts but from the way he mods, forming a more throughout conversation with the mapper in regards of respecting others style. Most of his GDs, including the one that ranked this year, more focused on lower difficulties because of his intention to give a softer introduction chart for beginners whilst still featuring more prominent mapping ideas such as pitch relevancy."},{"username":"Kamikaze","userId":2124783,"isRookie":"FALSE","commenter":"qqqant","comment":"In September, Kamikaze ranked Theme of Miki Sayaka (best girl by the way), a heavily emotional throwback to his first map ranked in 2015, titled Theme of Puella Magi. One of the most well-established 8K mappers in the community, Kamikaze has never ceased to impress players and mappers alike with his mapping in many keymodes."},{"username":"Kawawa","userId":4647754,"isRookie":"FALSE","commenter":"Maxus","comment":"Being one of the longest mania BN in history and also one of the most influential charter in the 7K department, Kawawa consistantly brings fresh high level content that keeps top players on their toes whenever they play it. His capability extends from charting songs with the hefty amount of timing like Ongaku Resolve, to making full LN chordstream beatmaps such as smiling. Both charts have a different style that separately defines the maps entity in general, however, the solid and profounding structure with clean concepts that gradually make the chart harder the longer it goes are still giving a distinct mapper's identity with its own persona, which in turn gives a noticeably different vibe that is immediately noticed by either fellow mappers or players. The quality charts that Kawawa brings into the ranked section have never been dissapointing and always hold a certain high standard with a high expectation for other charters to take example of, and we certainly hope that he keeps carrying his content for mania community!"},{"username":"kaythen","userId":5782153,"isRookie":"FALSE","commenter":"Maxus","comment":"Kaythen is a relatively new mapper in the mania ranked section and yet actually experienced enough to hold his own by ranking the most rare anti meta keymodes in mania history, 9K. In 2017, Kaythen partook in the ranking section by joining hannanos' mapset with a GD, however, his 2018 map is the first time he actually ranked a map on his own and a nonetheless full version of the song which is 4+ minutes, featuring some piano keysound as an additional touch. The effort put into the set is extremely phenomenal and ranking 9K is a very courageous thing to attempt, considering the fact that it's his very first ranked chart and the song itself features complex instruments that needs to be mapped comprehensively. Yet, after all of his valiant effort, it finally reached it's goal while still upholding the high standard that the community expected from it. Truly an outstanding accomplishment that deserves even more attention from the entire community."},{"username":"KeppSado","userId":11085809,"isRookie":"TRUE","commenter":"K a b i -","comment":"Early in the year, rapid improvement is not an exaggerated way to describe the TV size maniac as KeppSado has finally made his debut into the ranked scene after going through hardships in mapping, of course with the guidance from experienced mappers around him. His maps mostly featuring light layering and structure to make it widely accessible to all kinds of players with different skill level. Newcomers would definitely find themselves enjoying his maps. Lately, he has been trying to integrate more Long Notes into his maps to express the music itself in a different way. We hope to see the TV Size maniac ranking more maps in the future!"},{"username":"keziah","userId":2653667,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Keziah might be new to the ranked section with his 2 mania GDs for Sakary's Dahil Sa'Yo mapset, but he already had a skillset that allowed his difficulties to shine. Besides being beginner-friendly and featuring fitting patterns for the upbeat song, his difficulties utilized gorgeous percussion-based hitsounds and beautiful keysounds that made things even more enjoyable for players wanting a calming experience"},{"username":"Kuo Kyoka","userId":2596306,"isRookie":"FALSE","commenter":"Maxus","comment":"Kuo Kyoka is one of the oldest mania mapping and modding members of the community, with having one of the largest GD count spread across the ranked section, along with a huge amount of mapsets he ranked on his own. He is probably one of the most versalite and adapting type of charters which reflects the amount of experience and knowledge he accumulated for the time he spent in the editor. From the list of charts that he ranked in 2018 alone, each one of them has its own theme that distinctly separates it from another. For example, \"Reason of being\", a chart that implements a lot of jacks in the middle of streams mixed with bursts as the main theme of the map, and later, \"Mach Sigma\", a 7K map with tricky LN holds along with simple brackets to accomodate the map even further. The third one, \"Stasis\", implements SV which is inspired from the original Lanota game, having a lot of harsh bumps but calculated in a way that the next pattern are predictable to read, and the last one, Glorious Crown, having both a 4K and 7K spread, a massive mapset that Kuo Kyoka had already been working on for a long time until he finally ranked it at December. With the amount of diversity he promotes in the mania ranking scene, we sure hope that Kuo Kyoka will bring even more masterpieces in 2019!"},{"username":"Lastopia","userId":6786004,"isRookie":"TRUE","commenter":"Unpredictable","comment":"Lastopia is currently an active mapper who is constantly looking to improve in both Standard and Mania by testing new concepts that come to mind. Being more experienced with mania in general, he's known for aiming to make something unique and creative. He’s very persistent at improving his mapping capabilities and isn’t afraid to try something new, whether it be SVs or pattern-based maps, he’s always making a difference with his motivation when it comes to mapping. WIth this being said, we hope to see more of Lastopia and his maps in the near future."},{"username":"laughingcomet","userId":3432877,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"In contrast to his intense SV mapset in 2017, laughingcomet returned in 2018 with a beautifully slower-paced yet intense hard GD for Mat's Yume Tourou set. He proves his versatile skillset by mapping out complex LNs to fully express the flowing guitar melody, and fluidly transitions into tougher 1/2 and 1/4 patterns to capture the powerful percussion. laughingcomet's ability to adapt to the songs he maps will definitely be appreciated in the future!"},{"username":"Lenfried-","userId":5314573,"isRookie":"FALSE","commenter":"Maxus","comment":"Back in the last couple years, Lenfried- often focused more on ranking 7K charts, being relatively difficult and dense for expert players. However, specifically for this year, he brings to the game a completely different style by mapping a simple 2 E icon chart with an added twist that is simple and yet very effective at the same time in the last difficulty, and that is a teleport SV which completely relies on player memorization based on the vocal cue and hints that essentially teach the player how to hit the keys. It's something that the community has never seen before in the ranked section and yet got a completely positive reception based on the fact that it's not daunting at all, even for relatively novice players, once they understand the correlation of the song with the incorporated concept. With the relatively vast experience that Lenfried- already accumulated over quite a long period of mapping, it's certainly exciting to see his potential map concepts that he will show in the future!"},{"username":"liaoxingyao","userId":3620963,"isRookie":"FALSE","commenter":"Hydria","comment":"liaoxingyao, a mapper ranging from the start of mania, presents us with another ranked chart this year to add to their collection despite it being a sparse year for them. Their mapset, YUKARI, features adventurous jacks as well as some solid LN usage and some daring anchor based patterning, making for a relatively challenging but still overall enjoyable experience for the players. We hope to carry this mapper's career on another year and see another set hit ranked very soon!"},{"username":"Lude","userId":6974536,"isRookie":"FALSE","commenter":"Maxus","comment":"Lude is one of the mappers with the most rapid improvement in the community, starting from ranking anime maps back in 2016 to now being able to show prowess and versality to whatever type of song he charts, along with the types of patterning he puts into it. In 2018 he managed to rank 3 beatmaps that all have different personas and distinct gimmicks compared to each other. The first one is \"Hoshi o Kakeru Adventure\", a map where he creates a gradually harder section that optimally captures the song's nature and hidden message while slipping some stacking 1/4 LNs that are relatively difficult given the song's high BPM to begin with. His second chart is Chroma - I, which implements a similar concept but happens in a much earlier part of the song, where it features a lot of short LN streams along with the burst and dense chords accompanying it before the chorus. As for kiai part, the section uses a full 1/3 inverse LN along with the outro part using complex chordjack mixed with the 1/6 mixed-in with 1/12 burst that have stutter SV as the final touch. His final ranked map of the year is \"Bassline! Yatteru? w\" where the chart focuses more on comfortable SV bump and teleports alongside with hefty LN usage that's relatively comfortable given the low BPM of the song, showing mapper awareness to actually make use of the song's nature to his advantage. The amount of creativity and desire to keep trying something new is really respectful and deserves complete anticipation for each of his future charts."},{"username":"MadBricktree","userId":4790958,"isRookie":"TRUE","commenter":"Raveille","comment":"A mapper and modder for the past 4 years, MadBricktree, formerly known as Minseo2000, finally got his first ranked mapset in late 2018 with AXION, a map that is very LN heavy and focused, sprinkled with a couple of SVs and difficult jack patterning. With his deep experience of modding and experimental mapping, he will definitely want to start to make a name for himself as a ranked mapper."},{"username":"Madoka2574","userId":8819336,"isRookie":"TRUE","commenter":"Hydria","comment":"Whilst Madoka isn't a new mapper by far, it is their first successful attempt at ranking a map, and whilst Taketori Hishou has a simplistic tone to it, it's an enjoyable experience for all, focusing on what players are most comfortable with as the map includes broken dense jumpstream with the occasional easy LN to hit, definitely one for players to grind out in the future!"},{"username":"Mage","userId":5527957,"isRookie":"FALSE","commenter":"Lusty Platypus","comment":"Mage is quite well known in the community for their tendency towards LN style mapping which can be seen quite well in their recent loved addition, Hommarju's Rock It, a highly energetic and accessible LN themed beatmap. On the ranked side, however, Mage showcased their prowess in the uncommon realm of 6K with ParagonX9's Chaoz Japan, featuring a lot of stream based patterning and also packing guest difficulties from semyon422 and Myle on the Normal and Hard difficulties respectively."},{"username":"MapleSyrup-","userId":1192936,"isRookie":"FALSE","commenter":"Maxus","comment":"MapleSyrup- is a new face in the mapping & ranking community, and yet that fact doesn't really show from the decent quality charts that he made which shows his long time experience in the VSRG field. His latest ranked beatmap features a high-tech style that is relatively out of meta given the usual sequential chord stairs that is more popular in the realm of 7K charters. The chart makes the full use the technicality of minijack patterning at the beginning along with abnormal amount of LN lengths that requires full preparation and readiness from the player to be able to discern and anticipate to be able to nail the section. Overall, a really intriguing concept that is polished enough to bring a unqiue challenge to the scene."},{"username":"Mat","userId":2668921,"isRookie":"FALSE","commenter":"Lusty Platypus","comment":"Perhaps best known for the dynamic duo of Kurokotei's Galaxy Collapse and DJ Myosuke & Noizenecio's Architecture, Mat's latest ranked set takes a different approach from the realm of somebody screaming in Yume Tourou by RADWIMPS. Showcasing some interesting 1/6 snapped flams in the starfall difficulty that distinguishes and adds character to the beatmap, quite a refreshing patterning that doesn't impact the structure in a major way while still adding quality to the map. Definitely much more accessible to a beginner compared to Mat's more infamous submissions, and the guest difficulties from snexe and LaughingComet definitely showcase interesting structure and allow for everyone to experience this beautiful song."},{"username":"Maxus","userId":4335785,"isRookie":"FALSE","commenter":"Raveille","comment":"Occupied with his QAT work, Maxus unfortunately was not able to rank a set in 2018, but has contributed to 2 mapsets with his guest difficulties. Maxus has been working non-stop as a recently promoted QAT member, and despite all that, he was still able to help his peers in their mapsets on O2i3 - Capitalism Cannon and HoneyWorks meets TrySail - Senpai. [MOVIE Ver.]. 2019 looks to be an even bigger year for Maxus, and we look forward to see if, this time round, he would be able to rank a new mapset!"},{"username":"MEGAtive","userId":3094101,"isRookie":"FALSE","commenter":"Maxus","comment":"MEGAtive is a senior charter that has a lot of experience in the editor with a great understanding of the skill required to incorporate complex patterns in the exact right moment and it shows in his recent ranked mania map. His odin chart, at first glance, looks like an usual handstream chart. However, there are a lot of pattern twists that cause it to not be a walk in the park to play. For instance, the usage of one hand trills being slipped in with the jumpstreams, testing finger versatility to keep it steady and consistent. Moreover, there are also the implementation of short burst along with a longer burst that cannot be spammed or jumptrilled to be approximated, making it a lot more difficult, especially considering that this is a marathon map to begin with. There are also the additional usage of continuous minijack patterns along with some LN section that spice things off even further. The notorious knowledge and the flawless execution to understand this really makes him the charter to watch for and a good example for a novice mapper."},{"username":"Mentholzzz","userId":7182779,"isRookie":"TRUE","commenter":"Raveille","comment":"Hard work, determination and dedication was what Mentholzzz showed in 2018, with his first ever ranked map ONIGIRI FREEWAY, which was selected to be part of the March & April Beatmap Spotlights, coupled with his first Loved map Parodia Sonatina -Grande-. He may have gone inactive throughout the 2nd half of 2018, but his efforts are definitely noted by his peers, and maybe that might influence other new mappers too!"},{"username":"Modren","userId":1828621,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Starring in 2 9k difficulties in Janko's In my room mapset, Modren unleashed the short song's potential to the fullest, creating 2 beautiful difficulties that bring out the instrumental piece's gorgeous held violin notes and echoey synths. He also created a massive set that was Loved in 2018, mapping out every single piece in the Kickmaster soundtrack, providing a nostalgic experience for fans of the game and something for just about every 9k player. However his talents cannot be fully explained by one GD and one set alone. Anti-meta mappers are few and far between these days and Modren has proven to be one of the most dedicated 9k mappers in osu!mania's history, producing a multitude of high quality 9k sets inside and outside of the ranked section for all difficulty levels. The content he contributes to the community is exceptionally unique and his passion for 9k is incredibly admirable."},{"username":"Moskas","userId":1934077,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Moskas, a talented 4k player and frequent mapper, made his first appearance in the ranked section in Janko's Equinox set, providing a well-made lower-level difficulty that allows players to have a fun introduction to the intense psytrance track. Featuring simple 1/1 patterning that transitions into 1/1 bursts, the difficulty eventually shows off challenging 1/1 LN usage before ending on tough 1/2 bursts and frequent doubles, providing newer players interesting in moving from easy to normal difficulties a wikedly interesting trial. Make sure to check out his other maps as well, as he makes content that is enjoyable for 4k players of all skill levels!"},{"username":"MrDorian","userId":1559983,"isRookie":"FALSE","commenter":"Hydria","comment":"MrDorian shows his face once more in the ranked section this year, after his success with furioso melodia, he goes for a more relaxing pop tune this time around, in an unorthodox 5K keymode. Whilst unknown to most due to it's keymode, the map features a enjoyable variable density jumpstream technique which I personally believe makes this map one of the most underrated for this year. We hope to see more spicy sets from Dorian this year!"},{"username":"Muu-chan","userId":4818155,"isRookie":"FALSE","commenter":"Maxus","comment":"Muu-chan is one of the older members of the mania ranking community that is quite famous for some of his insane MX GDs scattered across various number of mappers, quite popular amongst players, as well as being played in multiplayer a lot in its era. He likes to do conventional pattern that are quite underlayered but being effective in its own way, which is the source of his popularity. We can see from his GD in the hybrid std sets where the patterns he uses are simple but he has altered it in a way that it's not that easy to breeze through for accuracy player. He did open modding queue in the past and being part of community that helps each other in improving together in building more effective knowledge and targeting a high quality enough map for ranked."},{"username":"my angel yayoi","userId":3878832,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Formerly known as nika mika, my angel yayoi is a standard and taiko player who was able to rank their first mania GD in Tofu1222's STEP by STEP UP set, creating a normal difficulty that turned out quite clean and polished for a newer mania mapper. The difficulty represents the upbeat song well, using comfortable patterning to give players a relaxing experience playing the map. A good first start like this can only be a good thing for the aspiring mania mapper, and there's no doubt that they will create more cozy content in the future!"},{"username":"Myle","userId":4915649,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Myle is an extremely proficient CTB player who was not only able to rank 2 CTB maps in 2018, but also a hard-level 6k mania difficulty for Mage's Chaoz Japan mapset. The difficulty itself features fast-paced 1/4 streams, complex 1/3 patterns with doubles and triples as well as exciting 1/4 triplets later on, showing his innate talent for mapping an anti-meta keymode even though most of his mapping experience comes from another game mode. We can't wait to see more of this excellent multi-mode mapper's content!"},{"username":"Nixeria-sama","userId":6045757,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Though he only contributed one ranked GD in 2018 for DoNotMess' Ouka Ryouran set, Nixeria-sama definitely made it count. The normal level GD helps prepare players for later difficulties since it quickly propels players into intense 1/2 streams and ends with a slightly LN based section for the kiai. A well crafted-difficulty from a well-rounded mapper!"},{"username":"Nysrogh","userId":2520208,"isRookie":"TRUE","commenter":"Hydria","comment":"Someone I've had personal enjoyment working with in the past, and someone mostly known for their classic english pop tunes, Nysrogh finally makes a full showing in the ranked section this year with Mama, a hybrid 4K/7K set containing 5 GDs in classic Nysrogh style. His own maps in this set are enjoyable to play, keeping it simplistic with note placements with the occasional splash of LNs, aiming for player enjoyment than most. Hopefully we can see more of their sets ranked in the near future!"},{"username":"Ochasan","userId":6037359,"isRookie":"TRUE","commenter":"Hydria","comment":"A very new mapper to this scene, Ochasan begins their ranked journey with a simple but enjoyable easy GD on Draftnell's Jounetsu Utopia. With a strong focus on melody and vocals, the map uses mostly 1/1 notes in a variety of patterns with the occasional 1/2 burst (including doubles) to add a bit of spice to the mix. On top of that, the chart has good anchor usage alongside perfect LN+note combos, making this a wonderful experience for a new mapper, hoping to see a lot more from them in the future!"},{"username":"Oktawia","userId":1955107,"isRookie":"TRUE","commenter":"Hydria","comment":"A fairly rare sight to see, Oktawia manages to enter the ranked section this year, regarding all norms by having an 8K GD on Janko's \"In my room\". Despite it being an easy, it features wonderful broken stair patterns, similar to easy BMS charting, making it a good start for new players to branch out to other keymodes as they get used to the higher number of buttons. Along with some regular stair patterns, the map has a decent pitch following, giving it all the more reason to deserve being ranked. We hope to see a lot more from this mapper in the future!"},{"username":"pocket-Gao","userId":3162182,"isRookie":"FALSE","commenter":"Maxus","comment":"Being quite notorious for his 7K+1 chart that he previously ranked, Pocket-Gao comes back with fighting force, trying to rank the same keymode. Usually having the scratch button being combined with another type of chord to hit is a lot more difficult than just hitting ordinary chords in 7K even for more experienced players. However, his map doesn't felt awkward to play despite being a relatively high difficulty map and is suitable for 7K players to be given a basic learning curve on how to press the scratch button correctly, consistently. The smoothness and pattern flow that he executed even earned him a spot in loved section, although he finally still tried to push it for rank, which is an even more deserved place for his chart after all his effort."},{"username":"pporse","userId":4991434,"isRookie":"FALSE","commenter":"Maxus","comment":"pporse ranked one of his GDs in 2018 which is Hoshi ga Furanai Machi. The GD is considered one of the primary maps for many top players to DT due to its simplistic nature that is intended to build up the patterning from easy early on to being much more difficult later on, being based on the amount of LN layering that gets harsher and denser the longer the song goes on. Although he isn't that famous in the mania community, his charting quality and build-up primary style are one to be respected even outside of the mania community, especially seeing his previous ranked works, some of which have reached loved."},{"username":"Protastic101","userId":6712747,"isRookie":"FALSE","commenter":"Maxus","comment":"A QAT member that is well known for her past contribution and dilligentness of modding and ranking a lot of charts before, Protastic101 decides to go back to her roots and the anti-meta keymodes that she already mapped since her beginning. Her Sonder chart features an extremely harsh SV bump with a bit of stutter to accomodate it even further. To make the map more accessible for a broader range of players, she decided to make the overall pattern more simplistic to hit so that the gimmick completely focused on the SV. The amount of calculation she put into making the SVs work comfortably is worthy of recognizition."},{"username":"puxtu","userId":3070611,"isRookie":"FALSE","commenter":"Unpredictable","comment":"A name we’re all too familiar with, puxtu has been producing content for osu!mania since 2014 and is still doing so with maps that specifically focused on genres that pertain to japanese rock, american rock, and extremely well-known vocaloid maps that they have stuck with the osu!mania community for quite some time now. Last year, puxtu was a on a big push on hybrid sets, whether it be taiko or standard, they are always bringing something new to the ranked section through their maps whilst providing something new for other modes as well. They are also known for making lots of guest difficulties that include interesting, well-thought out concepts that will leave people on the edge of their seat with their challenging, yet enjoyable maps. Knowing how long puxtu has been with the osu!mania community, we expect to see more of them and their maps in the near future."},{"username":"pwhk","userId":4887865,"isRookie":"FALSE","commenter":"Maxus","comment":"Known for his tendency to chart something that is complex and out of the usual meta for the 7K playerbase, pwhk broadened his ideas even more this year by charting 7K+1 instead which brings his technicality to a whole other level compared to his previous map. The amount of dense 1/3 chordjack combined with scratch jacks made it an extreme challenge even for top players to hit properly. Moreover, there are a lot of sections which have unorthodox snap stream changes along with some bursts that ultimately need a lot of training to Full Combo the map. The map's nature being unpredictable along with pwhk's style of making maps complex brings a new incentive for top players to replay the chart multiple times for the sake of top score."},{"username":"qqqant","userId":8976576,"isRookie":"TRUE","commenter":"Unpredictable","comment":"Famous for some of his early works, qqqant is a prominent player and mapper in the osu!mania community that strives to to make a difference through his presence and mapping. He’s always looking to constantly improve and learn from other mappers that may influence him and apply their concepts through his own and doing so, created some of his most aspired and creative maps that really shows how well-versed and talented he really is. He’s also always willing to help improve other maps and provide feedback on maps going for rank which shows how much of a difference he’s really trying to make for the ranked section. Knowing him, we expect his presence in the mania community to grow even more so than it already has and we expect to see more maps of his in the near future."},{"username":"Raveille","userId":1388767,"isRookie":"FALSE","commenter":"qqqant","comment":"A prominent figure in the tournament mapping community, Raveille has been generally known for his difficult release maps in tournaments such as MWC. 2018 was a great year for Raveille in terms of ranking maps, as he got one marathon ranked in April 2018, two GDs in riunosk's sets, and one mania set in a hybrid by -Aqua. Raveille had been trying to rank Aitakatta Sora for almost a year, and his persistence for ranking the map with its complex snapping and other issues should inspire other mappers not to stop trying because of a few problems. Similarly, the hybrid set, This game by Roselia, was known as the map that was disqualified multiple times (five to be exact), but that did not stop the mappers in the set, including Raveille, to push it forward continuously."},{"username":"Reba","userId":3087654,"isRookie":"FALSE","commenter":"Maxus","comment":"Constantly refining his mapping technique and diversity to open up more possibility in charting difficult maps, Reba managed to rank a map that's considered his most difficult map to date. The map's difficulty mostly comes from the usage of dense chordstream with a couple long bursts that mostly appear in the first half of the song, while the second half part of the song features a lot more bracket chordstream mixed with some of the more elaborate LN patterning. The difficulty spread this map has is also very linear and provides an extremely good learning curve for beginner to expert players, which is quite rare, definitely in extremely difficult map spreads. Overall, the insight and mapping style that Reba contributes within the community is an eye-opening and a good experience for most charters to learn from."},{"username":"richardfeder","userId":2446000,"isRookie":"FALSE","commenter":"Maxus","comment":"Already ranking his maps as early as 2013, richardfeder is one of the oldest members that helped shape the community until the way it is now. Mapping songs that mostly come from VN and doing it within the pace that he prefer is the proof that he mostly charting for fun and doesn't really aim for popularity in the first place. He is considered a respected mapping member that primarily focused around 2014, developing a style that is tricky and challenging due to the amount of bracket that he puts within the chordstream and some other patterns that require intense amount of muscle memory to perfect. For example, in his GD in Glorious Crown this year, richardfeder utilizes a numerous number of patterns that isn't easy even for more skilled players, and yet it's actually done with the intention of putting maximum output on musical emphasis and structural patterning instead of playability, a truly inspirational senior member with a name truly not forgotten!"},{"username":"rinaldi28","userId":6472510,"isRookie":"TRUE","commenter":"Unpredictable","comment":"A pretty rare sight in the mapping community, rinaldi28 has been making maps for over 3 years now and last year they were finally able to rank one of their maps into the ranked section. Although he might be new to the ranked section, their first ranked map proves their mapping capabilities otherwise and really shows how much they knows through interesting, and intricate layering techniques. On top of this, they have also shown that their well-capable of mapping anti-keymodes as well, showing how knowledge and how flexible they are when it comes to mapping into an unfamiliar keymode for them. With this being said though, we hope to see more of them and their work in the future."},{"username":"Rinzler","userId":2133381,"isRookie":"FALSE","commenter":"Hydria","comment":"An old name in this community these days, Rinzler decides to revive one of their old maps for 2018's ranked section. The marathon, Nirvana(Camellia's \"BinaryHeaven\" Remix), features comfortable broken JS patterning with LN chords throughout, though does contain a few spicy uncommon bursts inside as well to catch the weary off-guard. We hope to see more maps from Rinzler in the ranked section pretty soon!"},{"username":"riunosk","userId":5594381,"isRookie":"FALSE","commenter":"Raveille","comment":"As an active mapper and modder, riunosk has definitely not stopped ranking maps after the end of 2017. His perseverence has led him to 2 new ranked maps, Heaven's Fall and Sweet Dreams (11t dnb mix), and he is looking to add another to his collection with United (L.A.O.S Remix). Placing 3rd in the Most Promising category in MCA 2017, he is definitely showing why he was placed that high up, and all eyes will be on his next map!"},{"username":"Rivals_7","userId":4610379,"isRookie":"FALSE","commenter":"Hydria","comment":"A very known mapper in the community and long standing BN, Rivals_7 hits up the ranked section with another map this year. Souzetsu Gekkou features a little mix of everything, from small LN pattering, to light JS, to chords, to anchors, hand-based patterns and even a little bit of SV, this map truly encompases all that is possible in just the space of 100 seconds. We hope to see more wonderful sets from this mapper in the future!"},{"username":"Rizqy","userId":1411817,"isRookie":"FALSE","commenter":"Maxus","comment":"Rizqy is one of the former mania BNs that started his mapping career by mapping fhana's songs, which was considered his favourite artist at that time. From there, he started to move to mapping more instrumental songs to build a better understanding on incorporating more complicated layering choices. As shown in his collab GD in Glorious Crown, Rizqy put up a decent chart with pattern designs that take into consideration his collab partner, leading the entire difficulty to be played naturally without an awkwardness cause of differing styles. His style can be considered one of the smoothest in terms of pattern flow and musical relevance due to his strict mapping conduct, focusing within the song's realm and never trying to force the amount of layering to be denser than necessary, a style which is appreciated and should be taken as example for many other charters."},{"username":"Salty Mermaid","userId":9037365,"isRookie":"TRUE","commenter":"qqqant","comment":"The ultimate legend Salty Mermaid entered the ranking section with Dream Catcher. With enjoyable trilly patterns, occasional jacks, and SVs that complement the song fairly well, the map has become quite well known and loved by many players. Despite the nomination history, Salty Mermaid did not hesitate once, finally ranking it in October, calling an end to the wild ride of ranking his first map. We can all learn from Salty Mermaid, in that we should never give up, even when all odds are against you."},{"username":"Sandalphon","userId":2633753,"isRookie":"FALSE","commenter":"Maxus","comment":"Sandalphon (alias YaHao) managed to rank a mind-blowing 6 ranked mania maps in 2018, which is the second highest ranked collection of the year just right after Tofu1222. One of the notable traits from the maps that he ranked is the fact that it's varied in terms of keymodes. They contain the entire keymode range from 4 key until 7 key which is respectable considering most mappers usually only focus on the keymodes that they feel comfortable with. Essentially, Sandalphon isn't afraid to do something new and even controversial at one point, and keeps moving forward mapping passionately. The amount of contributions he's made from the mapping and modding side are delightful to look at."},{"username":"semyon422","userId":4695318,"isRookie":"TRUE","commenter":"Hydria","comment":"A decently old mapper at this point, semyon422 finally reaches the ranked section this year with anti-meta keymodes, scoring a GD on Mage's 6K \"Chaoz Japan\" as well as eyes' 8K \"Yume Tourou\". Mapping everything as pitch perfect as can be, semyon shows with their burst stream patterning mixed in between their normal 1/2 notes that they have the skills and experience to make good quality charts and to stand out above the rest, even if both of these are just normals. We hope to see more of their charts (and hopefully harder ones) in the near future!"},{"username":"Shad0w1and","userId":798668,"isRookie":"TRUE","commenter":"Hydria","comment":"Shad0w1and, mostly known for being a std mapper, dips into the mania ranked section this year with Colourful., a simplistic yet enjoyable chart, a good place to start for any newcomer, and we hope to see more charts from them in the future!"},{"username":"Shoegazer","userId":2520707,"isRookie":"FALSE","commenter":"Maxus","comment":"As one of the most influential figures, not only in mania community but also in terms of 4K VSRG in general, Shoegazer has made a lot of articles that he wrote by himself, expressing the sheer amount of knowledge that he accumulated for the amount of time he plays the genre. The subjects that he's brought up covers a wide area of subjects that teaches people from various kinds of aspect, mostly talking about charting tutorials, charting layering and assesment of what makes a chart good quality in the first place. There were also other kind of topics as well that had been brought up as well that are focusing more from a player's aspect such as pattern mindblock, skillset improvement, and also how mental health affects the performance, which gives more insight on how to combat the obstacle that commonly occurs in the middle of a player's learning curve. The contribution that he brought to the community also carries a weight for the better good of the community, such as his mentorship to some of other charters out there, the constant participation in the mania RC updating, and also in the mania tournament scene which he happened to be the main coordinator of 4K MWC, writing up the article analysis regarding each country level of skillset and the possible rank place for each of them. In addition to that, there are also the fact that he managed the loved project as the captain not that long ago, which he coordinated everything there. Regarding his charting style, Shoegazer usually took an approach which he able to encapsulate the rythm nuance to its utmost, mainly have a lighter density with a rigid structure but patterned in a way that it requires a specific skillset that players don't usually get from their usual chart, which is why his charts are, most of the time, tricky and uncomfortable to play, but are perfect training regiment to boost player's skill rapidly and more efficient from a time management aspect. He is also known for utilising and pioneering chord allocation, where charters would use different kinds of chords to distinguish different sounds in the music, to which a lot of people have copied into their own style. In his current 2018 ranked charts, the patterning is generally on the comfortable side to play as a whole, but still retain the solid pattern structure characteristics that he put as his main focus. He has ended up with a decent amount of charts in loved, which is proof of the amount of support that he has gotten from the community. The various amount of things that he's already contributed to the community deserves massive respect and gratitude for the efforts that he already worked on for such a long time."},{"username":"Side","userId":3442339,"isRookie":"FALSE","commenter":"Hydria","comment":"Side, a name not completely unknown in the mania scene, takes another shot at mania charting this year with the gritty sounding Showdown. Whilst his difficulty is aimed at newer players, it flows well and has all the characteristics for a potential shining mania star in the future. Hopefully we can see him trying more daring things in the upcoming future!"},{"username":"Sinnoh","userId":4236057,"isRookie":"FALSE","commenter":"Raveille","comment":"A mapper, modder, and BN of both osu!catch and osu!mania, Sinnoh had a much more impressive start to his 2018 ranked map collection with forest of the spirits, an incredible combination of LN, SV, storyboarding and interesting hitsounding, completing the package. As the new year approaches, he looks more interested in mapping than ever before."},{"username":"SitekX","userId":3840946,"isRookie":"TRUE","commenter":"Hydria","comment":"A fairly old mapper by today's standards, SitekX gives the ranked section a shot this year with GDs on both \"In my room\" and \"Fascination MAXX\". His 9K Insane on \"In my room\" features a mix of slow 1/2 doublestreams alongside some nice flowing 1/4 single streams, the intro definitely proving to be the hardest section of the song. His 7K \"Standard\" diff on \"Fascination MAXX\" however features a lot more LNs to really emphasise the synths in the track, patterning similar to beginner BMS charts though still managing to squeeze in those same slow 1/2 doublestreams as are present in \"In my room\". As a mapper that definitely focuses on hand balance the most in these higher key charts, we hope to see more from them in the future!"},{"username":"snexe","userId":7093198,"isRookie":"TRUE","commenter":"qqqant","comment":"This year, snexe ranked a single Normal guest difficulty on Mat's set of Yume Tourou, a song from popular Japanese film Kimi no Na wa. A known unranked mapper, snexe has mapped many tournament-geared maps in the past year. It is a nice surprise that snexe ranked a guest difficulty, and we hope that he will rank more in the future."},{"username":"SolaceXCIX","userId":4871877,"isRookie":"TRUE","commenter":"Hydria","comment":"An apparently new mapper entering the ranked scene, SolaceXCIX manages to get their foot into the door with an Easy diff on \"The Distance\", taking on the world of 9K despite this being their first map. The map focuses on general doubles with occasional singles to spice up the snapping, a tight focus on PR, as well as patterns similar to easy BMS charts. Overall this is an enjoyable experience for newcomers to the world of 9K and we hope to see more from them in the future!"},{"username":"Soul Evans","userId":4490770,"isRookie":"FALSE","commenter":"Hydria","comment":"Elite Mapper Soul Evans takes a break this year with only pushing GDs for ranked, namely a hyper in Sandalphon's Dotabata Animation. This mid-range diff contains speed-oriented broken streams, a few LNs here and there, alongside a dangerous light jumpstream pattern in the first climax of the song. We hope to possibly see more ranked maps from them in the future!"},{"username":"SpectorDG","userId":4477451,"isRookie":"FALSE","commenter":"Maxus","comment":"With ranked sets as far back as 2015, SpectorDG is a long standing figure in the mania mapping community. They continue their tendency towards difficult beatmaps this year, ranking Yooh's \"Road To The LegenD\", a marathon length song showcasing a plethora of tricky minijacks, chords alongside LN layering to top it off, proving difficult for many. SpectorDG also made an appearance as a guest difficulty in Tofu1222's set, \"ENERGY SYNERGY MATRIX\" by Tanchiky, as well as creating SV for Tofu1222's set \"Wowie Zowie!\" by Hommarju"},{"username":"Spy","userId":1217122,"isRookie":"FALSE","commenter":"Hydria","comment":"Despite being absent for most of the year, Spy still left their mark on the ranked section once more with GDs on invoker. Invoker uses technical light JS patterning along with precise chord placements to create an experience which is challenging to users, but still fair in it's difficulty overall, very reminisicent of old-style mapping. Hopefully we can see some more from them in the future!"},{"username":"SurfChu85","userId":4469895,"isRookie":"TRUE","commenter":"Raveille","comment":"A prominent figure in the osu!mania tournament scene, SurfChu85 finally had his first stepping stone into the Ranked section with his 7K map Kikoemasu ka feat. Haruki <Youshouki> (CV: Koinu), which was used in the osu!mania 7K World Cup 2018 Group Stage Mappool. A mapper of different types, he will take that confidence into 2019 proudly and hopefully dish out some more great mapsets!"},{"username":"Surono","userId":3611370,"isRookie":"FALSE","commenter":"Maxus","comment":"Surono, being originally a taiko BN and mapper, ventures to the keymodes he's unfamiliar with, rapidly improving over the course of a couple years. Although his approach to his recent ranked mania maps are taking a more convential pattern, he did justice to the song by having synths layered with a more LN-based patterning which is common in his previously older ranked beatmaps. With the amount of potential he has in both modes, we sure hope that he will give more shots to mania and rank more of his charts!"},{"username":"Syadow-","userId":3484485,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Syadow-'s 2018 was quite busy in mania with 6 ranked GDs and 2 ranked sets. At this point Syadow-'s experience in making lower level difficulties is quite well known and surely has an impact on beginners getting into the game, since quality in low-level difficulties is essensial in order to retain players. He's also started to branch out this year into making higher level maps, especially in his unranked sets. Since Syadow- is continuing to perfect his lower level difficulties and is progressing in his ability to create higher level difficuities, 2019 should prove to be another great year for him. (also sya o/)"},{"username":"tailsdk","userId":6751666,"isRookie":"TRUE","commenter":"Raveille","comment":"tailsdk was a very quiet and absent figure in 2017, but 2 new ranked maps, Tze-Chiang and Finixe, saw him spring into the mapping scene gracefully this year. With his many collaborations with countless mappers and his ability to map different styles, his open-mindedness is a strong asset to help him push further this year, and he will take as many chances as he can for the new year."},{"username":"tatatat","userId":6107943,"isRookie":"TRUE","commenter":"qqqant","comment":"tatatat, a known member of the taiko community, ranked three mania-related mapsets this year. Though there have been an amount of concern shown for these Easy-only mapsets, tatatat is likely not going to stop anytime soon, which makes him technically one of the most powerful people in the community."},{"username":"TheNewBungping","userId":6291395,"isRookie":"TRUE","commenter":"Hydria","comment":"A popular name in the mania scene, TheNewBungPing manages to push one of his sets for ranked this year. Iwanai kedo ne. is an interesting mapset with constantly changing snaps which they have made work with their comfortable-style patterning, making this an enjoyable experience for most. We hope to see more daring and challenging this from this mapper in the future!"},{"username":"Tidek","userId":743282,"isRookie":"FALSE","commenter":"Hydria","comment":"Mostly known for his outrageous SV charts, Tidek decides to hit the ranked section this year with a couple of GDs in Janko's \"In my room\". The higher of the two 6K diffs features quite dense brackets layered throughout, LNs braking up the monotony as well as adding another layer of difficulty to the map. The lower diff contains broken 1/2 streams mixed in with a few lighter brackets and hand-based doubles throughout. A clear signs of a BMS player who we hope to see more of in the near future!"},{"username":"Toaph Daddy","userId":7616811,"isRookie":"TRUE","commenter":"qqqant","comment":"Better known as TheToaphster, he’s an extremely talented, high-ranked, and a seasoned veteran as a player and mapper in the osu!mania community and he continues to show his strong presence through tournaments, the ranked section, and even the loved section. Last year, he was able to show off some of his maps in the ranked section that include intricate layering and SVs that are incredibly well-made, making him one of the most versatile, yet complex mappers we have seen yet in a very long time. With that being said, he’s also very active within the Loved section with him being a captain which allows him to help push creative and extremely well-made mania maps into a brighter spotlight, making him one of the most active people pushing for quality content still today. With all of this being said, we plan to see more of him through tournaments, his maps, and the Loved section."},{"username":"Tofu1222","userId":6089608,"isRookie":"FALSE","commenter":"-MysticEyes","comment":"Tofu1222's impact on the 2018 mapping scene was overwhelming to say the least, with a whopping 9 ranked mania mapsets! All of them come with unique and interesting styles ranging from beginner-friendly TV Size sets to fast-paced jumpstreams and challenging jack-oriented maps suitable for higher-level play. His experience in making taiko mapsets as well as his increasing mastery in creating mania mapsets have allowed him to cement himself as an impressive mapping force in multiple communities."},{"username":"Trainer-","userId":9331760,"isRookie":"TRUE","commenter":"qqqant","comment":"In 2018, Trainer- has had one ranked guest difficulty, a 7K Easy on SurfChu85's set of Kikoemasu ka, which has a diverse set of difficulties. Trainer's difficulty in particular uses LNs to clearly emphasize important rhythms in the song. It well represents the song and also introduces long notes to beginner players very well. We hope to see more maps from them in the future."},{"username":"Turrim","userId":3846265,"isRookie":"TRUE","commenter":"Maxus","comment":"Turrim is another newcomer that hits the mapping ranked section with an already refined concept and splendid work that shows his experience in the gamemode. He has noticeable traits of layering the map with an LN based style, and his current ranked maps always seem structured in a way where the first half kiai is a lot easier and easy to breeze through compared with the second kiai where the difficulty curve is much higher, and is usually the main show of the map. His style is tech based, where he mostly uses chord bracketstream that get extended not only in the regular stream, but even in the 1/4 LN stream at the final part as well. Although Turrim has to on hiatus for now because of his korean military duty, we sure hope that he will come back bringing more spectacular charts to ranked soon."},{"username":"Umo-","userId":8228043,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"With his hard GD in atian540's MONSTER set, Umo- created a fun and accessible experience for players looking to start out with denser patterns in a hard diff. His talents extend beyond 4k though since he has experience mapping a variety of different types of 7k maps for a variety of different difficulty levels. He even has the rare talent of mapping 9k difficulties! He is a mapper who can appeal to any kind of player, and absolutely is a mapper to watch out for next year."},{"username":"Unpredictable","userId":7560872,"isRookie":"TRUE","commenter":"Maxus","comment":"Appearing in the mapping scene as of early 2018, Unpredictable shows a big passion and enthusiasm in the mania scene by having multiple mapping projects on his own and joining some other projects as part of the staff. The amount of potential and sheer improvement that he shows over the course of a year is the one to watch for considering the fact that he managed to immediately become BN as of June 2018, after only participating in the modding scene for a couple months which is a huge achievement on its own. The contributions that he shows in 2018 is only the beginning of massive things that we can expect to see in the future, and we're gonna see a lot more to come!"},{"username":"Verniy_Chan","userId":4428053,"isRookie":"FALSE","commenter":"Maxus","comment":"Being one of the notable mappers in his era, Verniy_Chan is well known for their tendency to map LiSA songs, which boost his popularity and the amount of people that plays his map to the point where he even won the 2nd place for Community Choice 2016. He was also a notable diverse modder that opened his own queue that also accepting other kind of request such as Background editing, video and mp3 encoding, HS request, etc. He ranked one of his GD this year in Skyreach map, which utilizes his well known convenient style that having simple and yet effective layering."},{"username":"Virtue-","userId":6144772,"isRookie":"FALSE","commenter":"K a b i -","comment":"Virtue- is undoubtedly one of the most notable mappers and modders throughout the past few years. The man himself has given a lot of contributions to the mapping community by actively modding and mapping at the same time. He also did numerous GDs for other mapsets, and several ranked maps of his own. Marathons are definitely his preferred choice of mapping, as 5 out of his 6 maps are exactly that. The maps themselves are also well structured, with various patterning and mixed note / pattern usage, what we would call an all-rounded map, which is most definitely enjoyed by those who love diversities in maps. After ranking two maps in this year, Virtue- had go on a hiatus, but hopefully he will be returning to here again soon!"},{"username":"Wadu","userId":8787387,"isRookie":"FALSE","commenter":"qqqant","comment":"Wadu, previously known as CHARGE, charged into 2018 with Cycle Hit and trappola bewitching. Both maps were met with generally well reception, both having specialist approaches to their respective songs and unique SVs. Wadu displayed persistence and hard work while ranking these sets, as they were certainly not easy to rank. Somewhere, somehow, we hope he will come back to show the community more of his mapsets."},{"username":"Wilben_Chan","userId":6659363,"isRookie":"TRUE","commenter":"-MysticEyes","comment":"Wilben_Chan, an incredibly talented multi-key player, made his first appearance in ranked in a hard diff for ExNeko's Horangpungnyuga mapset. His difficulty starts out with simple LN patterning and comfortable 1/4 grace notes, and then transitions to aesthetically pleasing 1/4 streams and triplets before finally ending with his effective LN layering scheme. Hopefully we will see more of his maps in 2019!"},{"username":"Wonki","userId":7898495,"isRookie":"FALSE","commenter":"Maxus","comment":"Wonki, being a former winner of MCA 2017, once again participates in the mania rank scene by specifically ranking marathon maps as of 2018. Usually we know him from his tendency to rank SV based charts that boost his popularity due to comfortable patterning and a high amount of enjoyment that rarely appear from the usual gimmick maps. This time he comes out trying to do something a bit more different by ranking 7K charts instead, which is something that we never heard from him. Despite him rarely mapping this keymode before, the result that he produced in the end is quite impressive, looking at the amount of variation and solid structure that he put within the map. The possibility of him ranking even more mindblowing charts is endless and we are surely hoping for even more from him in the future."}]