[{"username":"komasy","userId":1980256,"isRookie":"FALSE","commenter":"-Kazu-","comment":"As he is one of the most experienced mappers from Japan, you can easily find yourself not being able to find a single bad komasy map given that his style and execution truly are among the best added to the fact that he has really ranked a lot of guest diffs and mapsets of his own. I have personally enjoyed a lot his huge repertoire of maps, specially one of the last ranked maps of 2018, Touhou Youyoumu ULTIMATE MEDLEY. If you're looking for some really fun maps to have a good time, komasy is very likely one of your best bets."},{"username":"Skull Kid","userId":3044264,"isRookie":"FALSE","commenter":"-Kazu-","comment":"Having previously proven his worth as a mapper in the later years with maps like Fast Paced Society and Reality Check Through The Skull, this year he made his return in full force with his set Whatever I Do and one of the most liked maps of the last quarter of 2018, XINOBIKILL. He really is quite good at making enjoyable maps and definitely holds one of my favourite maps of the entire year."},{"username":"Kbludoh","userId":2543764,"isRookie":"TRUE","commenter":"-Kazu-","comment":"Kbludoh might be one of the lesser known names from the Brazilian community. But this year, he gave us one of the most interesting maps of the year, Venetian Snares - She Runs. He has an interesting approach to mapping that shows in his works very prominently, either by his patterning choices or his musical taste. This year brought us many newcomers to the mapping scene and I certainly hope to see more of Kbludoh's work."},{"username":"Coryn","userId":2828556,"isRookie":"TRUE","commenter":"-Kazu-","comment":"One of if not the friendliest member of the Brazilian community as I can't even think of somebody that could not get along with this individual. This year they gave us only a map, LOrbSheddy - The Grand Trek, a simple and practical map that shows how they focus on giving a good playing experience rather than striving for becoming an unique mapper or getting glory for making difficult maps. I personally enjoy his mapping style a lot and his concepts are quite fun to play so I'm totally rooting for more Coryn maps this 2019."},{"username":"HiroK","userId":4050738,"isRookie":"TRUE","commenter":"-Kazu-","comment":"Probably the biggest name in the Brazilian community right now, HiroK is either well known as an extremely skilled player or as a mapper that makes really fun maps. Whether it's his contributions to other people's sets like in Inverse World or XINOBIKILL, or his own maps GRiDGALAXY and specially Sulfide, he really is living proof that the Brazilian community has a lot of potential within their ranks and that he truly is a mapper we should all look forward to more of his creations."},{"username":"Ulqui","userId":1263669,"isRookie":"TRUE","commenter":"-Kazu-","comment":"Talking about Ulqui here is a rather odd exercise for me to do. Starting by his mapping, he has done TONS of good maps I enjoy playing everyday and that I always end up playing as warmups or simply because I wanna beat them, but then you see he barely has any ranked maps... I mean, yeah, #sawg is one of those maps most people will mention in their top 10 and is truly a cool experience, so in this regard I truly hope to see more of this rising star mapper. He's most known for being a beast of a player, being insanely accurate and great at reading, with Hidden being his main modifier and truly a force to be reckoned with but he is also one of the friendliest members of this community and I definitely see him getting along with anybody that wishes to talk with him."},{"username":"vrnl","userId":4799788,"isRookie":"TRUE","commenter":"-Kazu-","comment":"This mapper right here has grown exponentially this year and has really shown a lot of potential. Even though he has tripped onto a few obstacles in his mapping career, he has truly learned from his past mistakes and made a great mapper out of himself, not to mention that he has mapped something which happens to be my favourite map of 2018: Loctek - Oldskool. Keep a close eye on him, as he is probably one of the most promising mappers of the year."},{"username":"Stefan","userId":626907,"isRookie":"FALSE","commenter":"-Kazu-","comment":"You can truly see how good of an artist Stefan is by how he structures his maps. He is definitely one of the most helpful members of the community too and I'm extremely glad to have shared some time with him as he really is a cool guy, which he often also shows through his mapping and his rather peculiar song choice, ranging from the most happy, memeish songs to rather serious or even dark songs. I hope we get to see more of his works this 2019 and that he finally reaches the glory as a mapper that I whole-heartedly believe he deserves."},{"username":"Yumyum-","userId":2036503,"isRookie":"TRUE","commenter":"-Kazu-","comment":"Yumyum- is one of the many mappers that went unnoticed this year with only one ranked map. You can see how she is very positive and hard working on learning the gamemode and rest assured we will always welcome new mappers trying to dive into the taiko world. Keep a close eye on her as she will for sure keep becoming better and better."},{"username":"Backfire","userId":263110,"isRookie":"FALSE","commenter":"-Kazu-","comment":"Stranger to no one at this point, Backfire is one of the most well-known mappers and one of the most liked in the community. His improvisation-focused style and heavy SV creations have been a staple for most of us and all-time classics. This year we received only a map from his part, sadly, although a really popular one: Slash Dot has been in the mouths of everybody for a really long time due to it being both a catchy song and a really difficult map (being the most highly rated for a while, too). He does show why he is so popular on his creations and although he barely got maps ranked this year (mostly due to his services in the Loved community and running tournaments) you can always expect high quality maps from his part."},{"username":"mancuso_JM_","userId":521568,"isRookie":"FALSE","commenter":"-Kazu-","comment":"One of the oldest mappers in the community, mancuso_JM_ has been there for most of us for a really long time, being an admirable and friendly BN (BAT, back in the day) while also doing nice creations by himself. In 2018 we only got a single map from him,  Owl City - Kiss Me Babe, It's Christmas Time (although it got ranked in March...), a map that shows his minimalistic view in mapping and that follows the music beautifully. In late 2018 he quit BNG and hasn't been around in a long time, so wherever he is now I truly wish him the best on his future endeavors."},{"username":"KamizonoShinobu","userId":1163051,"isRookie":"FALSE","commenter":"-Kazu-","comment":"Even though he quit in late 2018 due to saddening circumstances, KamizonoShinobu (a.k.a Chocola_2287) is one of my favourite mappers and even though he only brought idol games/anime sets this year, he left a lot of half-baked projects in the oven, with absolute bangers like Valgus, DEADHEAT or TOXIC VIBRATION. His leaving is a huge loss for the community as he is easily one of the most talented mappers out there and a really good player too."},{"username":"[_Chichinya_]","userId":2140739,"isRookie":"FALSE","commenter":"-Kazu-","comment":"Chichinya is the kind of guy who shines in positivism and cheers up everybody around him and I think most of us can agree on that and even admire him for it. He is also a really one of the most grindy mappers, as he has done a lot of maps throughout the year, even though he only managed to rank one. Parodia Sonatina is truly a beautiful map that I felt was worth pushing towards ranking (even though it costed everything to get ranked) and a quite exquisite experience from a mapper that is still trying to establish himself as one of the most known, truly a masterpiece and something you should really go ahead and play."},{"username":"Etsu","userId":3442319,"isRookie":"TRUE","commenter":"-Kazu-","comment":"Although his participation in the ranked section was fleeting and has been barely active since then, I had the chance to meet Etsu and his struggle: He has been trying to become an active part of the modding/mapping community for quite a long time and has been wanting to become a BN for a while too. His \"Yoko Shimomura - It's a Small World\" set really brings back memories of those days where both of us were waiting for the BN results and although he never got the chance to help the community in a bigger way, I'm pretty sure he will reach his goal and help in the Beatmap Nomination once he gets back on track. Good luck ♥"},{"username":"Kqrth","userId":4115718,"isRookie":"TRUE","commenter":"-Kazu-","comment":"Even though he often times ends up being pointed out as the most controversial member of the Brazilian taiko community and one of those who always steps into drama, he has shown his worth in the ranked section this year with his two gems, Myoujin Henka and #sawg, two maps with a lot of personality into them that truly came to tell us all that we don't need to lose an eye to have all the games and fun we want!"},{"username":"Tofu1222","userId":6089608,"isRookie":"TRUE","commenter":"-Kazu-","comment":"Tofu1222 is, while known as a prominent mapper and BN from the mania scene, a name we have seen in the taiko ranked section more than a just a few times. His mapping is very clean and has a considerable variety of genres, ranging from the most cheerful anime songs to the wobbly Camellia songs. Although he mostly does Inner Oni or Oni diffs, he has also shown capable of mapping good lower diffs and that is always something you have to thank a mapper for, specially one as friendly as Tofu1222."},{"username":"yuki_momoiro722","userId":7186791,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"The \"One Room Anime Series Maniac Mapper\" this year, Yuki momoiro provided us with his 3 mapsets of the One Room Anime Series. But not only that, he also provided us with his 1 Filipino Language based song's GDs and 2 other Anime mapsets. Even though he's still in young age, it's a great achievment for him this year that he got 6 Ranked Mapset in total. I Hope he can improve himself with other great mapsets in the next year!"},{"username":"[R]","userId":3577322,"isRookie":"FALSE","commenter":"Alwaysyukaz","comment":"Being known as a mapper with solid structure in each of his Guest Difficulties, [R] a.k.a Ron provides us with his interesting eroge and Japanese songs this year. Something different from the previous years is that he pushed songs that are the first time for him like Ryu* feat. moimoi - OOO into the Ranked Section. So he has proven to us that he also wants to tried something new this year."},{"username":"Blackener","userId":3662737,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"Blackener is a fairly new mapper in taiko. Even though he's still new in taiko he has proven to us that he's not a \"Common Rookie\". He got 3 GDs ranked and brought his mother language based song as his first ranked mapset to the ranked section this year. And I'd like to say he's the mapper that brings a good potential in both of taiko mapping and modding. Can't wait to see his progress in the next year!"},{"username":"Dellvangel","userId":5186244,"isRookie":"FALSE","commenter":"Alwaysyukaz","comment":"Dellvangel is more known as a Osu!Mania Beatmap Nominator than Taiko Mapper, but never judge a person from their cover! He marked this year with his anime mapset \"Wagamama MIRROR HEART\". So he has proven himself to us that he also has good knowledge in the Taiko gamemode and I'd like to see his progress in Taiko Mapping for the next year!."},{"username":"Fleure De Lapin","userId":5569341,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"Fleure De Lapin a.k.a. Franklin_DeJavu is more known as a Guest Difficulty creator rather than as a mapper himself. But believe it or not, he pushed his 2 mapsets to the Ranked Section this year which means that he is actually \"A Half Rookie\" and only needs a little more polish to become a great mapper in the future!"},{"username":"rew0825","userId":2488026,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"rew is actually more active in osu!catch, but he's not a new face in taiko since he got his first ranked Guest Dfficulty in 2015. And he's been more active than previous years to make a bunch of Guest Difficulties in taiko. His most outstanding mapset is \"PUNCH*MIND*HAPPINESS\", in which he proves himself to us that he's a more than capable mapper, and marks this year as the beginning of his taiko career!"},{"username":"Smallwu","userId":2512120,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"Smallwu is a mapper known due to his love of cute songs. However, in 2018 he pushed himself to get a full beamapset to rank with \"Ray - Kimi to Ita Sora\" which is a 4-minute song, which is rare to see for rookie mapper. So, that's an impressive achievement for his first step in 2018. I'd like to see his progression in 2019"},{"username":"-GN Junior","userId":3901754,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"A person who is also known as \"The One Room Anime Series Maniac Mapper\", -GN Junior marked the end of 2018 with a doublet of \"Harumachi Clover\" mapsets, and another anime mapset which is really interesting to see. His mapping skills improved substantially from October until December, which is proven with his streak of three ranked maps in three months! That's insanely fast for a person who's fairly new in the taiko community. Can't wait to see his progress in the next year, by the way!"},{"username":"jacky10186","userId":3167864,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"Jacky is a fairly new mapper that has ranked one anime mapset \"Machico - Korekara\" at the end of 2018 with the help of his Hong Kong friends (Faputa, Sing, and -GN Junior). Finally, he's proven that he can provide good mapsets to the ranked section. Can't wait to see his progression in 2019!"},{"username":"igorsprite","userId":7047319,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"igorsprite is a fairly new mapper that has ranked 1 anime mapset \"Silent Siren - LOVE no Shirushi\" in early 2018. Both his modding and mapping skills are actually growing pretty rapidly, and for your information, he also began 2019 with a new ranked mapset! Hope I can see more from him ranked in 2019."},{"username":"Karee Pan","userId":7514582,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"Karee Pan is a fairy new taiko mapper that has one anime mapset \"Fillin - Mayoi ga Ongaku ni Awasete Araragi-san no Namae o Yobu Douga\" in early 2018 and one Muzukashii Guest Difficulty in \"Team Hanayamata - Hana wa Odore ya Irohaniho\" in late 2018. Looking at his progression in 2018, I hope he can prove himself worthy with other good mapsets in 2019!"},{"username":"Hitsu","userId":1273290,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"Hitsu is a fairly new member in the taiko community who got initiated with \"nano - PARALAYZE:D\" as his first ranked mapset in 2018. Even if he's still new, that doesn't mean that he is bad in the slightest. He tries very hard and never gives up in order to push his maps to rank and also never lets his mapping spirit falter. I can see his good effort through this map and of course, I can't wait to see his mapping spirit in 2019!"},{"username":"realy0_","userId":8863359,"isRookie":"TRUE","commenter":"Alwaysyukaz","comment":"realy0_ is a mapper that is known for making lots of calm or slow anime beatmaps, especially for the standard mode. However, I'm suprised that an electronic song was the first choice to get a ranked map in taiko. Whenever I see his modding profile, I reach the conclusion that both his mapping and modding skills are growing quite rapidly this year. Fun fact is, he got his first ranked beatmap at the end of 2018. Can't wait to see his mapping progress in 2019!"},{"username":"Poii","userId":7924938,"isRookie":"FALSE","commenter":"BabySnakes","comment":"Poii is a fairly new member of the mapping community. After only ranking one map in 2017, they showed determination in improving and mapping more, gaining a lot of experience through mapping and participating in the community mentorship program. Poii focuses mainly on the Kantan-Oni range, delivering entertaining maps to beginners and intermediate players while occasionally mapping some quality Inner Oni difficulties. This year Poii ranked a lot of new maps, most of them being slow anime/jpop songs. 2019 will be a big year to either leave a big footprint on easier maps or explore harder difficulties and letting their name be known by more experienced players."},{"username":"strickluke","userId":6226745,"isRookie":"FALSE","commenter":"BabySnakes","comment":"strickluke is a fairly unknown mapper. They map standard and mainly taiko, having ranked 3 mapsets in total: one tech and two low BPM (one of which was ranked in 2018). It's sad strickluke hasn't dedicated more time to improve his mapping and push more things to ranked since he has some fun experimental maps and excellent collabs sitting in his graveyard. All their ranked mapsets have great ratings and if they managed to pump out more quality maps into the public's eyes, they'd definitely be more well known amongst the community."},{"username":"JarvisGaming","userId":8601048,"isRookie":"TRUE","commenter":"BabySnakes","comment":"Possibly known for his many taiko maps/mods and/or dodge the beatmaps, JarvisGaming has yet to set a mark on the ranked scene. While their currently ranked maps are quite tame, they can handle from high bpm difficult maps to sv technical maps with perfection. JarvisGaming's skill truly shows, especially after their huge catalogue of mods and maps. It's a shame they've only started ranking maps in 2018. On the other hand, I'm quite hopeful as Jarvis has already ranked a map in 2019, where the high diff maps at tho? Like seriously, your graveyard is filled with so much effort it hurts."},{"username":"Aisha","userId":2192669,"isRookie":"FALSE","commenter":"Backfire","comment":"Former BN perhaps better known as \"Frac\" had a slightly inactive year (partially due to a restriction), but still managed to scrape by and rank 2 very nice maps. His mapping style is peculiar, focusing on more of almost you could say an \"old\" style of mapping, where the difficulty does not go much higher than 5 stars. He also seems to prefer even numbered patterns to odds, which is a very different choice than most mappers! Aisha is also well known for his tournaments, one of which this year was \"DonKat 2.0\" which was a very popular taiko tournament featuring 2v2 matches, before TWC started doing it!"},{"username":"Sansheng","userId":3579473,"isRookie":"TRUE","commenter":"Backfire","comment":"Sansheng is a pretty underrated, and overlooked mapper. Their single map ranked this year is \"epimerization\" is a map which is flawless in the SV execution, and is one of the most impressively emotive and life-filled maps I have played in the year. I would say I hope this blurb gets some of you to try it, and hopefully to encourage Sansheng to rank more maps because he surely has potential to be one of our bests!"},{"username":"zigizigiefe","userId":2463434,"isRookie":"FALSE","commenter":"Backfire","comment":"The \"other\" Turkish taiko mapper, ranking this year the sequel \"Monosugoi Satori Gear\" to his popular 2017 map \"Monosugoi Space Shuttle\", zigi also shows a surprising amount of appreciation for Spanish music as well from his Mago de Oz maps! His mapping style has grown more and more over the last couple years and he has aquired a respectable name for himself."},{"username":"Alchyr","userId":4993032,"isRookie":"TRUE","commenter":"Backfire","comment":"The formless, speechless entity known only as \"Alchyr\". What can I say? They have employed a style of mapping and promise for their future that is nigh unmatched in the community. They only managed to rank a single map this year, \"Hysteresis\", but most know them for 2 things in particular. For one, they have made a great contribution to the community in the form of the new pp proposition, and for the other, they have also made a ton of impressive and challenging maps that have been appreciated by top Players and Mappers alike. I can't wait for them to rank more challenging maps in the future and help shape the meta in 2019. Look out for them!"},{"username":"Nishizumi","userId":2496768,"isRookie":"FALSE","commenter":"Backfire","comment":"The King of the Meta, Nishizumi didn't make any groundbreaking maps compared to previous years which had him shaping our mapping meta as it currently has continued to be, but he provided us with at least one extreme challenge once again with \"Destroyer\". I would consider Nishizumi to be a prime example of a mapper who continues to keep his name in the air and proving himself to not be a one-trick pony in terms of content and style!"},{"username":"eiri-","userId":3388410,"isRookie":"FALSE","commenter":"Backfire","comment":"Though possibly known more these days for her standard sets recently, eiri-'s work ethic and contributions to the taiko mode have been gigantic and historically saturating. Her amount of maps ranked in this amount of time far outweighs any other mapper, and there are gems among her catalogue such as \"Accept your fate now\" and \"Anoko no Jinta\" that deserve to be truly respected among the best maps of the year! I have watched her grow as a mapper over the years and truly believe she is one of the most valuable mappers we have in the game today, setting a good standard to look up to for new mappers."},{"username":"Lno","userId":1900787,"isRookie":"TRUE","commenter":"Greenshell","comment":"When I hear the name Lno, I think of a mappool selector, but more importantly of a mapper who hasn't been around in the ranked section too much, but provided players who like to search for gems among the graveyard with insanely fun maps, be it due to fancy slider velocities, unusual concepts or just challenging maps in general. His addition to the ranked section in the form of \"Beat Saber\", while not aimed towards these extremes, is still a nice 'n enjoyable set and shows that they're proficient at mapping all difficulty levels, not just the highest ones. With that said, if you haven't already, go give their catalogue of graved maps a try, as there certainly are aforementioned gems among them, but also their ranked mapset, of course!"},{"username":"Oui","userId":5538419,"isRookie":"TRUE","commenter":"Greenshell","comment":"Oui, being one of the many mappers making their debut in the ranked section this year, may be one of those that went by rather unnoticed, but should definitely not be overlooked because of that! His mapset of Renard - Feel Better is a damn nice short mapset clocking in at a pretty high BPM and shows that he certainly is no slouch at mapping. As with many other rookies, I can't wait to see what our Swiss rookie can bring to us in the future!"},{"username":"Fallmorph","userId":5720389,"isRookie":"FALSE","commenter":"Greenshell","comment":"Fallmorph already made their first appearance in 2017, and while not being present in the ranked section too much, his map of Enantiomorphs, being one of the Camellia songs finding their way into the ranked section, shows impressively well-constructed Slider Velocity usage in a rather gimmicky way, as well as tricky, tech-focused patterns that will make for a challenge even for the best accuracy players! To me they've established themselves as a damn proficient gimmicky-oriented mapper by usage of uncommon SV, and that makes me want to see more of this promising mapper!"},{"username":"Kin","userId":480689,"isRookie":"FALSE","commenter":"Greenshell","comment":"Ah, yes, my gool ol' mentor Kin. What can I say about him? He's the one who got me into mentorship and the mapping community as a whole, really. A guy who isn't around on osu! a lot these days, one who does things slow and steady. Also a fun dude to talk to and share memes with :^). Kin has been around for quite a while, ranking a bunch of the so-called \"pp maps\" ever since 2017, as well as being a BN since then, but got unfortunately kicked in late 2018 due to inactivity. That aside, he only ranked a single map this year \"Camellia feat. Nanahira - We Love Hardcore\", but it sure has made a name for itself! \"Chinese - simplified\" was my first impression of it, but it does its job at emphasizing the song quite well in the end. I hope he gets back to the game someday, he's a good soul. Thank you for getting me into the mapping community and for more, Kin."},{"username":"Zetera","userId":587737,"isRookie":"FALSE","commenter":"Greenshell","comment":"Hallo lieber Wirt, mach mir den Bierkrug voll, ganz randvoll, so ist's toll! Even if Wirtshaus Gaudi is the only Taiko map Zetera ranked this year, he still has a whole load of difficult maps in his graveyard just waiting to be played! His signature Majin Oni series consists of both aforementioned difficult and/or gimmicky (and sometimes just meme) maps, lots of them being mapped to a variety songs one would consider unusual on this game, but also more common rhythm game songs. If you're looking for different kinds of maps, Zetera is your man! PS: Shoutouts to SimpleFlips"},{"username":"ASPIRIN","userId":6487115,"isRookie":"FALSE","commenter":"Greenshell","comment":"ASPIRIN has made their debut in late 2017 with Diao ye zong feat. Meramipop's Saifu \"Kamiasobi no Uta\", which I personally really liked, and kept going in 2018 with two maps easily keeping up to the first one, with Karakurenai being an amazing and tastefully designed set showing the mapper's effort across five difficulties, as well as Kourou ~ Eastern Dream, which is honestly a masterpiece in itself. If you haven't played the map already, I strongly recommend you to change that, as the map takes you on a journey through 10 minutes of a rather calm-natured, soothing yet progressive Demetori song, covering all of the song's ups and downs beautifully. ASPIRIN really has proven to me to be a mapper with great potential, and I'd love to see more from them. Keep it up!"},{"username":"GoldenWolf","userId":1612624,"isRookie":"FALSE","commenter":"Greenshell","comment":"☆DE★ME☆TO★RI☆. What else can I say except this? There's no way you could not possibly associate him with Demetori, and he clearly shows his passion for the artist as a mapper, ranking almost exclusively Demetori maps, like his \"Kamisabita Kosenjou ~ Suwa Foughten Field\". Even though he's mostly known amongst the osu!standard base, he did crank out this map for o!taiko, and as someone who's been testplaying a lot of his maps and generally overwatching his progress, I can confidently say that he's got quite the potential to be one of my personal favorite mappers amongst Taiko, if only he'd get back to it and actually rank stuff, which may partially come from bias towards his song choice, but also his understanding of emphasis and pattern consistency make him a special flake to me, being one of the few mappers to shine despite not actively playing the mode."},{"username":"Ak1o","userId":1600041,"isRookie":"TRUE","commenter":"Greenshell","comment":"A new face to the ranked section and a cool dude, Ak1o, having been mentored by Chromoxx, applied the knowledge and passed it on to his maps, which turn out to be quite fun with beautiful flow, like his mapsets of BassTest, a pretty technical set across the board, and Ice Angel, a streamy consistency challenge. As someone who's been involved in the modding process of both maps, I'm looking forward to seeing more maps from him in the future!"},{"username":"Raiden","userId":2239480,"isRookie":"FALSE","commenter":"Greenshell","comment":"Along with fruko, one of the mappers I immediately associate with metal when I hear his name, Raiden still holds a big role in the game, even if not as active as other members due to studies. A really chill guy, great mapper and fellow red panda lover (seriously red pandas are so cute). On a different note, despite his real life duties he's still working hard behind the scenes, partaking in the o!taiko Ranking Criteria, managing things in the Spotlights Team and obviously doing the QAT work. When it comes to ranking maps this year, he went a little outside of his known metal zone and ranked quite technical maps with \"Transport -Extended Mix-\" and \"Passage D\", of which the latter has made a name for itself in the TWC Finals. Anyway, both of these maps are absolute masterpieces and definitely two of my favorite maps of 2018, and I'm looking forward to whatever else he's providing to the ranked section in the future!"},{"username":"DarkVortex","userId":1940325,"isRookie":"FALSE","commenter":"Greenshell","comment":"Don't let the number of his ranked maps fool you, because DarkVortex certainly carries more experience into his maps than you'd think! Not the most active mapper around, he still provided us with a masterpiece in the form of \"Daedalus\" by S.S.H., an amazing mapset to an amazing song making for a challenge of the different kind, which was even featured in the TWC 2018! I highly recommend to check out his catalogue of graveyarded maps as well, you might find a few gems in there. ;)"},{"username":"KyouRekii87","userId":10457907,"isRookie":"TRUE","commenter":"Greenshell","comment":"I did not know about this mapper at all before his first map popped up in the mapfeed, which surprisingly was a song both composed and mapped all on their own, as well as featuring one of the highest star ratings amongst ranked maps of 2018. That's right, I'm talking about \"Bostonian Life!\", which might look like your usual pp map at first glance, but due to his experience as a player the map had a few unusual things in it while still being quite nice to play. What else can I say? I deeply respect the effort of mappers also being composers, and I see some potential blooming up in this guy, both as a composer and as a mapper!"},{"username":"Remus","userId":6850949,"isRookie":"FALSE","commenter":"Greenshell","comment":"Probably not the most well-known mapper, Remus has been around actively for the first half of the year, and even despite the drama about a certain map, his \"Ascension to Heaven\" map is still a noteworthy addition to the ranked section, offering a challenge to people through techy, as well as streamy difficulty. Sad to see him not being around to push maps to rank anymore, since he held quite some potential as an already solid mapper."},{"username":"-Kazu-","userId":920861,"isRookie":"FALSE","commenter":"Greenshell","comment":"Quite an unique mapper we've got here, -Kazu- made his way from your \"regular\" modder over to the BNG and now stands here as one of our three QAT members. That aside, after a long-lasting absence of ranking maps (and occasionally GDs) on his own, he came back big this year with a number of maps that are all masterpieces for themselves! If I had to name one or two of his maps coming right to my mind, I'd definitely pick \"Figue Folle\" and \"Feline, the White...\". The former is impeccably diverse and pinpoints everything in the rather chaotic song perfectly along with cleverly implemented extras, while the latter brings a one-of-a-kind approach to o!taiko with its SV concepts and sheer beautiful translation of a breakcore song into a map. I'm not gonna give away too much though, as all of his maps, both ranked and graveyarded, are worth playing through!"},{"username":"Nepuri","userId":6637817,"isRookie":"FALSE","commenter":"Greenshell","comment":"The 200% MAD guy around and one of the people that helped me grow as a mapper, modder and as a person the most. Nepuri has come and brought many maps to us into the ranked section, not only as a mapper, as which he excels especially at spread management, but also as a hard-working nominator! Aside of the infamous \"New Game Plus\", pushing human limits to the extreme, there are also very neatly arranged maps like \"ESCAPE\" and \"Aimless Voyage\", which may not be the hardest maps, but just enjoyable pieces to play through. Go try them!"},{"username":"Pachiru","userId":2850983,"isRookie":"TRUE","commenter":"Greenshell","comment":"Though possibly more well-known among the osu!standard community, Pachiru spent a fair share of time to get into Taiko mapping, and brought two solid sets to the ranked section. \"Jpop Drop\" is a cute, solid little mapset; while the other map, \"Watashi ga Motenai no wa Dou Kangaetemo Omaera ga Warui\", though not the most difficult or extraordinary, is still damn good, and probably my favorite set among anime songs on Taiko. These two maps prove to me that he has a good grasp on how to manage all levels of difficulty ranging from Kantan to Inner Oni, and his overall super friendly and positive attitude makes him a healthy member in the community. Keep it up my man, you've got a lot more potential than you'd probably like to admit!"},{"username":"Marm","userId":5143353,"isRookie":"FALSE","commenter":"Greenshell","comment":"Another member of o!taiko BR, Marm has also shown their presence in the Ranked section; starting off with a complex marathon in 2017, in 2018 they continued with two sweet mapsets, one of them being \"Sweet Requiem\", the other being \"Inverse World\". Personally, I think both are enjoyable pieces to play through, with Sweet Requiem being a set holding patterns that feel pleasant to play to the song, and with Inverse World being one of the more complex kind gain, going all-out on everything the song has to offer with lots of variable snappings, making it quite a challenge! Sadly they aren't around actively, if they get back to rank maps actively though, I'm gonna be looking forward to that!"},{"username":"Axer","userId":7299864,"isRookie":"TRUE","commenter":"Greenshell","comment":"BOY♂NEXT♂DOOR. Axer made quite a name for himself among both players and mappers with his rendition of Cycle Hit, getting himself on the board of Community Choice 2018 in a close 10th place. What I want to focus on, however, is his other ranked map, \"The Grimoire of Alice ~ Fushigi no Kuni no Alice\", which is a pretty streamy and fun map to play through, lots of 1/6 where fit and a good bunch of finishers. If you like hard maps, you should also check out his catalogue of unranked maps, as he likes to map everything in the song without holding back, making a bunch of his works pretty challenging!"},{"username":"Arrival","userId":1694000,"isRookie":"FALSE","commenter":"hikiko-","comment":"Arrival has certainly been less active in 2018 than in previous years, only having ranked one mapset under his own name. He's known for high-energy mapping with an emphasis on gameplay flow and strategic SV usage, and his map of \"YOLO ft. Numb'n'dub\" is a perfect encapsulation of his style. While it is uncertain if his contributions to osu!taiko will continue into the future, his existing contributions will definitely last."},{"username":"Nofool","userId":672430,"isRookie":"FALSE","commenter":"hikiko-","comment":"For a long time now, Nofool has been known to push the boundaries of mapping with his SV-wild creations. Although he ranked only three mapsets of his own this year, his name is nevertheless very prominent within the osu!taiko community. Four of his sets were also promoted to Loved, ones which display his knack for combining visual effects and gameplay flow into a fun, engaging experience for the player."},{"username":"Midnaait","userId":1506011,"isRookie":"FALSE","commenter":"hikiko-","comment":"Midnaait is a very long-standing member of the osu!taiko Argentinan community, known historically for maps of meme songs. This year marked an eventful year for him, winning the osu!taiko Argentina Mapping Contest with his set of \"Nexta\" and capping the gold in Summer Spotlights with \"Bison Charge\". As a member of the osu!taiko Drum Circle, his contributions to the mode will certainly continue, so it should be exciting to see what he does next!"},{"username":"Chromoxx","userId":1881639,"isRookie":"FALSE","commenter":"hikiko-","comment":"Chromoxx is one of the more well-known osu!taiko mappers. Although he's become less involved with the community in the last year, having only ranked four sets in 2018 (a significant drop compared to 2017), the sets have certainly made a splash both in and out of the osu!taiko-specific community. While it's unlikely he will remain connected with the game in the future, his contributions will certainly have a lasting impact."},{"username":"Yales","userId":2377881,"isRookie":"TRUE","commenter":"hikiko-","comment":"In retrospect, it's mildly surprising that Yales is a rookie given all that he has accomplished in 2018. He's been a fast learner, with his own maps improving noticeably quickly since the start. Furthermore, since joining the BNG last October, he has consistently remained an active nominator and as such continues to have a significant impact on the ranked section. Looking forward to what he accomplishes in 2019!"},{"username":"tasuke912","userId":2774767,"isRookie":"FALSE","commenter":"hikiko-","comment":"A long-beloved member of the osu!taiko community, tasuke912 continued to impact the mapping scene in 2018, notably with his groundbreaking set of t+pazolite's \"Ultrasonic Anthem (Kobaryo's FTN-Remix)\". Since he is a top Japanese player and Beatmap Nominator as well, you would be hard-pressed to find a member of the osu!taiko community who isn't aware of him. tasuke912 has consistently contributed to the osu!taiko mapping community for years, so it will be interesting to see what he does next."},{"username":"Ascendance","userId":2931883,"isRookie":"FALSE","commenter":"hikiko-","comment":"Ascendance is well-known for his many contributions to the osu!catch community, but his ranked efforts have also at various points branched out to osu!taiko. His vast mapping experience in general allows him to pick up osu!taiko mapping fairly easily, so if he were to take on some larger endeavors, he would certainly do well."},{"username":"sing216","userId":6096445,"isRookie":"TRUE","commenter":"hikiko-","comment":"Having already been a well-established top Hong Kong player, sing216 made his debut in the ranked section this year with several guest difficults, along with his map of \"Stay Alive (Jun Kuroda Bootleg Remix)\". His first ranked set is incredibly well-made, which is a reflection of all the mapping experience he accumulated beforehand. Looking forward to seeing all the progress he makes as both a mapper and player in the future!"},{"username":"incandescence","userId":6256027,"isRookie":"FALSE","commenter":"hikiko-","comment":"A notably hardworking member of the community, incandescence spent a bit over half of 2018 as a Beatmap Nominator. Although he ranked five sets of his own, many would agree that his work shines in the effort he put into modding. He also involves himself in the mapping circle in several other ways: running community servers, helping newer mappers through the mentorship program, and judging contests. Although he has scaled back his involvement in the game recently, any contributions from him to the gamemode will always be welcomed!"},{"username":"iceOC","userId":5482401,"isRookie":"TRUE","commenter":"komasy","comment":"iceOC is a Japanese player and a mapper who played a big part in the 2018 competitive scene, making full use of his playing skills. The map he made for TJBC was a very avant-garde map where SV was heavily used, I felt it was very interesting. He has been mapping for three years, but in 2018 he finally had a ranked mapset! His ranked mapset \"FEELING AROUND (TV Size)\" is completed as a simple map that everyone can enjoy. Since iceOC has a very high playing skill, I'm looking forward to having a challenging ranked mapset that makes use of it!"},{"username":"kei821","userId":5846289,"isRookie":"TRUE","commenter":"komasy","comment":"kei821 is a Japanese mapper and advanced player who grew rapidly in 2018. He had a ranked mapset with BlackY's \"Paradission\". He constantly makes maps with cool songs and there are a lot of challenging maps in his graveyard. Why don't you try challenging them? Anyway, I'm looking forward to his success for playing and mapping in 2019!"},{"username":"uone","userId":5321719,"isRookie":"TRUE","commenter":"komasy","comment":"uone is one of the Japanese mappers who can make various types of maps. Having acquired 1st place in TJBC #5 in 2018 proves that he has reliable mapping skills. He can make a wide range of maps, from simple to technical maps. Especially his \"Igomoyos - Omul no Thema ni yoru Buyobuyo Sketch no Kokoromi\" map has been completed with diversity and technical difficulty so it made a lot of players have fun! He mainly makes maps for fun, but all of them capture the characteristics of songs and have very high quality, so we are certainly looking forward to seeing you have a ranked map in 2019!"},{"username":"butter0414","userId":7935022,"isRookie":"FALSE","commenter":"komasy","comment":"butter0414 is a Japanese mapper who came from TaikoJiro which can make from a stable map to a violent map! He has earned a solid record of successes in the TaikoJiro and TJBC contests! He only had two ranked maps in 2018, but numerous wonderful maps are sleeping in his Graveyard. We are looking forward to seeing you awake them...!"},{"username":"EdamaMe411","userId":4270973,"isRookie":"FALSE","commenter":"komasy","comment":"EdamaMe411 is one of Japan's most energetic mappers! The big news in 2018 are that he finally had a ranked map of Icicle Stinger! Many players were longing for it and pleased them a lot! This map could make both beginner players and advanced players enjoy. At the moment he doesn't have many ranked maps, but since he has potential, we are hoping to see more ranked maps in 2019!"},{"username":"kitafuma","userId":8987606,"isRookie":"TRUE","commenter":"komasy","comment":"kitafuma grew rapidly in 2018 and had two ranked maps! Every song he chooses is nice and has a sense. Cage (Mtell Remix) is a map with a story line, Slow Step is a map in which can enjoy a unique rhythm. It's obvious that he has certain potential. Thank you for giving us high quality maps. We are very hoping for your success in 2019!"},{"username":"nyanmi-1828","userId":6866480,"isRookie":"TRUE","commenter":"komasy","comment":"nyanmi-1828 was revived from a restriction in 2018, and was active as a member of Loved. It would be appropriate to say that it's been a turbulent year. We show you respect for your work! His map is very rich in groove, everyone can enjoy playing. Especially when you play his \"Exit This Earth's Atomosphere\" and \"Feelin Sky\", you will be able to \"feel the wind\"..."},{"username":"yassu-","userId":7095592,"isRookie":"FALSE","commenter":"komasy","comment":"yassu- is one of the experienced mappers in Japan and always gets a good result in the TJBC! He makes very high quality and enjoyable maps, it is very difficult to find bad points. Especially I love \"Endless Tears\", which gives us a natural playing experience. We are looking forward to your maps in 2019 too!"},{"username":"yuzu__rinrin","userId":4616752,"isRookie":"FALSE","commenter":"komasy","comment":"yuzu__rinrin provided this year simple and catchy maps with eroge song and Anime songs!  Palpitation in his graveyard is one of my favorite map and I'm looking forward to it being ranked! Activity was not very high in the second half of 2018, but people will be waiting for your maps!"},{"username":"Charlotte","userId":3686901,"isRookie":"FALSE","commenter":"komasy","comment":"As you know Charlotte is a very famous and experienced Japanese mapper! He makes orthodox maps which anyone can enjoy, with a wide range of song genres from Anime to Electronic. Personally I like \"Sarutobi Champion is Sessha\" and \"Omoide\", especially \"Sarutobi Champion is Sessha\" was very creative and great. In 2019, too many players will be looking forward to your map!"},{"username":"chaica","userId":4455389,"isRookie":"FALSE","commenter":"komasy","comment":"chaica is one of the Japanese mappers who mainly makes maps with anime and eroge songs! He is good at making a simple map, and he made a mapset which everyone can enjoy with \"crossing way\" in 2018! He currently focuses on playing rather than mapping, so I don't know whether we can see more of his maps this year, but I hope I can see more!"},{"username":"Tomoka Rin","userId":125308,"isRookie":"FALSE","commenter":"komasy","comment":"Tomoka Rin is a Taiwanese mapper with two ranked mapsets in 2018. Tomoka Rin is good at making maps that everyone can enjoy, and demonstrates it in maps such as \"Signal Graph (TV Size)\" and \"Tenka Toitsu A to Z *\" in 2018. Especially my favorite is \"Tenka Toitsu A to Z *\", this mapset is designed to be easy to beat even for beginners, Oni captures the rhythm of the song exactly, and it is very complete as a whole mapset. If you have not played it yet, how about playing?"},{"username":"-Tenshi-","userId":1442333,"isRookie":"FALSE","commenter":"komasy","comment":"-Tenshi- is a French mapper that mainly makes maps with videogame tracks. He has ranked mapsets from many famous game tracks until recently, in particular he made a mapset that can be enjoyed even by beginners with \"Snowdin Town\", from the widely popular game UNDERTALE in 2018. We hope that from now on -Tenshi- will continue to make maps which players can feel the charm of videogame music!"},{"username":"yea","userId":6874332,"isRookie":"TRUE","commenter":"Nepuri","comment":"yea has definitely proven to me and to a lot of other mappers that a map's SV can be crucial to how it's enjoyed and received. Of course, I'm talking about his absolute banger of a map \"Sound Chimera\" by Laur! In 2018, yea has not ceased in his efforts to bring maps to the ranked section, which clearly shows in the aforementioned map. I can only describe it as an absolute joy to play, as well as the pinnacle of SV manipulation. I really do hope that whatever 2019 brings for us, it is more enjoyable maps like these. Best of luck, yea!"},{"username":"Zedther","userId":8316352,"isRookie":"TRUE","commenter":"Nepuri","comment":"A very new face to taiko mapping scene, with barely 3 months of mapping experience, he has improved quite quickly and even managed to rank his first mapset \"Cold Green Eyes\" before 2018 came to an end! It's a nicely arranged mapset with solid lower difficulties, and it makes me look forward to future maps of his."},{"username":"pishifat","userId":3178418,"isRookie":"TRUE","commenter":"Nepuri","comment":"Hello there! Although pishifat is widely known in the osu!standard gamemode, he has shown me with his map \"Kiritorisen\" that taiko mapping is extremely accessible even to mappers of other game modes. This especially is clear considering that it is his first taiko-specific mapset, as well as having decent quality on top of that. I would highly recommend also watching his video about his detour into taiko mapping!"},{"username":"[Zeth]","userId":9912966,"isRookie":"TRUE","commenter":"Nepuri","comment":"I can hardly think of anyone else that has just appeared out of nowhere with a high difficulty marathon map and managed to pull through successfully without much trouble like he did. Seriously, others may not think of Zeth in such a way, but he has clearly shown he knows what he is doing with his harder difficulties, leaving us looking forward to what he would bring to us when he maps lower difficulties"},{"username":"Nifty","userId":4956097,"isRookie":"FALSE","commenter":"Nepuri","comment":"If there is anything that screams \"Nifty\", it is his contributions to the meta, as well as to the BNG in recent times. Whether it was him being heavily creative in SV usage or him being unarguably the most active BN in his time, his efforts left a major footprint in the osu!taiko mapping community either way. Although he is not a BN anymore, we can all be sure his name will not be forgotten that easily."},{"username":"Nao Tomori","userId":5364763,"isRookie":"FALSE","commenter":"Nepuri","comment":"Nao got most of his recognition in Taiko via mapping Taiko guest difficulties in hybrid sets, making him probably one of the most commonly recognized taiko mappers around. He has, like many others, come from the osu!standard mapping scene and managed to learn taiko quite quickly. If I were to suggest a map of his: I can't. There are just too many and you would lose track of how much he has contributed to the ranked section. Whenever you feel like having a more relaxed and standard approach to taiko mapping, I recommend you look up one of his difficulties."},{"username":"-Leafeon","userId":6956922,"isRookie":"TRUE","commenter":"Nepuri","comment":"Primarily known as one of the best players in Germany today, Leaf is by no means an illiterate when it comes to mapping, due to the fact that he ranked his first mapset \"Drop - Granat\" in 2018, showing that he does have the brains to make a solid mapset and rank it as well. In him I see a lot of untapped potential as a mapper and a modder (more than he would like to admit), and I think he would be an excellent mapper if given the push in the right direction."},{"username":"Noffy","userId":1541323,"isRookie":"FALSE","commenter":"Nepuri","comment":"Though probably better known for her tenure in the Quality Assurance Team for the osu!standard gamemode or her Storyboards, she has also proven her proficiency in taiko mapping (and in a relatively short time at that!). Despite standard being her main mode of mapping, I gladly look forward to any future mapsets or difficulties from her in the taiko game mode! I highly recommend checking out her Oni in the \"Kasane Teto\" set she ranked recently, as it contains quite fun finisher patterns and is enjoyable overall."},{"username":"tatatat","userId":6107943,"isRookie":"FALSE","commenter":"Nepuri","comment":"What is there to say about tatatat? He's well-known around the community for both being one of the most talkative people around, as well as being one of the few mappers that are left who focus on mapping exclusively lower difficulties in their mapsets! Though they are not crazy fast or challenging, they are quite enjoyable. Please do check out his \"Another Moon\" or \"Stolen Dreams, Lost Light\" Mapsets, as they are both enjoyable and feature solid mapping."},{"username":"Rhytoly","userId":8121109,"isRookie":"TRUE","commenter":"Nepuri","comment":"While just having gotten his first ranked set in 2018, he is by no means an inexperienced mapper in any way, even though he is a very young mapper (both as a mapper and as a person!). He was able to learn quickly and become a pretty solid mapper in a span of just a few months! Proving both his proficiency in higher difficulties as well as managing a spread, he is very much someone who knows what they are doing."},{"username":"Volta","userId":4154071,"isRookie":"FALSE","commenter":"Nepuri","comment":"While probably not known for anything blisteringly fast or challenging, Volta deserves my #1 award in terms of flawless and nicely executed lower difficulties across all his recent mapsets. Beside low difficulties, he is also excellent at mapping higher difficulty maps, most notably \"HONESTY\", which is an absolute blast to try and play; give it a shot!"},{"username":"Faputa","userId":845733,"isRookie":"FALSE","commenter":"Nepuri","comment":"Faputa has an amazingly diverse mapping history that he can talk of, having gotten mapping experience across multiple game modes: Standard, Taiko and Mania. The most notable of these is taiko, where he attained the BN status in early 2018. So far, I can only speak of his as one of the most polite people around and as a person that is respectable (you don't even have to mention his map quality to realize he's great!). Working with him has been a blast so far and I sure hope this can continue, with him bringing us new maps into the ranked section, both his and the ones he nominates."},{"username":"JeirYagtama","userId":7483452,"isRookie":"TRUE","commenter":"Nepuri","comment":"JeirYagtama, former osu!catch Beatmap Nominator, is now trying his skills out in another game mode, taiko! Having submitted his first taiko set in mid-2018, he managed to rank it just about 2 weeks later in August! While the map may be simple, it showcases his understanding about taiko-specific mapping concepts and makes me see potential in him as a full-fledged taiko mapper!"},{"username":"Realazy","userId":918297,"isRookie":"FALSE","commenter":"Nepuri","comment":"And here comes yet another mainly osu!Standard proficient mapper into the ranks of taiko mappers! While Realazy is probably more known as a Beatmap Nominator for osu!Standard, he still has shown his proficiency in taiko in recent times, mainly collaborating with eiri-! I would highly suggest you check out his difficulties on \"Oriental Blossom\"!"},{"username":"Loctav","userId":71366,"isRookie":"FALSE","commenter":"Nwolf","comment":"Loctav, a long time Community Manager and one of the most noteworthy members of the osu! history, contributing to many improvements of the game and the annual world cups, returned to the ranked section this year with a new rendition of the well-known song \"furioso melodia\" by gmtn. (witch's slave), featuring tricky rhythms, tricky slider velocity changes and - how else could it be - big notes. A lot of them. And seeing as his 10th osu! anniversary is coming soon (yes the game is THAT old), who knows, maybe we will see another classic Loctav map again this year!"},{"username":"Ulysses","userId":515967,"isRookie":"FALSE","commenter":"Nwolf","comment":"While he is more known in osu!standard, Ulysses, who you might know as \"nold_1702\", has been a part of osu!taiko for years. Mostly providing a solid ground for other mappers to build on, by making the easier taiko difficulties of a set, he has given us timeless maps like \"Terminal\". This year, he has done it again for his final set to S3RL's \"Nostalgic\". He has since then retired from the osu! community, and I think he deserves to rest now. Thanks for your contributions to osu!, and enjoy your time outside!"},{"username":"JUDYDANNY","userId":1165475,"isRookie":"FALSE","commenter":"Nwolf","comment":"JUDYDANNY is an old, well-respected member of the community, having provided countless maps for the ranked section, to be used in tournaments, and also being a Beatmap Nominator for several years. He's currently inactive, but not done yet, but it looks like he has some maps in store for 2019 already, and I wouldn't be surprised if there will be more to come. Maybe, just maybe, he will return to beatmap nominating one more time, as well."},{"username":"Lost The Lights","userId":1255920,"isRookie":"FALSE","commenter":"Nwolf","comment":"He has been missing in 2017, but Lost The Lights returned to the living in 2018, and I think it's safe to say it would've been a disappointment if he had done it with anything but Demetori. Luckily, he has done exactly that. \"Warabe Matsuri ~ Innocent Treasaures\" feels like a very classic Demetori beatmap, featuring lots of syncopated rhythms, occasional bursts and the obligatory guitar stream in the beginning of the last third of the song. Lost The Lights has proven that even with a break, he is still in top form."},{"username":"DakeDekaane","userId":1425253,"isRookie":"FALSE","commenter":"Nwolf","comment":"DakeDekaane, a long-time member of the osu!taiko community and ex-QAT member, is mostly known for using ninja notes and mapping in a more authentic style. Neither of those are true for the maps he ranked in 2018, however what is true is that his set of \"Heterochromia Iridis\" is a LeaF song, and that's his third staple. I hope your fingers are ready for this piece of art, as you will have to go through many and long monocolor bursts before you even reach half of the song. Give the map a try, I'm sure you won't be disappointed."},{"username":"Skylish","userId":2845958,"isRookie":"FALSE","commenter":"Nwolf","comment":"Skylish has showed up in the ranked section in 2017, and has continued to be present throughout 2018. Most of his ranked maps are calm Japanese anime or anime-style songs, but on the very last day of 2018 a more unusual map has made its way into Skylish's list of ranked guest difficulties, featuring some tricky patterns and, more noticeably, quite experimental slider velocity usage. They are hard to predict on the first playthrough, and I'm a big fan of such SV. Let's see if Skylish continues to expand his range of different map types in 2019!"},{"username":"Surono","userId":3611370,"isRookie":"FALSE","commenter":"Nwolf","comment":"Surono never disappoints when it comes to which maps he ranks every year. You've got your Wrestling Festival song, a Demetori song, Infected Mushroom, and an Indonesian song, just to name the maps you simply expect when you hear the name \"Surono\", but there's of course more than just that. Song-wise ,my personal favorite was Chata's \"Yuune Zekka, Ryouran no Sai\", something I wanted to see ranked in taiko for a long time. Like many of his maps, you will notice that each section of the song has its own SV, which is one of the many reasons Surono maps continue to be fun in 2018, and in the future!"},{"username":"guro","userId":3679326,"isRookie":"FALSE","commenter":"Nwolf","comment":"I don't know if guro has found the cheese yet, but he has found one of Lovecraft's Outer Gods in the form of a song by Nhato. This map features a variety of snaps, streams and mild slider velocity changes. Despite not having ranked much more than this set, guro has returned with some solid maps after being absent in 2017. Will he stay for 2019, or does he hate uneven years? We can only wait and see."},{"username":"iloveyou4ever","userId":4964596,"isRookie":"FALSE","commenter":"Nwolf","comment":"Despite True Blue being ranked for two years now, they're thankfully still around! Not only do they like long songs, or more precisely, extended rhythm game songs, they also really like streams. Know who I'm talking about? If not, don't worry, I'll tell you - it's iloveyou4ever! And with an introduction like this, it's only fair of me to specifically talk about their map to xi's \"World Fragments\", a song that's almost 11 minutes long and features short streams, 1/6, short streams, piano shenanigans, BPM changes and, I think I haven't mentioned them yet, short streams! This is not the streamiest map iloveyou4ever's done, but it still perfectly fits what you imagine an iloveyou4ever map to look like. They've done great work in 2018 and will probably continue to do so in 2019!"},{"username":"gaston_2199","userId":5938161,"isRookie":"FALSE","commenter":"Nwolf","comment":"I don't know how slick he is, how quick he is or how thick his neck is, but I know he's pretty damn good in mapping, with his map to Asterisk's \"Rain\" being quite complex in pattern usage, yet still fun and challenging to play. If the song is not your jam, he also has mapped some anime and rhythm game songs this year, so make sure to check them out."},{"username":"duski","userId":6506484,"isRookie":"TRUE","commenter":"Nwolf","comment":"Two of 2018's many Camellia songs were ranked by the debuting mapper duski, and he's done a quite nice job with them. Additionally, he's the one of very few - if not the only - Finnish osu!taiko mappers with ranked maps and I can already see in the ranked section that he will continue to represent Finland in 2019!"},{"username":"lazyboy007","userId":7882675,"isRookie":"TRUE","commenter":"Nwolf","comment":"First a little geography lesson: Luxembourg is, indeed, an European country. That being said, lazyboy007 is the only Luxembourgish osu!taiko mapper, and his most notable map is Piccadilly, which you might remember from the 2018 osu!taiko World Cup Finals. This map is especially noteworthy, because not only is it very well mapped, even ignoring that it's lazyboy's first ranked map, it is also a song with swing rhythm which is something you basically never see in osu!taiko, ranked or unranked. This, together with him being from an otherwise unknown country for osu!taiko, makes lazyboy007 a more special newcomer of 2018."},{"username":"D o t","userId":8486686,"isRookie":"TRUE","commenter":"Nwolf","comment":"For a few years there hasn't been much activity from China's osu!taiko community, but as 2018 went on it seemed to have changed again and D o t is one of the reasons I'm saying that, debuting with his set to AAAA Chazuke's \"Sayonara Cosmonaut\". A great set, with the highest difficulty being incredibly well done despite its variety, and that being a first ranked map makes it even more amazing. Definitely a map worth playing if you haven't. I'm sure we will see more great things from D o t in 2019!"},{"username":"salchow","userId":9738159,"isRookie":"TRUE","commenter":"Nwolf","comment":"salchow is a Norwegian osu!taiko mapper, who joined the ranked section as rookie now in 2018. Map-wise there is not much to say about them yet, except that they seem to like FELT, and having their first set ranked after almost exactly one year after it was submitted. Also, their avatar on discord is a wolf (and I'm sure it used to be in osu! as well but it's a girl now, ewwww), so they are clearly a good person. Nevertheless, their ranked maps so far bring a nice amount of slider velocity changes with them, and some of their unranked maps as well so I'm hoping that some of them get ranked in 2019!"},{"username":"Stingy","userId":6777358,"isRookie":"FALSE","commenter":"Raiden","comment":"Stingy is an American mapper who made his debut in the ranked section in 2017. Since then, he has ranked two t+pazolite maps \"seedy try\" and \"Oshama Scramble!\" in 2018, which are fantastic songs with a very good mapset spread to accompany them. Even if he is a little more active in osu!standard, let's see if he can keep up in 2019 for osu!taiko!"},{"username":"Ney","userId":5991961,"isRookie":"FALSE","commenter":"Raiden","comment":"Ney, previously known as n1doking, is one of our top players who also happens to provide us maps to the ranked section. He made his debut in 2016 with two guest difficulties on \"Cory in the House\", and he has surely stepped up to meet today's standards, making his way into the ranked section this year with maps such as \"Harmonize Clover\" and a fantastic guest difficulty on the Pendulum track \"Showdown\", which makes use of potentially controversial yet interesting 1/8 patterning choices. Definitely check his Loved map \"minefield surfing\", since it's one of the most interesting Loved maps I've seen in a long time."},{"username":"qoot8123","userId":766371,"isRookie":"FALSE","commenter":"Raiden","comment":"A true veteran of osu!taiko, qoot returned to the BNG this year and proved to be up to nowadays' standards. This year he has provided us with three ranked maps, \"Bittersweet\", \"Sincerely\" and \"ZERO!!\", all of which are Japanese songs. Let's see what he does in 2019."},{"username":"frukoyurdakul","userId":7612550,"isRookie":"FALSE","commenter":"Raiden","comment":"♪ ♪ Another one bites the dust  ♪ ♪. On a more serious note, his departure from the BNG was a great loss for the mode. Widely known for his famous dedication to metal songs (a shared trait with me, ho!), as well as high proficiency in the timing field, not to forget the incredibly useful mapping tool (https://osu.ppy.sh/community/forums/topics/673325) that made all of our lives easier, his contributions to the mode are in no way forgettable. He still managed to push forward to rank some outstanding maps such as \"Angel Vivaldi - A Mercurian Summer\" and \"Rings of Saturn - The macrocosm\", both of which show very characteristic patterns from his mapping style. Make sure to check them out if you'd like a high level challenge!"},{"username":"Raphalge","userId":3918650,"isRookie":"FALSE","commenter":"Raiden","comment":"A kind and trustworthy Swedish dude who is also a godlike HR player. I have to admit that I was honestly shocked the first time I saw him mapping. This guy quickly adapted to how mapping works and showed it in his first ranked map (I ranked it myself) in 2017. This year he showed his proficiency again with a fantastic song \"Astral Dogma\" from Yousei Teikoku. While both of these maps are marathons, I'm sure he could map a full spread as well as mod one. I wouldn't mind at all to see him become more invested in mapping and modding and trying to join the Beatmap Nominators."},{"username":"-Sh1n1-","userId":1957638,"isRookie":"FALSE","commenter":"Raiden","comment":"An old friend of mine who finally managed to get into the BNG. He's fairly known for having a certain degree of multi-mode proficiency, and while he's not an osu!taiko BN, I would certainly not mind having him aboard. His knowledge of several modes (but most importantly, osu!taiko, obviously!) and his great capabilities at pushing solid mapsets to rank from various genres make him a great asset to the community. Keep it up!"},{"username":"Greenshell","userId":8693851,"isRookie":"TRUE","commenter":"Raiden","comment":"During my tenure as a QAT so far, there are certain people who have made me feel anything but indifferent. Most of them are incredible people who have shown very promising skills and attitude, and Greenshell is one of those people today. Not many people have dedicated this much time to improve themselves, not only on this game or mode, but also personally. While unfortunately he has not had the chance to join the BNG yet (he is now a BN, ha!), I'm sure he will be able to soon enough, as his modding and mapping skill, paired with his mostly impeccable attitude (and his love of red pandas, of course) make him a most suitable candidate. This year, he's managed to push to rank one of my favourite mapsets of the year, \"Sayonara Planet Wars\", which shows how a spread is actually supposed to be created as well as having an incredibly well built top difficulty which squeezes every last musical element from the song. All in all, Greenshell is a healthy and desirable presence in any kind of community, and we are lucky to have him. Keep it up, boy."},{"username":"_DUSK_","userId":6092181,"isRookie":"TRUE","commenter":"Raiden","comment":"I remember getting to know him waaay back in at least 2015 when I had just gotten into the BNG. His enthusiasm in the mode fascinated me quite a bit for a 13 year old. Now he's all grown up, having gained enough maturity as well as fantastic mapping and modding (and playing!) skills at taiko. Each and every one of his ranked mapsets were ranked this year, so I expect lots of things from this guy in the coming years!"},{"username":"ARGENTINE DREAM","userId":1981781,"isRookie":"TRUE","commenter":"Raiden","comment":"I'd be lying if I said that she is not one of my closest osu! pals. DREAM (now _WWWWWW_WWWWWW_) has clearly shown her profound interest in the game mode, especially after the takedown on Ishukan Communication. Having so many years of music studies and TnT behind her back, it surely was not a big deal for her to quickly and firmly grasp the concepts of osu!taiko mapping, ensuring an astoundingly rapid ascension to the top tier of mappers and modders as well as her position among the Beatmap Nominators. By far, the map I like the most from her this year is, without any kind of a doubt, \"An Elegy Of Icaros\", a black metal song that is beautifully mapped (and is also spotlighted in last year's Autumn Spotlights, check it out!). All in all, one of the, if not the most promising individual in our community from my perspective."},{"username":"Okoratu","userId":1623405,"isRookie":"FALSE","commenter":"Raiden","comment":"It is Wednesday, my dudes. Nothing defines Okoratu/Okorin/Okoyue/Okowhatever better than this catchphrase. I'm writing this comment on a Wednesday, too. Now for the serious part: Okoratu is... strange. There is no adjective that I can actually think of to fully define him, but this only makes him more interesting as a person and as a community member. His presence in taiko has mostly been via sporadic appearances to either rank something (he can nominate taiko, yes) or to get something ranked himself, but this does not mean he has not spent much time in this mode. He has actually contributed greatly to the discussion on the initial rework of the RC as well as the continued updates. This year, he's pushed to rank a huge hybrid set \"Gabriel Drop Kick\", which features a total of 20 difficulties, 5 of which are for taiko. You seriously need some patience for that. I hope these comments come out also on a Wednesday."},{"username":"Kuron-kun","userId":2697284,"isRookie":"FALSE","commenter":"Raiden","comment":"Kuron is no stranger to taiko. At least, not any longer, as he managed to push two maps forward this year: \"Placa no Chao\" and \"Natsuiro Egao de 1,2, Jump!\" One of the most renown names in the Brazilian community, and also an osu!standard QAT member, he has taken some of his time to properly learn how taiko works, and that is certainly admirable. I wish to see more from him in the future. P.S.: He's CUTE. AS. HELL."},{"username":"Mew104","userId":2345156,"isRookie":"FALSE","commenter":"Raiden","comment":"Mew is fairly known among the community for being an incredibly good player and mapper, but also for being Weegee-eyed Mr. Krabs. His avatar is obviously his most well-known aspect. Jokes aside, this year he managed to push forward a map to rank (\"The Rift\"), and let me assure you that this is nothing short of a multi-rhythm masterpiece. Despite having only two ranked maps, he certainly is no stranger to the ranking process, and the amazing quality of his works do pay off in the end. Not only is it a fantastic set difficulty-wise, but the highest difficulty shows how perceptive his ears are as well as his capability of interpreting a plethora of various rhythms and smashing them together to create pieces of art. He ranked one map in 2017 and one in 2018. Can't wait for the 2019 one. \nP.S.: I only need 45 more for the Maw."},{"username":"Aloda","userId":1190127,"isRookie":"FALSE","commenter":"Raiden","comment":"Our Australian QAT. His premature departure has certainly taken a toll on the team as he is, like Nardo, a very integral and reliable person. His impeccable attitude and outstanding modding capabilities are what made him a worthy addition for us. Lest we forget about his mapping in 2018, ho! This year, Aloda managed to push some maps to rank such as \"SOSOSO - Try for Keeps\", a very solid vocaloid mapset. I wish you luck in your future endeavours, and I also want to thank you dearly for the service you have provided to this mode. It will not be forgotten."},{"username":"hikiko-","userId":6512678,"isRookie":"FALSE","commenter":"Raiden","comment":"The one-handed osu!taiko player. That, by itself, should already tell you a lot. It's not that she's one handed, it's that she plays with only one hand! A former osu!taiko BN known for her outstanding musical ear on a variety of genres and impressively solid mapping skills; while having departed from the BNG, her contributions to the mode will certainly not be easily forgotten."},{"username":"Nardoxyribonucleic","userId":876419,"isRookie":"FALSE","commenter":"Raiden","comment":"What else needs to be said about this madman? The one and only Nardo. Having had the chance to work alongside him for more than a year now, I can safely say that he is one of if not the most integral people I have ever met in this game. His profound work ethic and impressive discipline is something to be reckoned with. He has, this year, almost single handedly managed Quality Assurance on his own, checking almost if not every single map that went on to be qualified. Not many people can do that consistently while simultaneously pushing a handful of their own maps to rank and managing a real life job at the same time. But Nardo can, and I certainly am grateful that he exists. I look forward to continue working with him for as long as possible, and would certainly not mind meeting him in real life at all! One of my favourite maps from him this year is \"EPICA - Universal Death Squad\", which is a symphonic metal masterpiece. You should definitely check it out!"},{"username":"Nwolf","userId":1910766,"isRookie":"FALSE","commenter":"Raiden","comment":"What's there to say about Nwolf that hasn't been said already? Our good ol' German pal and ex-Beatmap Nominator (possibly returning soon™), he's both a good community member and a good person. He may have his occasional rants, but we still love him nonetheless. This year, he ranked one of the maps he had featured in the osu!taiko World Cup 2018: \"onoken - Viden\", which is a complex rhythm piece that uses a lot of off-beat patterns. Don't let the lack of mixed snaps fool you! The rhythm is already complex by itself!"},{"username":"Tyistiana","userId":1421452,"isRookie":"TRUE","commenter":"Raiden","comment":"While this sentiment may not be shared wikth many, I do have to recognize his potential. I remember seeing his mods for the BNG application, and all I could think was \"he needs a little push in the right direction!\". I highly value applicants like that, and especially if they keep trying very hard (he is now a BN, yes!). This guy certainly has an acute sense of what modding actually means, and I am fairly sure we will see him working as a nominator soon enough. We shouldn't forget the mapping part, too! Tyistiana has pushed to rank 2 solid mapsets, which means he is very aware of how ranking works. I look forward to working with him."},{"username":"Lasse","userId":896613,"isRookie":"FALSE","commenter":"Raiden","comment":"Yet another German QAT. When will the dictatorship end? Oh wait... \nWhile Lasse is not too widely known amongst osu!taiko community members, he has managed to push some maps to rank, most of them being solid anime sets with a decent spread. I'm sure he could improve very fast and get into the osu!taiko BNG if he tried hard enough."},{"username":"neonat","userId":1561995,"isRookie":"FALSE","commenter":"Raiden","comment":"Though he's more known in the standard community, neonat hopped onto the taiko train and really showed off his proficiency by becoming a beatmap nominator for the mode. This year, he has managed to push \"Nightwish - Storytime\" for rank, a beautiful symphonic metal marathon which is a collab with known taiko mappers cdhsausageboy and Jerry. Make sure to check it out!"},{"username":"Jonawaga","userId":3653035,"isRookie":"FALSE","commenter":"Raiden","comment":"Jona is an American taiko community member who also happened to be a very proficient beatmap nominator and a mapper. Unfortunately, he left us not a long ago due to real life issues. Before leaving, however, he pushed three maps to the ranked section in 2018. One of my favourites is \"DEAN FUJIOKA - History Maker\", the opening of a very popular anime (Yuri On Ice). We wish you the best on your future endeavors and appreciate your work for the community!"},{"username":"Prophecy","userId":3793769,"isRookie":"FALSE","commenter":"Raiden","comment":"I remember getting to know Prophecy way back in 2015. Back then, he constantly struggled to get a map ranked. Nowadays, his skills have improved so much that he finds little trouble when he wishes to rank something. This year he has gifted us with the map \"Hitomi ni Kakusareta Omoi,\" a normal senya track. While he ranked only one map this year, I look forward to see what he brings to the ranked section in 2019!"},{"username":"xtrem3x","userId":136385,"isRookie":"FALSE","commenter":"Raiden","comment":"xtrem3x is truly an osu!taiko veteran. With nearly 10 years of tenure in this game, he most likely has seen everything pass in front of his eyes. His presence in the ranked section this year consists of a relatively simple set, \"Jingle Bells ga Tomaranai\", ranked in January. He already ranked his first map of 2019, also in January. Is he the Jan-man?"},{"username":"Alwaysyukaz","userId":4999506,"isRookie":"FALSE","commenter":"Raiden","comment":"Yukaz is a fairly new community member, but that does not imply he is bad at what he does. On the contrary, the quick improvement of his mapping and modding skills goes to show how much one can progress in the community if they put a good amount of effort into their work. In this year of mapping, he's blessed the ranked section with maps like  \"High Free Spirits (nenpulse bootleg remix)\" and \"Daisy\", a marathon and a set respectively, which demonstrates his proficiency in both these areas of mapping. Can't wait to see what he provides us in 2019."},{"username":"Elfin","userId":1399551,"isRookie":"FALSE","commenter":"Raiden","comment":"Elfin is no newcomer to taiko; he's been in the scene for at least 3 years. While he may not have a super big presence in the mode, his contributions certainly do not go unnoticed. Being a prolific modder, he's helped many mappers improve their creations. This year, he gifted us \"EOS (kamome sano rmx)\" by ginkiha, a super chill song that you'll surely enjoy playing, so make sure to check it out!"},{"username":"davidminh0111","userId":9623142,"isRookie":"TRUE","commenter":"Raiden","comment":"David joined taiko in 2017, but his efforts were not noticed until 2018, when he ranked all of his three ranked mapsets, two in January and one in April. One, \"bells!\", is from the Featured Artist cYsmix, and the other two are fairly simple anime mapsets. Unfortunately, this promising young mapper made the decision to leave the game not long ago. It would have been nice to see how he evolved in the mapping and modding scene. Let's hope he returns some day so he can progress further!"}]