[{"username":"-Hex-","userId":8630988,"isRookie":"FALSE","commenter":"JeirYagtama","comment":"-Hex- is a mapper that brings simplicity and user-friendliness to his recently Ranked maps, which whilst not the most complex or technical, still provides great satisfaction through his patterns which accurately expresses the music well. Without being the most experienced mapper, he still attempts to provide quite the creative stance on turning slow songs into interesting maps for players of all skill levels to enjoy. Let us hope in 2019 that he delivers more quality content for everyone to play!"},{"username":"-Luminate","userId":4778689,"isRookie":"TRUE","commenter":"Nelly","comment":"-Luminate is another newcomer to the ranking process despite starting his mapping career in early 2017. His first appearance in a Ranked mapset was in June with a guest difficulty for rew0825's \"nao - Towa naru Kizuna to Omoi no Kiseki\", with his own first Ranked set being \"*namirin - Koi no Hime Hime Pettanko\" later in the same month. However, he received the most attention in October when he joined the Beatmap Nominations, where he has since worked to improve the speed and quality of the beatmap Ranking process steadily whilst continuing to grow in experience and confidence. During this time he also ranked a second beatmap, \"Marie - Clover Day's\", as well as a guest difficulty on \"Suzuyu - Euphorium\" by AJamez. He has improved tremendously over these past months, and though he has only just started to make major contributions to osu!catch, we will be looking forward to his progress in 2019!"},{"username":"-Nicotine","userId":4818935,"isRookie":"TRUE","commenter":"JBH","comment":"-Nicotine has been actively mapping for almost three years now, but 2018 marked their first arrival in the Ranked section with the promotion of three Cup guest difficulties. Whilst this may not seem like much, it is clear for all to see that -Nictonie is a rapidly improving mapper, winning the second edition of the community-organised\" Ultimate osu!catch Mapping Contest\" in June. Whilst there has been no real indication of their spread-constructing ability as yet, expect to see a few more guest contributions from -Nicotine at both extreme ends of the difficulty scale over the following year."},{"username":"-Plus-","userId":829284,"isRookie":"FALSE","commenter":"Sanyi","comment":"-Plus- (previously well known as Chara) is known for mapping extremely difficult unranked \"challenge\" beatmaps, which she continued in 2018. However, not content to leave all her creations in the graveyard, she managed to push some very unique beatmaps in 2018 at completely opposite ends of the skill spectrum. Starting off with \"AAAA - Dreamer.\", a mapset with astonishing hitsounding and very nice and fitting flow on both difficulties. She also managed to rank \"RoughSketch feat. DD \"Nakata\" Metal - Booths of Fighters (Camellia's \"Barrage of Flurries\" Remix)\", a collaborative marathon-length beatmap with Ascendance, which is a real challenge for even the best players, providing different kinds of harsh yet well-fitting patterns in every section of the entire difficulty. I hope to see more from her in 2019, may it be Ranked or unranked, because her creations are always something special."},{"username":"-Sh1n1-","userId":1957638,"isRookie":"FALSE","commenter":"alienflybot","comment":"-Sh1n1- was slightly quiet last year in the osu!catch mapping field, having only two mapsets and a single guest difficulty achieving Ranked status. Despite the small amount of Ranked difficulties, both of his sets command interest and respect. Partnered with Ascendance and Spectator, -Sh1n1- successfully Ranked “fhana – Kimi to Iu Tokuiten [singular you]”, which is a marathon showcasing coherent mapping style and structure among the three mappers. With toil and sweat, -Sh1n1- also pushed “Shiena Nishizawa – Meaning” to the Ranked section. Despite the significant drain time, -Sh1n1- did not reduce the size of the spread, but instead decided on extending the size to the fullest. As -Sh1n1- started to produce more new maps (and revive old ones) lately, 2019 may be another year for him to showcase his talents."},{"username":"Absolute Zero","userId":4847256,"isRookie":"FALSE","commenter":"JBH","comment":"Absolute Zero doubled his count of Ranked difficulties this year, with a pair of guest contributions (one Salad and one Platter) in the first quarter of the year. Whilst this may seem strange for such an experienced member of the community, it's worth remembering that Absolute Zero has always provided much more through modding contributions rather than mapping in the past. However, with two completed mapsets of his own that have been steadily improved and reworked over the course of the past year, 2019 may be AZ's opportunity to leave a more significant mark on the osu!catch Ranked section as a mapper in his own right."},{"username":"AJamez","userId":7890134,"isRookie":"TRUE","commenter":"Ascendance","comment":"A complete newcomer to osu!catch mapping for 2018, it was quite a shock when AJamez made it into the Beatmap Nominators earlier this year. However, after some initial struggles, AJamez has made an explosive entry into the modding and mapping world. Boasting some impressive numbers for his rookie year, alongside his numerous contributions to the Beatmap Nominators, AJamez has become a face that you can consistently see across mapsets, whether it be as a set owner, guest contributor or Nominatior. With a beginning like this, we're hoping to see an incredibly impressive 2019 from him!"},{"username":"alienflybot","userId":636114,"isRookie":"FALSE","commenter":"Spectator","comment":"Despite having a few Ranked sets in 2018, it was the inspirational beatmap for \"Yooh - salvation\" by alienflybot that broadened the field of mapping, highlighting the potential of hyperdashes within sliders and many other gimmicks, will be remembered for a long time as an historical achivement. Not only trying to keep patterns unorthodox, he knows how to retain his sense of aesthetics and make patterns that correspond well with the song. It is still too early, however, to end the talk of his achievements. As a prominent member of Beatmap Nominators, he accepted the challenge of nominating highly challenging maps as possibly the most skilled player within the team, which has definitely been beneficial to the community. Astonished with his upswing in mapping skills and activity as a Nominator, we have no choice but to expect more great things from AFB in 2019."},{"username":"Ascendance","userId":2931883,"isRookie":"FALSE","commenter":"Sanyi","comment":"Do you remember when Ascendance absolutely dominated the osu!catch mapping scene in 2017? Well, In 2018, he outperformed not just all other mappers but even eclipsed his own performance from last year with such ease that it seems almost unbelievable. His achievements are almost endless: over 100 Ranked difficulties alone in 2018, the Ranked mapset with the most difficulties (\"League of Legends - Hanami ON THE RIFT (PV ver.)\") and many more. In 2018 he became a true mapping connoisseur; the variety of beatmaps he created is incredible. When you look at beatmaps like \"Akiyama Uni - Kanpan Tasogare Shinbun\", \"Black Hole - Pluto\", \"RoughSketch feat. DD \"Nakata\" Metal - Booths of Fighters (Camellia's \"Barrage of Flurries\" Remix)\", \"Culprate & Au5 - Impulse\" and \"Function Phantom - Euclid\", how can you not be envious of his skills and achievements after seeing these beatmaps? Additionally, his contribution in 2018 extends even beyond his mapping, rejoining the Beatmap Nominators to check and nominate an incredible number of mapsets. He established the \"Ultimate Catch Mapping Contest\", which has run three iterations, featuring a number of participants putting forth many very interesting entries. He set up and maintained a Discord server for osu!catch mappers and modders that has already grown to over two hundred members, allowing mappers to meet new community members and to receive assistance with their many mapping and modding related questions. Perhaps most impressive is the fact that despite everything just mentioned, Ascendance has already showed that there is still much he wants to accomplish, so I am very excited to see what he can achieve in 2019."},{"username":"Benita","userId":4023183,"isRookie":"FALSE","commenter":"alienflybot","comment":"Widely recognized as Benny- (or BennyBananas), Benita greatly contributed to the osu!catch mapping field last year. In 2018, Benita managed to rank seven mapsets and numerous guest difficulties. A great fan of Touhou doujin circles (most notably FELT), Benita paired up with other enthusiasts such as JBHyperion and Spectator to compose and push many of these impressive beatmaps to Ranked status. It is recommended to check out “FELT – Songs Compilation”, a collaboration between Benita and Spectator, as their effort of mapping a ten-minute long medley should be highly appreciated. Benita’s renditions always demonstrate solid mapping structure, with patterns being used expertly to emphasize different sections of the music. Two sets of hers which showcase this conclusively are “Lindsey Stirling – Senbonzakura” and “fhana – Genzaichi”. Expect more great work from Benita in the near future!"},{"username":"BoberOfDarkness","userId":3427748,"isRookie":"FALSE","commenter":"wonjae","comment":"Being both a long time player and mapper, in 2018 BoberOfDarkness finally managed to rank his beatmapset for “Halozy - Snow Changes to a Beat Again” after a period of inactivity seen in the previous year. Mapping the Overdose, Salad and Platter in that mapset, Bober showcased his proficiency in mapping across all skill levels. The beatmap itself is both easily accessible and fun for any player, regardless of skill and is expertly structured in accordance with the song. The [Blizzard] difficulty in particular is filled with tons of slow sliders that will challenge any seasoned rain player, creating a short yet unique experience that I would love to to see more of in 2019."},{"username":"celerih","userId":4696296,"isRookie":"FALSE","commenter":"Ascendance","comment":"celerih truly lived up to the hype as the \"Most Promising\" mapper for 2018 in last year's edition of the Mapper's Choice Awards. While not ranking the most maps, those he put out were far above the quality you'd expect from someone who'd just started mapping a year prior, but if you truly knew celerih's potential as a mapper, it shouldn't have come as a surprise. Among some of my personal favorites was his set of \"Eisyo-kobu - Oriental Blossom\", which most people thought would be overshadowed by Spectator's larger set of it earlier in the year. However, upon playing it, you could really tell that celerih had not only lived up to expectations, but surpassed them. While celerih unfortunately retired from the osu!catch Beatmap Nominators and from osu!catch mapping and modding in general late last year, I think a large majority of people would be happy to see a guest difficulty or two from him reach Ranked status in the upcoming year."},{"username":"chickenbible","userId":2306637,"isRookie":"TRUE","commenter":"JBH","comment":"Despite being well-known as a world-class fruit catcher to almost anyone, it may come as a surprise to know that chickenbible has experimented on the periphery of the mapping scene for almost three years now. After slowly but steadily gaining experience and confidence, 2018 was the year chickenbible rose to find his first success as a Ranked osu!catch mapper, achieving an impressive medley of two Ranked guest difficulties, a Ranked spread and an Approval-length beatmap in the last quarter of the year. As someone who is highly motivated and leans more towards less-conventional mapping styles and techniques, with a little patience and further growth, 2019 may bring some rather interesting offerings to the Ranked section with chickenbible's name on them."},{"username":"Cowboy","userId":1237535,"isRookie":"FALSE","commenter":"wonjae","comment":"It was quite the quiet year in the osu!catch mapping scene for Cowboy (formerly known as Jusenkyo). A skillful mapper in all aspects, Cowboy followed up his 2017 year by quietly ranking two guest diffuculties in 2018. Although considerably less in terms of quantity, Cowboy still proved his varied skill pallete in mapping with a Cup for BoberOfDarkness' \"Halozy - Snow Changes to a Bear Again\" mapset, and an Overdose for Ponchiwi's mapset of \"TRONIC - Supervelocidad\", covering two distinctly different songs at opposite ends of the diffuculty spectrum. Someone who is equally skilled in both playing and mapping, I would very much like for Cowboy to make a return to the Ranked section in the coming year."},{"username":"Crowley","userId":6341006,"isRookie":"TRUE","commenter":"JeirYagtama","comment":"Despite the difficulties new mappers usually face when learning their game mode, Crowley is a mapper that forgoes the easy routes and frequently prefers to tackle challenging marathon or approval-length songs, as shown in his Ranked beatmaps of \"DragonForce - Seasons\", which leans more on challenging long stream patterns, as well as \"IV OF SPADES - Mundo\", which focuses more on low approach rate readability. Overall, Crowley has made a name for himself in the osu!catch mapping community as someone not afraid to tackle even the toughest challenges, and surely has blooming potential for this 2019 with more great works to come!"},{"username":"cursedcookies","userId":3973549,"isRookie":"TRUE","commenter":"JBH","comment":"An individual who has flown almost entirely under the radar in 2018 for the obvious reason that their only contribution to the osu!catch Ranked section was a collaborative effort on the Cup difficulty for MBomb's \"Yura Hatsuki - TRICK or TREAT\". At just over 30 seconds long and reaching Ranked status on the second day of the year there really isn't much to remember cursedcookies by, or to indicate when (or even if, since there haven't been any further submissions from cursedcookies to date) a return may occur. If nothing else, the aforementioned mapset has some amazing difficulty names, so check those out if nothing else!"},{"username":"cyanine","userId":4994598,"isRookie":"FALSE","commenter":"wonjae","comment":"From a single Rain collaboration on Ascendance's \"Vanic - Samurai (Spirix Remix)\" beatmapset in 2017, to having four diffuculties in the Ranked section in 2018, cyanine (previously Californian) proved to be knowledgable in mapping across all diffuculties from Cups to Rains last year. Having worked with him personally on sets such as \"Chito (CV: Minase Inori), Yuuri (CV: Kubo Yurika) - Ugoku, Ugoku (TV Size)\", cyanine is always a pleasure to collaborate with and always manages to teach me new and intresting ways to work the osu!catch editor. It may not be the most apparent, but cyanine is a mapper who is able to showcase a myriad of different skillsets regarding both map structure and patterns, and I wish to see some more Ranked guest difficulties or even hosted mapsets coming from him in 2019."},{"username":"Daletto","userId":7592136,"isRookie":"TRUE","commenter":"Sanyi","comment":"Daletto produced some interesting beatmaps in 2018 after joining the Mapping and Modding Mentorship program this year to improve his skills and understanding. With this knowledge gained he was able to Rank his first guest difficulties, one being a collaborative Cup difficulty with -Nicotine on \"M2U - Wicked Fate\" and the second being a solo Cup difficulty on \"Yuigahama Yui (CV: Touyama Nao) - Hello Alone -Yui Ballade- (TV Size)\". However, he can map far more than just Cups! Whilst not yet reaching Ranked status, I have been especially impressed by his Overdose difficulties, with \"USAO - BroGamer\" being my favorite one so far - it is a hidden gem in my eyes. I'd like to see more from him in 2019!"},{"username":"Dapuluous","userId":8140944,"isRookie":"FALSE","commenter":"Sanyi","comment":"First appearing in 2017, Dapuluous (previously known as Skycreeper-) improved a lot in 2018. Mainly mapping Salad and Platter difficulties initially, he steadily expanded his mapping abilities over the course of the year and is now a solid mapper for all difficulties. As the result of his improvements, he was able to Rank his first two beatmapsets this year - \"Kola Kid - press start\" and \"Yamamoto Mineko - Falling, The Star Light\" - as well as 2 Salad guest difficulties (\"Yuigahama Yui (CV: Touyama Nao) - Hello Alone -Yui Ballade- (TV Size)\" and \"Mami Kawada - L'Oiseau bleu\"), in which his flow execution in lower BPM songs really stands out. His newest maps, \"Poppin'Party - Tokimeki Experience! (TV Size)\" and \"Roselia - LOUDER\", are really promising, so I am sure that he can achieve even more in 2019. I am looking forward to it!"},{"username":"Deif","userId":318565,"isRookie":"FALSE","commenter":"MBomb","comment":"Once again, Deif has not failed to impress us with his amazing performance in ranking beatmaps this year, matching and possibly even surpassing his previous levels with challenging creations of outstanding quality. He started off the year strong with \"Memme - Force of Ra\", a full spread fully mapped by himself, which had his unique style mixed with the intense song choice to make for a challenging top difficulty, as well as consistently well mapped lower difficulties, showcasing his mastery of the game mode. Throughout the year, he continued to repeatedly match this quality through his extraordinary talent for adapting songs not only to fit his style, but accompany it with incredible levels of accuracy to the song. To me, his final map ranked this year, another spread solely mapped by him for \"LeaF - Alice in Misanthrope -Ensei Alice-\", fully displays what is so breathtakingly beautiful about his style, through very unique use of symmetry combined with surprisingly difficult yet fun patterns, which makes me very excited to see what maps he will make next, going into 2019."},{"username":"eiri-","userId":3388410,"isRookie":"TRUE","commenter":"MBomb","comment":"As someone who had previously had a Ranked map in osu!, osu!taiko and osu!mania, it was only natural that eiri- would inevitably choose to map the final (and best!) game mode eventually. Her first contribution came this year in the form of a Platter difficulty for the cut version of \"Sporty-O - Let Me Hit It (Audiostalkers Original Mix)\", which relied on interesting stream patterns combined with consistent hyperdash usage, and a noticeable increase in difficulty as the song repeats. Whilst it may appear only as a small addition to the game mode, having managed to reach Ranked status is still a small step in the larger scale of improving as an osu!catch mapper. Whilst she has yet to push much else in terms of osu!catch beatmaps for Ranked status, next year has more possibilities for her to attempt to continue this journey."},{"username":"Error-","userId":3378391,"isRookie":"TRUE","commenter":"JBH","comment":"A reasonably established osu! mapper, Error- decided to throw their hat into the osu!catch ring during the second half of 2018 in submitting a modest offering of guest difficulties. Of these, one reached Ranked status, this being a Cup difficulty on \"Ling Yuan yousa - Hoshi to Kimi ga Kieta Hi\". This doesn't seem to be a simple fleeting interest however, as additional osu!catch guest difficulties and an (almost) completed spread have recently been uploaded also. Whilst still inexperienced, Error- has been very receptive of advice and criticism, and should see further improvements and returns in 2019 regardless of how they balance their focus between osu! and osu!catch."},{"username":"F D Flourite","userId":2459589,"isRookie":"TRUE","commenter":"alienflybot","comment":"F D Flourite is a mapper full of gimmicks and new ideas. Devoting herself to the 2018 osu!catch World Cup as part of the map selection team, F D Flourite constantly offers HD reading challenges, typically consisting of cruel difficulty settings, tricky patterns and complex flows, such as “kanonxkanon – Calendula Requiem”. As F D Flourite focused on promoting tournament-styled maps, she was slightly less active in the Ranked section of osu!catch in 2018, pushing only “Mamoru Miyano – Canon” to Ranked status. Despite this less \"Rank-oriented\" approach, innovative maps from F D Flourite are definitely a great addition to our collections and am looking forward to seeing more of her groundbreaking mapping projects very soon."},{"username":"Fii","userId":3922569,"isRookie":"FALSE","commenter":"Ascendance","comment":"Considered to be one of the most aesthetically pleasing mappers in osu!catch, Fii came off of a hot 2017 year looking to continue just that in 2018. Early in the year, Fii promoted two of her own sets, which included \"t=NODE - Four Seasons, an eight minute map that had no lapse in quality at all and a beautiful storyboard made by herself as well. Her impressive contributions towards the first half of the year paired with her entry into the Beatmap Nominators, but sadly both came to a halt after her activity began to wane and she moved away from osu! to focus on out-of-game matters. While she no longer maintains the activity that brought her to popularity in previous years, her mapsets and difficulties are still looked on as incredibly high quality, and there are definitely people looking to the future for a prospective return."},{"username":"Hareimu","userId":4138746,"isRookie":"FALSE","commenter":"Sanyi","comment":"With 21 difficulties in total, Hareimu contributed significantly to the Ranked section in 2018. He showed us once more that he can map difficulties of any kind - from very relaxing and easy maps (like \"Jijjin - pi\" and \"Nishiki Yasunori - Stolen Dreams, Lost Light\") to intensely challenging ones such as (like \"Camellia - ill intelligence\"). Hareimu maps with such a clear and straightforward style that it blows my mind, making him one of my role models for emphasis. On top of that, his patterning is easy-to-grasp, yet varying enough to make his maps always fun to play. He was also a Beatmap Nominator in early 2018, providing mappers with reliable checks on their mapsets and also helped out fellow mappers with his guest difficulties, timing workshop and much more, making him a huge gain for the community. I love his beatmaps (especially his harder ones), so I hope to see more maps from him in 2019!"},{"username":"IDu5t","userId":6053071,"isRookie":"TRUE","commenter":"Sanyi","comment":"IDu5t is fairly new to the mapping community - when I saw his \"ryo (supercell) feat.chelly - Great Distance\" beatmap in the Pending section back in September 2018, he had no notable connections to speak of and was almost completely unknown. Seeing potential in his mapping, I introduced him to the community, and since then he has impressed me even more than I expected! Though he struggled with lower difficulties in the beginning, he kept improving at an exponential rate and by the end of the year he had already Ranked a full-spread solo mapset (\"Ling tosite sigure - abnormalize (TV Size)\") and two guest difficulties (a Platter on \"Itou Kanako - Hacking to the Gate (TV Size)\" and an Overdose on \"Memme - Blessing Snow\"), in which he combined good emphasis with easy-to-grasp yet interesting patterning. He is also an incredibly active modder who always has useful suggestions, and these efforts have recently been rewarded with a rapid promotion to the Beatmap Nominators. With his Pending section and beatmap Graveyard overflowing with great maps, at his current rate of improvement, he can become something huge in 2019."},{"username":"JBHyperion","userId":4879508,"isRookie":"FALSE","commenter":"Nelly","comment":"JBHyperion is a mapper who needs no introduction. A winner of Mapper's Choice 2017, a former QAT leader, a commentator for osu!catch World Cup for 2 years now, and a \"Professional Chair Thrower\". This guy is simply amazing. He often tends to experiment with various styles like \"No Hyperdashes\" or \"Antimeta,\"  bringing an additional challenge for a player, on maps such as Akitan - Prayer and hsi guest difficulty for Akiyama Uni - Kanpan Tasogare Shinbun. However, he also has other projects which blew up the osu!catch scene like Halozy - 143 (extended mix), a 7 minute marathon with a full mapset spread featuring very few additional contributors to the set. Not to mention he also won the Ultimate Catch Mapping Contest II by Ascendance for his map of lapix - Good Time ft. Mayumi Morinaga, an extreme map with dozens of patterns to play. I personally can't wait for a serious comeback to see his full potential in all spheres of the mapping scene in 2019, and I believe that he can showcase even more than he has."},{"username":"JeirYagtama","userId":7483452,"isRookie":"TRUE","commenter":"Spectator","comment":"Despite only Ranking his first beatmap this year, JeirYagtama accomplished a great deal both as a mapper and Beatmap Nominator in 2018. His variation as a mapper, in particular, is amongst the best in the game mode, and shows how fast he has achieved growth and experience with a variety of styles. Not only producing a clean maps like \"Hoshii Miki (CV: Hasegawa Akiko) - GO MY WAY!!\", he also managed to create gimmicky and more unique projects such as \"Mili - Gertrauda\", which adopted the idea of using low slider tick rates to make droplets more exciting, bucking the trend of most osu!catch maps that employ tick rate 2. Members of the community are frequently appreciative of his ardour and dedication as both a modder and mapper, and we will also looking forward to his continued growth in 2019."},{"username":"Kin","userId":480689,"isRookie":"FALSE","commenter":"JBH","comment":"Kin, rather impressively, achieved multiple Ranked difficulties in three different modes in 2018. His two offerings in osu!catch came in the form of a pair of Overdose guest difficulties in March and April, which brought a greatly appreciated variety to the Ranked section. Perhaps even more impressive however, was Kin's return to the Ranked category for osu!catch for the first time in over four years! First appearing in the Ranked category in late-2013, Kin is one of the few mappers from those early times who have managed to successfully adapt to the significant meta evolution and expectation of quality over such a long period of time, but has thankfully managed to retain much of the old-school charm."},{"username":"Kyuare","userId":2705312,"isRookie":"FALSE","commenter":"Nelly","comment":"Kyuare's mapping activity was only slightly increased compared to 2017, but he nonetheless provided some astonishing maps to the Ranked section like \"Zektbach - Turii ~Panta rhei~\" and his rendition of \"Imperial Circus Dead Decadence - Uta\". On top of those, he appeared as a valued guest contributor in mapsets like \"League of Legends - Hanami ON THE RIFT\" and a collaboration difficulty on \"a_hisa - Tokei no Heya to Seishin Sekai\", showcasing his wide range of skills and interests. Although Kyuare certainly prioritises quality over quantity in his mapping, hopefully he can be more active in 2019 and deliver both!"},{"username":"lulu lemon","userId":3187491,"isRookie":"TRUE","commenter":"MBomb","comment":"lulu lemon is a mapper who has been heavily involved in the modding and mapping scene for multiple years now, also known under his previous name of klonoa; however never managed to finish fully pushing a map to get it to Ranked status. However, that all changed in 2018 with a map of \"Erik \"Jit\" Scheele - Negastrife\", an interesting and unique marathon collaboration with Elite Mapper Ascendance that flew under the radar in terms of popularity, but was definitely high in terms of quality. This map was something which to me stood out as very unorthodox, yet still fundamentally enjoyable and well fitting to the song. The intensity of the piano track is matched with some quite difficult edge dash patterns, as well as a variety of buildups and wind-downs to match the changing pace of the song. I hope to see lulu lemon continue across this path, and maybe push another beatmap or two towards the Ranked section in 2019!"},{"username":"MBomb","userId":3071175,"isRookie":"FALSE","commenter":"Sanyi","comment":"Despite being rather inactive for the majority of the year, MBomb delivered quite a few maps in 2018. He showed once more that he can map all kinds of difficulties, for all kinds of songs, leading to a unqiue and varied portfolio of Ranked beatmaps. Outstanding is his contribution of top quality Salad and Platter difficulties to the Ranked section, in which he combines clear emphasis and easy-to-grasp, yet varying patterning, proving once more that he is one of the best low difficulty mappers around. Since he has become considerably more active since late 2018, we can expect to see more great maps from MBomb in 2019. I am looking forward to it!"},{"username":"Minato Yukina","userId":531253,"isRookie":"FALSE","commenter":"Spectator","comment":"A famed mapper who burst onto the osu!catch stage in 2015, Minato Yukina (formerly known as CLSW), has made a resurgent comeback in 2018, once again showing his still outstanding mapping skills and even more clean structures, with the creations such as \"orangentle / Yu_Asahina - HAELEQUIN (Extended ver.)\" and \"KASAI HARCORES - Cycle Hit\" reaching Ranked status last year. Having earned a reputation for mapping uniquely challenging beatmaps that test even the most experienced players to their very limits, he has continued expanding his field of mapping with some more technological advancements in his recent maps. As a mapper who is always loved for his own unique style, I hope that he will revitalize the community through continuous and conspicuous activities in 2019."},{"username":"murutattack","userId":4480237,"isRookie":"FALSE","commenter":"Ascendance","comment":"After a quiet 2017 for murutattack, he returned in 2018 with a single Ranked beatmap. This map, which introduced a new Ranked mapper in YukaRei, provided two unique difficulties featuring challenging reading, funky stream shapes and smaller circles. Even though there were no other offerings from murutattack, considering the beatmap brings a unique and satisfying experience each time, we’ll be glad to see more in the future!"},{"username":"Myle","userId":4915649,"isRookie":"FALSE","commenter":"Nelly","comment":"Myle didn't let anyone down this year, bringing to us more of his perfectly balanced beatmaps after Ranking his first in 2017. Though he was not that active in the ranking process in 2018, during his improvement upon the previous year he managed to produce some outstanding offerings such as \"yanaginagi - Haru Modoki\" and \"xi - Happy End of the World\", as well as guest difficultiess on \"Mili - Vulnerability\" and \"DJ TOTTO feat. Enako - Precious * Star\". Both of these difficulties have expertly-organised flow and play very well in general. Hopefully he'll be able to balance his real life responsibilities and his mapping career in the upcoming year!"},{"username":"Nanachii","userId":6995506,"isRookie":"TRUE","commenter":"Sanyi","comment":"Nanachii (formerly known as \"kotnana3131\") showed us this year that hard work and perserverance indeed pays off. He joined the Mapping and Modding Mentorship Program as a complete newbie. Always asking for help and feedback, never too lazy to apply huge mods or even to entirely remap the his creations when not happy with them. As a result, he became quite a competent mapper within just a year. His Rain difficulties stand out the most, which can be seen in his Ranked beatmaps - a marathon Rain difficulty for \"Rezonate - The Phoenix\", which provides an interesting structure and very fitting usage of sliders, as well as 2 Rain guest difficulties ( a collaborative effort with JeirYagtama on \"M2U - Wicked Fate\" and a solo offering on \"Lindsey Stirling - Senbonzakura\"). If he maintains his hard-working attitude, he will surely become a very good mapper for all difficulties and pump out some cool maps in 2019!"},{"username":"Nelly","userId":4741164,"isRookie":"FALSE","commenter":"Sanyi","comment":"With only 1 Ranked difficulty at the beginning of the year, Nelly surprised many of us with his huge improvements in 2018. Through hard work and perserverance, he became an accomplished mapper for every kind of difficulty, which resulted in an impressive haul of 23 Ranked difficulties by the end of the year. He was able to finally push some of his passion projects (\"ensou ft. GUMI - Coma\" and \"Hanatan - If\") and gained a lot of recognition in the mapping community, making 2018 a hugely successful year for him. What stands out the most in his maps for me is his flow usage - it matches the expected intensity almost perfectly, making his maps very enjoyable to play. I'd really like to see a solo mapset for a long song from him, as well as potentially a marathon Deluge difficulty - maybe he can surprise me with one (or even both) of those in 2019!"},{"username":"Ollapeu","userId":2064505,"isRookie":"FALSE","commenter":"JeirYagtama","comment":"Whilst not being the most active mapper in osu!catch, Ollapeu gave me a new perspective on Rain difficulties in 2018, with his mapset of \"JUN. K - love letter remix\", helping to show that combining unusual patterns with good rhythm selection and interesting aesthetics creates a significant positive impact for people playing it. Additionally, his work allowed me to appreciate different song choices and made me more open-minded about what I feel able to and comfortable with mapping. I hope that he can continue to maintain that for all of us in 2019."},{"username":"P i k u","userId":2761685,"isRookie":"TRUE","commenter":"Sanyi","comment":"Piku is a mapper well known for his impressive Rain difficulties, and despite his rather low activity throughout 2018, he managed to push quite a few such difficulties on beatmapsets including \"Halozy - 143 (extended mix)\", \"Mili - Vulnerability\" and others. His beatmaps are so consistent and accessible that they impress me every time! However, Piku's biggest success in 2018 was Ranked his mapset for \"Helblinde - Above the Clouds\", this being not only his first Ranked mapset, but also his firstRanked Cup and Platter difficulties as well. It is unknown how active he will be in 2019, but I'll be glad to see more beatmaps from him!"},{"username":"Ponchiwi","userId":1089040,"isRookie":"FALSE","commenter":"Sanyi","comment":"Ponchiwi expanded his ranked song genres this year - mainly known for his refreshing Spanish rock songs such as \"TRONIC - Supervelocidad\", he also reached Ranked status with some anime themes including \"ULTRA TOWER - Kibou no Uta (TV Size)\" and his guest difficulty on \"Aqours - Yuuki wa Doko ni? Kimi no Mune ni! (TV Size)\". This came in addition to his guest difficulty for Ascendance's monster set of \"League of Legends - Hanami ON THE RIFT (PV ver.)\", showcasing his expanse into the videogame genre. He uses many different angles and curves not found in other mapping styles, as well as quite a large number of vertical sliders - this makes his flow usage different from many other mappers, leading to a unique and refreshing gameplay experience. I hope to see more maps from him with uncommon song genres in 2019!"},{"username":"Razor Sharp","userId":3414261,"isRookie":"FALSE","commenter":"alienflybot","comment":"Being one of the top-tier fruit catchers, Razor Sharp is keen on creating truly challenging maps that offer eye-opening and thrilling game experience to hardcore players. In 2018, three marathons from Razor Sharp were introduced to the Loved section. Among these renditions, I particularly enjoyed “Ata – Euphoria”, which comprises various stream patterns and beat snap usage. Daredevils may find “Spawn Of Possession – Apparition” interesting too, as it pushes beyond the limits and provides finger-breaking challenge to players at the very highest echelons of skill. As Razor Sharp is competent to craft hard maps, his difficulties are also found in several Ranked beatmapsets, notably “Black Hole – Pluto” and “U1 High-Speed – EGOISM 440”. Seeing newly submitted maps that showcase a wide range of gimmicks, a breakthrough in osu!catch mapping is expected from him in the future."},{"username":"rew0825","userId":2488026,"isRookie":"FALSE","commenter":"JBH","comment":"After making their debut in the Ranked category in 2017, rew0825 made significant strides last year to build on that initial success. 2018 brought us two guest difficulties and two full spread mapsets, including \"nao - Towa naru Kizuna to Omoi no Kiseki\" - a past feature from the 2017 osu!catch World Cup Grand Finals that we're pleased to see finally get the wider recognition it deserves. Whilst they typically prefer to shy away from the spotlight and quietly produce great content, rew0825 has been steadily growing both in experience and popularity, and we hope that continues into 2019 and beyond!"},{"username":"Rocma","userId":566276,"isRookie":"TRUE","commenter":"JeirYagtama","comment":"Rocma is well known as a top-tier player, and despite having struggles with mapping for the Ranked section in the past, he has always managed to produce unique content for the upper reaches of the player base that give many good impressions of his polished mapping. While having no Ranked sets of his own last year, his Ranked guest difficulty from Ascendance's \"Memme - Blessing Snow\" that he has the full potential to be a great mapper of his own with his understanding of aesthetics and flow. 2019 already looks like a breakout year for Rocma, and I look forward to seeing him reach further in giving his best to create more interesting content over the rest of the year."},{"username":"RoseusJaeger","userId":6709840,"isRookie":"FALSE","commenter":"wonjae","comment":"Despite not being the most skilled player, RoseusJaeger (now known as Wei Wuxian) proved to be quite the force when it comes to mapping Overdose difficulties in 2018. From their \"Rib - Akaito\" marathon difficulty, to their collaborative mapset of \"OLDCODEX - Dried Up Youthful Fame (TV Size)\", Roseus showed strength in mapping a wide variety of songs and styles, challenging both endurance and reaction speed. Already being an accomplished mapper at other diffuculty levels, I am excited to see Wei Wuxian grow and produce more great content within the osu!catch mapping scene in 2019!"},{"username":"Sakary","userId":2984583,"isRookie":"TRUE","commenter":"Nelly","comment":"Previously known as Hi_Hello, Sakary had a breakout year in 2018 after steadily building in experience and confidence for many years. Right now he's well-known for mapping under-represented Filipino (Tagalog) and Thai songs for rank such as \"Sam Concepcion - 1SANG Daan\", \"Inigo Pascual - Dahil Sa'Yo\", and \"Lipta - Ok Tua\". All of these maps are playable and enjoyable for players of all skill levels, so anyone can experience clean, familiar patterning and structure through his maps. He's also featured on two collabartive difficulties, these being for \"ensou ft. GUMI - COMA\" and \"M2U - Wicked Fate\". All of this that I've mentioned is only the beginning for him in the osu!catch Ranked section and we should expect to see his full potential in the upcoming year."},{"username":"Sanyi","userId":7496029,"isRookie":"TRUE","commenter":"alienflybot","comment":"Sanyi has been incredibly supportive of fellow mappers in the osu!catch community, contributing many guest difficulties to fill beatmap spreads, as well as providing substantial assistance to improve others’ work. Ten guest difficulties from Sanyi were Ranked just in the past year, earning him recognition as the mapper with the most Ranked guest difficulties without any Ranked sets. Sanyi has vast experience in creating various difficulties, ranging from Cups featured in sets like “Black Hole – Pluto” to Rains such as “u’s – Angelic Angel (Movie Edit)”. Sanyi tends to follow vocals and instruments closely and applies easily-recognizable rhythms in the making of his difficulties. He also puts gameplay into consideration, ensuring that the flow and patterns are clear, lenient and most importantly, fun to play. Will Sanyi achieve his first Ranked set in the coming year? This question certainly provides food for thought."},{"username":"Sc4v4ng3r","userId":4838429,"isRookie":"FALSE","commenter":"JBH","comment":"Sc4v4ng3r was one of 2017's fastest improving mappers, but was sadly unable to realise his full potential in 2018 following a lengthy break from osu! to focus on his career. Thankfully, he's managed to find some time to return towards the end of the past year and doesn't sem to have missed a step, adding a Ranked Rain guest difficulty in December to his collection. Even in a near total absence from the game however, Sc4v4ng3r's work has found a way to reach the spotlight, with a further Rain guest difficult collaboration, and amazingly, even a full spread of difficulties on \"Tomita Miyu, Onishi Saori, Ohzora Naomi, Hanazawa Kana - Gabriel Drop Kick\" hitting Ranked in the late Spring thanks to help from the community. This show of goodwill is a testament to both the lasting quality of Sc4v4ng3r's maps, as well as his extremely likeable nature. Here's hoping that 2019 has enough free time for a resurgence from the former Beatmap Nominator."},{"username":"Seija","userId":6443263,"isRookie":"TRUE","commenter":"wonjae","comment":"Sejia has made quite the entrance into the Ranked section this year through their “Nekomata Master feat. Shimotsuki Haruka - Element of SPADA” marathon difficulty. Although new to the nomination process, it’s obvious that Seija is no novice mapper, having crafted plenty of challenging and technical Overdose difficulties, as his experience is showcased brilliantly throughout the beatmap. The difficulty itself is well-structured and carefully considered, able to provide a challenge for even the most seasoned of players by encompassing a wide range of patterns and rhythms. Seija has proven that they can map Overdose difficulties at a high level, and I hope to see more such maps and perhaps even sets remain out of the graveyard and find their way into the Ranked section this year."},{"username":"Shad0w1and","userId":798668,"isRookie":"FALSE","commenter":"Nelly","comment":"Most people would recognise Shad0w1and as an osu! mode mapper and from his significant contributions to video encoding, but I believe that the majority of people don't know about his mapping scene in osu!catch. Indeed, he made a few fruity difficulties that reached Ranked status last year - one of them is from 2016, which is \"Yoshino Nanjo - Kimi o Sagashi ni\", and the most recent of his career is \"Miku Sawai - Colorful. (AnimeVer.)\" in collaboration with Ascendance. Whilst not the most innovative, technical or complex creations, Shad0w1and is a mapper who has a reputation for making high quality beatmaps, and to see him translate this ability into osu!catch demonstrates his skill and understanding. Hopefully he'll remain involved in the osu!catch scene and can provide a few more beatmaps for this game mode in the upcoming year!"},{"username":"Sinnoh","userId":4236057,"isRookie":"FALSE","commenter":"JBH","comment":"Following on from an impressive debut year in 2017, Sinnoh was statistically one of the most active osu!catch mappers of 2018, contributing 48 Ranked difficulties across a wide spectrum of genres and mapping styles. Possessing a taste for the less conventional, Sinnoh has made a concerted effort to push the boundaries of osu!catch mapping over the past year, as both a mapper and Beatmap Nominator, and has been mostly successful in doing so. With a highly motivated work ethic and a good deal of experience, Sinnoh has become somewhat of a \"jack-of-all-trades\" in the osu!catch mapping scene, so rarely does anything with his name attatched to it fail to make a positive impact."},{"username":"Sorcerer","userId":1913190,"isRookie":"FALSE","commenter":"JBH","comment":"Despite taking a significant period of time away from osu! in 2018, Sorcerer bookended the year with a Ranked beatmap in both the first and last months, as well as a trio of guest difficulties to match his quantity of contributions from 2017. Despite departing from the Beatmap Nominators in June, the experiences gained seem to have had a significant positive impact on Sorcerer's work ethic and quality, as it is now extremely rare to see a beatmap submission from him that has not already undergone substantial self-scrutiny and polish before reaching the public eye. Regardless of whether he continues with this careful and meticulous mapping nature, or decides to spread his wings, 2019 should be a very successful year for Sorcerer."},{"username":"Spectator","userId":702598,"isRookie":"FALSE","commenter":"alienflybot","comment":"2018 was undoubtedly a fruitful year for Spectator, the most prolific of his now seven year mapping career. Twelve ranked sets, more than twenty Ranked guest difficulties, and even the coveted “Elite Mapper: Aspirant” title emphasizes the incredible accomplishments of Spectator in the previous year. Despite his lasting reputation and popularity, Spectator always tries to step out of his comfort zone and expand his expertise. Aside from the difficulties with conventional style of mapping such as “LiSA – EGOiSTiC SHOOTER”, Spectator headed on to craft state-of-the-art maps, each of them emphasizing creative gimmicks: “M2U – Stellar” for example does not include any hyperdashes, whereas “Culprate & Au5 – Impulse”, a collaboration project with Ascendance features quick movements and burst streams. Also Ranked in the past year, “OISHII – ONIGIRI FREEWAY” is another golden offering that you won’t want to miss out on, as it is the winning entry of the Aspire 2017: osu!catch! contest. Whilst Spectator is unfortunately expected to be absent for most of 2019 due to his service as part of the national Air Force, his inevitable comeback in June 2020 will be long-awaited!"},{"username":"tasuke912","userId":2774767,"isRookie":"TRUE","commenter":"alienflybot","comment":"As an osu!taiko mapping veteran and long-standing tournament champion, tasuke912 has a firm understanding of what a good map should be. In light of this, he is also able to design high-quality fruit-catching maps on par with high modern mapping standards. tasuke912 often gain insights from other experienced mappers such as Spectator and Minato Yukina, and will likely soon develop a unique mapping style of his own characterized by smooth flow and great visuals. Renditions such as \"Suzuki Konomi – Redo\" and \"yanaginagi – here and there\" are just too good to be missed! Watchful eyes should be on him in the upcoming osu!catch mapping field."},{"username":"Tenshichan","userId":1101600,"isRookie":"FALSE","commenter":"chickenbible","comment":"Tenshichan is one of those old names that you see and you remember as a veteran presence in the osu!catch scene. Starting his journey out in 2013, Tenshichan still continues to provide quality offerings to the osu!catch mapping scene with works such as his iconic marathon \"Nekomata Master feat. Shimotsuki Haruka - Element of SPADA\" as previously featured as a TieBreaker in the 2017 osu!catch World Cup. With his beatmaps, Tenshichan brings an unrivaled amount of flow and smooth gameplay for all skill levels of play. Regardless of difficulty, you can be assured that when you see a Tenshichan beatmap, you know that you're bound for a high quality, enjoyable experience ."},{"username":"Tyrell","userId":4598862,"isRookie":"FALSE","commenter":"wonjae","comment":"Although considered an older mapper whose activity is very much inconsistent nowadays, Tyrell remained on the periphery of the Ranked section in 2018 by participating on the Rain difficulty for \"Chito (CV: Minase Inori), Yuuri (CV: Kubo Yurika) - Ugoku, Ugoku (TV Size)\" alongside cyanine and myself. Known for being a remarkably consistent and well-structured mapper of lower diffuculties, it is only natural that his contributions to the mapset would follow suit. With a slight resurgence in activity and some minor adaptations to a much more modern mapping style, I can totally see Tyrell becoming the renowned mapper he can be. Hopefully this wasn't the last we'll see from him in the osu!catch ranking section over the coming months."},{"username":"Vincs","userId":2026299,"isRookie":"TRUE","commenter":"JeirYagtama","comment":"As a veteran player but relatively inexperienced mapper, Vincs has given a breath of fresh air regarding new patterns and gimmicks with his first Ranked map \"PUSHER - Feel U\". As the winner of a 2017 Mapping and Modding Mentorship contest, Vincs' entry managed to impress the vast majority with his unique take on rhythm and patterning. Not only does Vincs draw out unorthodox and anti-meta patterns, but he also retains the eye candy aesthetics that anyone will look for and delivers the satisfying punch of achievement when playing. With that being said, let's hope he will deliver more impressive content in 2019!"},{"username":"WildOne94","userId":3482692,"isRookie":"FALSE","commenter":"JBH","comment":"WildOne has never been a mapper of quantity, but makes up for this by pouring everything into one or two mapsets to create high-quality spreads for longer songs in less well-represented genres that everyone can enjoy. 2018 was no exception, as we kick-started the year with his stream-centric rendition of \"WRLD - By Design\". For the remainder of the year, WildOne has been crafting two further mapsets that we will likely be talking about next year: \"Muzzy - Crescendo (feat. MYLK)\", a labour of love that featured in the 2017 osu!catch World Cup, and the much newer (and funk-tastic) \"Glacier - Neos\"."},{"username":"Withered Lotus","userId":3546931,"isRookie":"FALSE","commenter":"MBomb","comment":"Withered Lotus is a mapper that manages to consistently find an innovative method to express songs, but in a way that still follows the song. His maps, as few and far between as they are in the ranked section, continuously impress me, and both of the difficulties he ranked this year were no exception. His challenging rain for When It Falls was a smooth difficulty, yet filled with antiflow patterns to match the intensity of the song, as well as very interesting stream usage and consistent HDash placements. His second difficulty on the other hand, an overdose for Secret Energy, showed a very strong level of understanding for the usage of antiflow and how to make it extremely enjoyable to play, as well as a nice incorporation of some tight movements. Hopefully we will see more of his difficulties reach the Ranked section next year, and see more of what he has to offer."},{"username":"wonjae","userId":5032045,"isRookie":"FALSE","commenter":"chickenbible","comment":"After several years of trying to break through in the osu!catch mapping and modding scene, wonjae turned a new leaf this year. Following his name change from Paranoid Grapes, and after finally ranking his mapset for \"Chito (CV: Minase Inori), Yuuri (CV: Kubo Yurika) - Ugoku, Ugoku (TV Size)\" after countless months of patience, he quickly pushed onwards to make a name for himself, joining the Beatmap Nominators soon after. There, wonjae has taken on new levels of activity in both mapping and modding, ranking another one of his sets \"Nekomata Master feat. *spiLa* - Clumsy thoughts\", as well as several guest difficulties in a short span of time. Looking towards the future, wonjae could become a great representative for the next generation of mapping and modding within the United States."},{"username":"Xetopia","userId":6689101,"isRookie":"TRUE","commenter":"Nelly","comment":"A newcomer to osu!catch's Ranked section, Xetopia made his name known in 2018 by showing a great deal of potential! Most of his Ranked beatmaps were of songs originating from mobile rhythm games such as Love Live and Bandori, such as \"u's - Angelic Angel\" or \"Poppin'Party - Romeo to Cinderella\". With an incredibly pleasing modern mapping style and wonderful aesthetics, he also managed to sneak onto a few famous mappers' sets like Spectator's \"BUTAOTOME - Gensou no Satellite\" and Ascendance's \"Memme - Blessing Snow\". Thanks to his rapid advancement and understanding of osu!catch mapping, Xetopia can definitely create some awesome maps in the next year, and we're looking forward to it!"},{"username":"YukaRei","userId":4421419,"isRookie":"TRUE","commenter":"Sanyi","comment":"After having been a somehwat experienced beatmapper for a couple of years now, YukaRei (also known as \"breathless\") finally achieved his first Ranked difficulty in 2018! In his Rain difficulty for “Akiyama Uni - Kaoru Juyouka”, he combined good structure and emphasis with fitting wiggling patterns, which lead to a very well executed difficulty. I am also a big fan of his Loved beatmap for \"Halozy - Three Magic (DiGiTAL WiNG TRANCE Remix)\", since it provides challenging patterns that are really fun to play! If he makes some more connections in the mapping community, he will have a good chance to achieve the success he truly deserves in 2019."},{"username":"Yumeno Himiko","userId":1806962,"isRookie":"FALSE","commenter":"JBH","comment":"If the expression \"New Year, New You\" could apply to anyone in osu!catch, it would be Yumeno Himiko. Taking on a new name at the end of 2017, the mapper formerly known as examination had their most successful and consistently productive year yet in 2018, with four Ranked mapsets, two guest difficulties and three storyboards, all produced to an impressively high standard. Yumeno's rapid growth earned them a position in the Beatmap Nominators in June, and they have since continued to improve (and help others to do the same) with each passing month. With a recent activity featuring nothing but beatmap submissions and updates, 2019 could be an even more impressive year for China's most successful osu!catch mapper."},{"username":"ZiRoX","userId":200768,"isRookie":"FALSE","commenter":"Ascendance","comment":"While ZiRoX brought forward only one of his own sets to the Ranked section in \"S-C-U - heron\" this year, he again contributed to a wide variety of Ranked beatmapsets of multiple genres with some of the most flawless guest difficulties. \"S-C-U - heron\" provides an exquisite take on an incredibly hard technique to get right in high CS mapping. This, coupled with his continuous contribution to the osu!catch Ranking Criteria and his promotion to the Quality Assurance Team made 2018 a massive step up for one of the community’s oldest and most respected members."}]