[{"username":"_xyliac","userId":7989480,"isRookie":"TRUE","commenter":"Noffy","comment":"In the event their original storyboarder was not around to fix issues found on their Sunglow map's storyboard, _xyliac was willing to dip their toes in and make fixes themselves, even going so far as to ask fellow storyboarders for help and advice. The final results added a very nice touch to their marathon, and maybe this will be the first of other storyboarding projects they'll take part in? We'll see!"},{"username":"- Frontier -","userId":4314710,"isRookie":"TRUE","commenter":"yaspo","comment":"Sometimes beauty is found in the details, and -Frontier- brings us a great example of that through their collab storyboard on namirin's \"Kanade\". Gentle shifts in hue and background do a wonderful job at matching the gradual rise of the song. Combined with a soothing font, it's hard to not get drawn into the experience. -Frontier- showcases they have a nice touch that we'd love to see more of in the future."},{"username":"-[Koinuri]","userId":1667473,"isRookie":"FALSE","commenter":"yaspo","comment":"While there are many ways to approach storytelling, -[Koinuri]'s storyboard for Mahou Shoujo Ikusei Keikaku's opening \"Sakebe\" has a particularly unique approach. With adorable chat figurines, varied battle effects and a legacy of experience with complex design, we get a cute and dynamic way of showing the story's progress. Hoping to see -[Koinuri] use more of their storyboarding magic this year!"},{"username":"-Aerith-","userId":6136172,"isRookie":"FALSE","commenter":"yaspo","comment":"Sometimes you need a reminder of your favorite show's best moments, and -Aerith- does just that. With a simple storyboard for their own map on \"Moshi Kono Kabe no Naka ga Ikken no Ie dato Shitara\" they effectively showcase how epic the giant battles in Attack on Titan are. We're curious about how they will expand on their storyboarding approach this year!"},{"username":"-Mo-","userId":2202163,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"You may recognize him from his video about storyboarding, or perhaps his videos in general, on mapping and the oddities, but who knew he would be such a competent storyboarder? For his set \"CHiCO with HoneyWorks - Nostalgic Rainfall\", he's done a faithful recreation of the music video, in such grace that it feels like I'm watching it in the comfort of a YouTube video player. Although his main focus is on mapping, he certainly knows his stuff to be able to put together a storyboard on his own."},{"username":"-Tochi","userId":3664366,"isRookie":"FALSE","commenter":"Coppertine","comment":"The pionier of elequint storyboards made through osu!'s Design Editor has made improvements through Storybrew with the creation of byfar's Paradox utilising the famous tunnel effect from Exile-'s Nova sb's and using animated sprites to create a geometric visualisation throughout the song."},{"username":"[ Kuro Usagi ]","userId":997489,"isRookie":"FALSE","commenter":"Noffy","comment":"If you want a storyboard, let me make it\" in this kind of way, [ Kuro Usagi ] has been putting themselves out there in offering storyboards to various mappers, and it shows in how they have made storyboards for 12 whole ranked maps in 2018! They have a certain style to their storyboards that often makes playing experiences all the more intense, and their improvement over the past year certainly shows too."},{"username":"[R]","userId":3577322,"isRookie":"FALSE","commenter":"scub","comment":"With such a simple yet enjoyable style, [R], or more known as Ron, has definitely made good storyboards for the year, especially looking at his most recent stuff! If you're a fan of these simple lyric-picture storyboards, check his stuff out! I promise you'll enjoy them too!"},{"username":"a_point","userId":8519044,"isRookie":"TRUE","commenter":"yaspo","comment":"Although they're only making their debut, with a storyboard for \"HEROES\" a_point shows that they have the fundamentals down. With well-placed fades and particle effects, every section of the song has a visual counterpart. Lyrics and a spectrum on top of that make something that can be a solid base for making their future storyboards perfect to a point!"},{"username":"ailv","userId":6933054,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"Sweeping the ranked section with their plethora of Diao Ye Zong sets, there are a few SBs to be found from the hands of ailv himself. The storyboards are nothing short of wonderful, as whether simple or beyond, they do an excellent job capturing the feel of the music. (Best showcased in his \"Secret Liqueur\" SB or \"Immortal Flame\" SB.) Definitely hoping to see more from ailv were he to continue well SBing into 2019."},{"username":"Ametrin","userId":1588934,"isRookie":"FALSE","commenter":"scub","comment":"Despite only starting in mid-2017, Ametrin definitely has the skills the likes of the bigger and more competent storyboarders! Looking at their better storyboards such as what they've put in Fantastic Magic, it definitely shows! With such complex effect paired with their excellence in visual design, this storyboarder is definitely the definition of underrated, and what I would recommend y'all to look forward to in 2019, as they're making a gigantic project this year that you should NOT ever miss!"},{"username":"arviejhay","userId":145871,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"A storyboarder who's been around since as early as late-2014, they're definitely someone who deserves more recognition for their efforts as they graciously provide their SBs for the lesser known gamemodes, amongst other reasons. With many, if not all of their SBs listed on their userpage, it's certainly a trip to see how much they've improved over the years, with \"Colorful Pastel\" and \"Dahil Sa'Yo\" being the best examples of their overall skills. While they are currently not active in storyboarding because of college, I certainly hope they will come back to it when time allows! Salamat po~"},{"username":"Asonate","userId":2907231,"isRookie":"TRUE","commenter":"scub","comment":"Although Asonate only started ranking their storyboards in 2018, they've already shown great progress in creating simple yet gorgeous storyboards! One of the storyboards they helped develop, \"Nhato - Magic\" originally created by DJNightmare, went from an already great storyboard to one of 2018's best simple storyboards, all with their magical touches! Aside from that, Asonate also has a couple of great storyboards currently in the works, and we can't wait to see what they will being to the table this year!"},{"username":"b00","userId":3929650,"isRookie":"TRUE","commenter":"TheDuckMask","comment":"A brand new face to storyboarding, and already having 2 ranked SBs of his own, b00 is certainly starting out strong, and his SBs only reinforce that statement. Providing the SBs to Nevo's \"Sakura no Uta\" set and his very own first ranked map \"Nanahira - Petals\", b00 has accomplished plenty for someone just starting out, with storyboards that show only a mere glimpse of what he could do were he to continue down this path. Can't wait to see more from him in the future!"},{"username":"Beren","userId":171021,"isRookie":"FALSE","commenter":"scub","comment":"Beren hasn't really been active on osu! since they ranked their last map back in 2014. Despite that, they have occassionally done some storyboards until 2017, and people have brought their works back from the grave. One of them being their work on Yuki no Hana, a cute and compelling storyboard of a minute-long song! With such cutesy and vibeful aura, we can only hope that Beren makes a comeback for storyboarding, or better yet, to mapping sometime in the future!"},{"username":"Bergy","userId":7393632,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"Started storyboarding in late 2016, and has 3 ranked storyboards in 2018. Each with their own flare that reflects a unique style, and truly demonstrates his level of understanding in technical and visual aspects through the various effects shown throughout each piece. Also willing to lend a helping hand to anyone in the storyboarding community, Bergy is certainly a cool storyboarder, who has plenty to provide and while he may not be so active with SBing as a whole anymore, the matter of him being a skillful storyboarder will always ring true."},{"username":"Blizs","userId":3528699,"isRookie":"TRUE","commenter":"scub","comment":"Despite him being rather inactive in recent memory, Blizs has served his time to make a storyboard for one of my maps this year, Matsuri Hate no Hana! With a traditional design, usage of handwritten fonts and a gradative layout behind it, this looked like something people would consider bad. But in my eyes, it was everything I could have wished for, as it reflected the traditional-Eastern style the song gave very well! All in all, I was quite satisfied with it and hoped that he could come back to create more stuff soon!"},{"username":"bossandy","userId":360437,"isRookie":"FALSE","commenter":"Noffy","comment":"A valued member of the \"୧( ಠ o ಠ )୨ Chill Map Assurance Team ୧( ಠ o ಠ )୨\", bossandy's storyboards reflect the same philosophy! Bossandys' storyboards are sweet and simple, especially \"Mo Tian Lun De Yan Lei\" and \"Ni Guang\", two songs from produce 101 where bossandy used images and silhouettes to show you the faces of the girls who were currently singing, alongside other cute effects! Bossandy has been in the community since at least 2012 when he ranked his first map and storyboard, and he shows no signs of slowing doing both in coolness and kindness. Bossandy, keep being awesome!"},{"username":"Card N'FoRcE","userId":3936,"isRookie":"FALSE","commenter":"Noffy","comment":"In addition to mapping the easy difficulty for \"I Love Egg\" (hosted by Nitroz), Card N'FoRcE also supplied a storyboarded speed-up warning in the top difficulty. It's really. Extremely cute. The Cutest Warning I've Ever seen. It also fits really well with the nostalgia the set overall aims for. You're really missing out if you don't see it!"},{"username":"celerih","userId":4696296,"isRookie":"TRUE","commenter":"Noffy","comment":"For the sake of his \"With Triangle\" marathon project, celerih learned storyboarding to be able to add another special something to the experience of playing the map. While it's nothing mindblowing, it's super cool to see him try out storyboarding for the sake of making an awesome marathon that much better :D !"},{"username":"Cheesecake","userId":3700647,"isRookie":"FALSE","commenter":"WildOne94","comment":"The main highlight of Cheesecake's storyboard for \"o!IMC#2 Compilation\" is the introduction. The storyboard is designed well and the animations present are well synced to the song. I feel happy that the SB didn't go overboard and is more about showing the hard work of peoples maps, which really takes the cake. Would love to see more of what Cheesecake has to offer in the future as everything felt clean."},{"username":"Cloudchaser","userId":1576498,"isRookie":"FALSE","commenter":"WildOne94","comment":"Whilst Cloudchaser has ranked storyboards of collaboration names only in 2018 we still get very nice designs and smooth transitions within those beatmaps such as \"TWICE - What is Love?\" mapped by iYiyo. The main part of this storyboarder is the storyboards in which they're working on right now such as the lovely \"Powapowa-P - Strobe Light\" which I am SO excited to see ranked! The lyrics and colour changes all fit very well (and I loved that little smile transition detail hehe). After the final kiai your heart will absolutely melt with lovely message to PowaPowa-P. Don't worry Cloudchaser, I think they would be very proud of you for making this beautiful tribute <3. We have yet to see Cloudchaser's bigger works in ranked, but they're showing themselves to be a good storyboarder!"},{"username":"cococolaco","userId":9579526,"isRookie":"TRUE","commenter":"Noffy","comment":"2018 is cococolaco's first foray into storyboarding, and the resulting learning process resulted in their first storyboard for their mapset \"Endorfin.\" Let's hope to see more from them in the future and how they grow if they decide to continue storyboarding!"},{"username":"ComfyWolf","userId":6255933,"isRookie":"FALSE","commenter":"WildOne94","comment":"ComfyWolf's storyboard on \"*namirin - Kanade\" is very fitting to it's music material, giving off a wonderfully light-hearted vibe and also it's emotions conveyed. I specifically love the use of the 3 facial expressed backgrounds ranging from nervous to happy depending on the intensity of the song. The lyircs transition very smoothly and calmy to match the vibes. The kiai's are made interesting with the use of particles and different coloured backgrounds. A nice touch in which I would like to see in other storyboards is a timer as this one has to let people know how long they have been playing for. Finally we get a very lovely ending background which can make you feel very.... Comfy! Can't wait to see what warm and heartfelt storyboards ComfyWolf will have in the future!"},{"username":"Coppertine","userId":7279762,"isRookie":"TRUE","commenter":"Hokichi","comment":"Despite being a new face, Coppertine showed us what he's capable of with 2 of his ranked storyboards. While skyshifter vip gives up the feeling of a fancy storyboard, Beggars gives us the rush of a hardcore song. Even though his 2 ranked storyboards did not show us much of his ability, I myself have seen many amazing work from him. Not just stopping at making storyboad, he's also a very helpful member of the storyboarding community by giving lots of help to other member in need. To me, Coppertine is a very good storyboarder with a lot to provide. I'm really looking forward to see what he'll offer us in 2019!"},{"username":"Cosmolade","userId":2172778,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"Though their storyboards aren't going around guns blazing, they surely get the job done, from their Undertale SBs and otherwise. Clean visuals, and aesthetics that match the song choice, any Cosmolade SB is a welcome addition to spicing up a map. Hope to see more!"},{"username":"CSLM","userId":2675027,"isRookie":"FALSE","commenter":"WildOne94","comment":"Oh my! What a pretty storyboard \"fhana - Kimi to Iu Tokuiten [singular you]\" is! From the beautiful sunlight rays to the interesting particles that keep changing throughout to show interest to the watcher with it's very colourful elements like the rainbow shown. The lyrics use a nice clean and big font in which transition so smoothly. The key feature in this storyboard is the details that change over time as well as adding new elements to the mix, making it interesting to watch throughout. CLSM has made one of the prettiest storyboards I have ever seen and I can't wait to see what's next from this awesome creator!"},{"username":"Damnae","userId":989377,"isRookie":"FALSE","commenter":"WildOne94","comment":"Damnae is no stranger to storyboards as you can see in some beamaps like \"Nekomata Master - Far east nightbird (kors k Remix)\". He has shown in \"BUTAOTOME - Waizatsu Ideology\" that the simpler SBs are also effective, via excellent use of simple swaying lyrics and background brightness depending on intensity. Also providing beautifully done light particles and an ending well in time with the music. Damnae also is the creator of Storybrew, a program used by many storyboarders today in creating their works. Damnae is \"Da man\" and I highly suggest looking at his other SBs created. He's Damn(ae) good!"},{"username":"Damnjelly","userId":1666355,"isRookie":"TRUE","commenter":"Noffy","comment":"Damnjelly's one ranked SB in 2018 was a feat of patience and pure determination, in \"Iwashi ga Tsuchi kara Haete Kurunda\" also known as \"Sardine map\" among its fans, Damnjelly went above and beyond. Instead of just including a video with the mapset, they recreated the entire video using over 2000 image files total from the different animation sprite folders. It's one of those storyboards you'll just see and be amazed isn't a video, especially when it is their first ranked mapset and storyboard."},{"username":"Darky1","userId":3372928,"isRookie":"FALSE","commenter":"WildOne94","comment":"Darky1's dedication and top quality Storyboards have shone in 2018 with five ranked storyboards! (One being a collaboration). Time and time again we see mind boggling masterpieces that can only come from an Darky1. Take for example the mapset \"Eleharmonica remixed by kors k - Der Wald (kors k Remix)\" by Cheesecake and see how extraordinary every single element is in the storyboard, especially after the first kiai with it's insane coloured shapes dancing in time with the music. The hours of work gone into every polished storyboard is too much to explain in one paragraph! If you haven't seen or heard of Darky1's storyboards then go watch one right now! Seriously!"},{"username":"Deppyforce","userId":5286213,"isRookie":"TRUE","commenter":"","comment":"doesnt sb"},{"username":"Diasios","userId":25999,"isRookie":"","commenter":"yaspo","comment":"Storyboards don't have to be flashy to stand out .. or do they? While simple, with a few handily crafted flash effects Diasios manages to bring out the most intense moments of any song. If they keep it up and expand their ideas, I'm sure there's a bright future ahead of Diasios!"},{"username":"DJNightmare","userId":70909,"isRookie":"FALSE","commenter":"Coppertine","comment":"The first thing that comes to mind when you think about DJNightmare is the accurate recreations and amazing storyboards back in the days that made it fell like it came from an offical music video. Nowadays, he is still out there helping other storyboarders along their journeys and to follow his footsteps for leading storyboarders to make the best out of their designs."},{"username":"Doj","userId":4121612,"isRookie":"TRUE","commenter":"Noffy","comment":"Simple yet effective, Doj's storyboard for \"Masshira na Yuki\" is sparkly in a way not commonly seen, but really fitting to the feeling and content of the song. This is further added by the sparkling speeding up in the second chorus, which works super well!"},{"username":"Down","userId":4694602,"isRookie":"FALSE","commenter":"scub","comment":"Down is most infamous for his storyboard work on Arcana Force (legendary storyboard by the way, 10/10 would recommend), but aside from that, Down has certainly made serious storyboards in 2018, one of them being Passacaglia. Passacaglia has such a simple premise and concept, yet Down is able to bring such an idea to a degree where it's actually entertaining to watch! Great stuff from a competent mapper, too! Waiting for 2019 to see more of Down's storyboards!"},{"username":"Enkrypton","userId":5178122,"isRookie":"FALSE","commenter":"Coppertine","comment":"Working up the ladder to Mappers Guild Storyboarder, he has made himself a promonent figure within the community from the Simple yet exquisite projects to the complex and breathtaking feats such as Libera me. and Gacho - His first \"Mappers Guild\" Storyboard (Libera me is first Featured Artist, before Cranky became one). We hope for the amazing work during the comming year or two!"},{"username":"Enon","userId":2043401,"isRookie":"","commenter":"yaspo","comment":"Scratching guitars play underneath a black screen, building suspense until the words \"Image Material\" start of the experience. Enon matches this intense classic by giving you a pair of wings to accelerate into the most intense sections of the song. Making players' hearts race with storyboard, song and map makes us excited to see Enon's next works!"},{"username":"Erasome","userId":4422807,"isRookie":"TRUE","commenter":"Darky1","comment":"We have seen two ranked Storyboards by Erasome this year that showed, that Erasome isn't just good with flashy particle effects, but also showed that subtle minimalistic effects still have a place in storyboarding, and that they are able to use them! M2U - PandorA shows the flashy side of things, while 7 Minutes Dead - The Follower shows us that subtlety can improve a map's gameplay quality just as good. Definitly someone to look out for at the top this year!"},{"username":"FadillSan","userId":7006830,"isRookie":"","commenter":"yaspo","comment":"Even though Fadillsan mostly focuses on lyrics in their storyboards, all the extra details like broken glass effects and dropping particles definitely add a level of detail! Fadillsan has already storyboarded their way into 2019, so we don't doubt they'll continue polishing their work!"},{"username":"fanzhen0019","userId":418699,"isRookie":"","commenter":"yaspo","comment":"Never had I thought to be able to associate playing the flute with such an intense experience. Fanzhen's storyboard for \"KAEDE\" surprisingly pulls it of, making this map more eventful with just a few resources. Won't be surprised to see more creative twists from Fanzhen, but they're most definitely welcome!"},{"username":"Faputa","userId":845733,"isRookie":"TRUE","commenter":"Noffy","comment":"Taiko storyboards are unfortunately not very common, but Faputa in his map for \"Love Song\" does one to good effect. Faputa does well in keeping in mind the taiko playfield to put the lyrics above and the background below, and it's a really nice way of working around how taiko gameplay looks while still having an effective storyboard. And with their recent \"dragonlands\" storyboard, it's easy to see they're already improving a lot! I'm looking forward to see what Faputa does next."},{"username":"Firis Mistlud","userId":2433720,"isRookie":"TRUE","commenter":"yaspo","comment":"For a first storyboard First Mistlud really put in everything you could offer. Like, everything. Spectrums, background changes, animated cursor, gd name animations, sparkle particles and more! You definitely won't get bored as there's always something new to see, so hopefully Firis has something new for us to see this year as well!"},{"username":"Fursum","userId":4865030,"isRookie":"TRUE","commenter":"scub","comment":"On the side along with mapping, Fursum also makes simple yet modern-looking and aesthetically compelling storyboards. Looking at his storyboard for Raccoon City should make it clear too! His knowledge in modern font choices and layouts in his storyboards is enough to carry him high in the design section, and we can't wait to see what he'll bring this year!"},{"username":"Fushimi Rio","userId":1205412,"isRookie":"FALSE","commenter":"scub","comment":"Fushimi Rio has been known for creating great content for the ranked section, buuuuuut that isn't what we're supposed to talk about here. Instead, we're supposed to talk about his simple yet legible and authentic designs within his storyboard work in 2018. While they are not truly eye-candy or visually stimulating in any way, Fushimi Rio's storyboards aren't supposed to be like such. He tries to provide a closely authentic experience you get from reading a visual novel by incorporating the plot itself, mainly put through the games' art and graphics. Go play a map along with the storyboards of his, as they are definitely worth your time!"},{"username":"Garven","userId":244216,"isRookie":"","commenter":"Noffy","comment":"Garven's storyboard for \"Irus - Jue\" which was ranked in 2018 is actually from early 2015. His storyboard and mapset were then adopted by eiri- and ranked after over 3 years. Although the storyboard is actually pretty old, it's still really neat and effective! It has three basic scenes, clouds, Kokoro, then another Kokoro with the original clouds. There's lots of neat details such as the transition from clouds to Kokoro which feature ominous smileys and an animated Kokoro sprite that work really well to add to the experience, this storyboard is worth checking out and definitely stood the test of time!"},{"username":"Gero","userId":1467715,"isRookie":"FALSE","commenter":"Noffy","comment":"Gero has ranked two super cute storyboards this year! One is \"Til Death\" (hosted by Andrea) which revisits Andrea's set of the same song from 2013, and the storyboard makes use of many of the same ideas from XinCrin's 2013 storyboard while ultimately producing something new. Gero's other storyboard for his own mapset \"Jump Up, Super Star!\" features a lyrics storyboard with a twist! Many words are replaced with images that say the same thing, and it's really super neat. Gero is super cool beans in both mapping and storyboarding!"},{"username":"GoldenWolf","userId":1612624,"isRookie":"FALSE","commenter":"Noffy","comment":"GoldenWolf is an epic dude who will stop at nothing in his quest of mapping as much Demotori as possible. Several of his Demetori maps also include fairly simple yet effective SBs. The moral of this story: Demetori will one day rule the world if GoldenWolf has his way. Stay on the look out!"},{"username":"Gordon123","userId":2789905,"isRookie":"FALSE","commenter":"yaspo","comment":"For calm songs you need calm effects. Gordon123 shows this cleanly with storyboards that have their own take on hueshifting, representing day and night by smoothly using the colorful transitions of a sunset. Simple does it, and we hope Gorden123 does it more this year!"},{"username":"Half","userId":7515767,"isRookie":"TRUE","commenter":"scub","comment":"Half is a Korean storyboarder who, despite only ranking their first storyboard in 2018, feels like they've been doing it for much longer! With their modern and highly legible design choices, they definitely give the maps they storyboard a whole new feel to it, no matter how simple they may be. With prodigies like them, 2019 is definitely looking bright!"},{"username":"HaruHong","userId":2971423,"isRookie":"TRUE","commenter":"yaspo","comment":"Finally Haruhong gets their storyboards to the ranked section, a well deserved feat! Through clever use of framing on \"ONLYWONDER\" they do a great job at presenting the lyrics in a unique fashion. With a start this great, we can only wonder how far Haruhong will go this year!"},{"username":"Hokichi","userId":6607303,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"What is there to be said about Hokichi that hasn't been said already? Genuinely one of the greats in the storyboarding community, and someone whom I've looked up to since the beginning. Seeing from his impressive list of storyboards, they have a distinct, unmatched visual style that could rival that of anime openings, something that almost feels trademarked to Hokichi now. Unfortunately he is bogged down by university and work, so he doesn't have much time to work on SBs currently, but there is no doubt in my mind that he'll come back with storyboards that'll go beyond expectations!"},{"username":"Hollow Wings","userId":416662,"isRookie":"FALSE","commenter":"Darky1","comment":"Hollow Wings made Storyboards?!? Yes! While Ishida Yoko - Negai's Storyboard isn't groundbreaking, it still shows that Hollow Wings isn't afraid of getting their hands dirty! And who knows? Maybe 2019 will see Hollow Wings reinvent modern Storyboarding!"},{"username":"Hoshinomori","userId":4112621,"isRookie":"TRUE","commenter":"TheDuckMask","comment":"New face, new storyboard, and for none other than man himself, Sotarks and his set \"GALNERYUS - RAISE MY SWORD\". A faily simplistic lyrics SB, but has what it takes that could mark the start of the next big named storyboarder, were they to keep pursuing SBing. Rooting for ya!"},{"username":"Irohas","userId":4403937,"isRookie":"TRUE","commenter":"Hokichi","comment":"Irohas isn't strange to any of us when talking about mapping. He has contributed many good maps and guess difficulties, as well as his positive attitude towards other member of the community. However, I'm pretty sure not many of us in the community would expect a storyboard from him! Even though it's just a simple storyboard with flashing and color changing, it has showed that he knows what basic things he would need to progress further, which is very important for new storyboarders. I'm really hoping to see more storyboard work from Irohas in 2019!"},{"username":"Left","userId":5062061,"isRookie":"FALSE","commenter":"scub","comment":"The master of quit mapping himself, Left, has made a good storyboard of a great song in 2018, being Towa ni Saku Hana! With a vibe that screams memories and reminiscence while still having cutesy visuals, Left has brought to us something that fits the song well while still looking good!"},{"username":"IsomirDiAngelo","userId":7715620,"isRookie":"TRUE","commenter":"scub","comment":"Bringing something new to the ranked section is IsomirDiAngelo is his map of a seemingly cute and calm song. The star rating is about 7* but that shouldn't be a red flag, right? lmao of course not have some 200bpm+ metal for you to kill your fingers on. While that's a thing, we can't really forget the storyboard showing some of the wokest moments of the map. Storyboards like these are pretty much mandatory anyways, because how else would you convert to such a surprising part of the song without having major contrast through changing pictures in the storyboard? And on an unrelated note, I can't stop thinking of the WOKE meme looking at the middle chorus section. All that being said, good stuff like these are what we're looking forward to in 2019!"},{"username":"Jakomo73","userId":2757426,"isRookie":"FALSE","commenter":"Hokichi","comment":"Do not, I repeat, DO NOT underestimate this guys for his storyboard works. They are extremely amazing, and will definitely bring pleasure to whoever watching it. Not too complicated, yet not simple either, Jakomo's works are \"the best of both worlds\" (to be continued...)"},{"username":"JarvisGaming","userId":8601048,"isRookie":"","commenter":"yaspo","comment":"For a moment I thought their first storyboard was glitched .. but that means it's working just as intended! With a varied range of effects, JarvisGaming manages to give each section of \"Colorful\" its own colorful flavour. Hoping to see more from this gamer in 2019!"},{"username":"JBHyperion","userId":4879508,"isRookie":"FALSE","commenter":"Noffy","comment":"It's already impressive to make and rank a spread of a song 7 minutes long where he did ~4 difficulties worth of mapping, but on top of that, JBH's \"Halozy - 143\" catch mapset features a storyboard by him too! Primarily a lyrics SB, it has a lot of small details and variations in how lyrics are presented that definitely took additional time and effort just to make the experience of playing the maps that much better."},{"username":"Jonawaga","userId":3653035,"isRookie":"FALSE","commenter":"Noffy","comment":"He may have quit osu! now, but the works Jonawaga left behind are still pretty nice. He has often made an interesting use of color, such as in his first ranked map from 2016 \"Alone In Kyoto\". This reappears this year in his storyboard on Xayler's \"Slow Dive\" mapset as well as his own mapset \"What Child Is This\". In both cases, the use of colors fiits well and work with Jonawaga's own simple but effective storyboard style. Hopefully Jonawaga does well in his future life endeavors!"},{"username":"KaedekaShizuru","userId":2248417,"isRookie":"","commenter":"scub","comment":"Kaedeka is known for his guest difficulties in a lot of eroge maps involving PinkHeart and Fushimi Rio, but aside from that, he's also a great storyboarder who's made simple, yet vibey and impactful storyboards like Euphorium. Only with simple transitions and lyrics, yet he's apparently able to give huge impact through his design choices! If one can create such impact with such a simple design, I would be terrified in what happens when Kaedeka puts his efforts into creating complex storyboards. Perhaps in 2019!"},{"username":"Kanari","userId":891115,"isRookie":"FALSE","commenter":"scub","comment":"Out of all the underrated names in the storyboarding community, Kanari comes up as one of the most underrated of them all. Despite her capability of making visually stimulating storyboards with stood-out effects specialized to her own style, she is, somehow, still not very well known yet! For that, I'd like to take this moment to say something real quick. That is, you'll have to check at least one of her newer stuff, such as her collab part on \"A Sugar Business\", or her 2018 published storyboard for \"YUKARI\". I'm 100% sure that her stuff will have your eyes stuck to the screen, just as it did with mine!"},{"username":"Kawa","userId":4588894,"isRookie":"","commenter":"yaspo","comment":"If I had to describe Kawa's storyboarding in one word, it would be \"atmosphere\". Especially their version of \"Irony\" flawlessly expresses the floaty demeanor of the song by combining a continuous stream of particles, wings and gently dispersing lyrics. Refreshing to see storyboards be used to express the song's feeling, so I'm hoping to see more of Kawa's work in the future!"},{"username":"Kencho","userId":3178411,"isRookie":"","commenter":"WildOne94","comment":"Kencho's collaboration with yf_bmp on \"Dear Jane - Lost\" provides beautiful high quality images from the original music video which tells it's own story in a shorter manner. A striking moment for me was the start of this storyboard, which shows a lovely and well timed series of pictures lighting a match fitting perfectly in time with the opening of the song. Each transition is smooth and well fitted to the song throughout. All we really need to say now is... Ken Cho make more storyboards ? (sorry that was a bad pun)."},{"username":"Kuey","userId":5136195,"isRookie":"FALSE","commenter":"yaspo","comment":"With a sweet storyboard that will make your heart light up, Kuey accompanies the gentle Undertale OST \"An Ending\". Despite Kuey not making storyboards often, they always have a kindred touch that goes a long way. I really hope this wasn't an ending to their work!"},{"username":"Kuo Kyoka","userId":2596306,"isRookie":"FALSE","commenter":"Hokichi","comment":"Ah, who could possibly forget this famous mania guy, and his ANiMA storyboard. Kuo has left us with amazing storyboarding works. His works aren't anything complicated or technical, but extremely visual pleasing. Plus, all of his works are manually coded by editing the .osb file! Unlike -Tochi (who used to make storyboard the same way of him), he aims for a more simplistic way. It seems like he's not a very active member anymore, but who knows. I bet most of us is expecting a big comeback from him"},{"username":"LowAccuracySS","userId":7306763,"isRookie":"TRUE","commenter":"TheDuckMask","comment":"New to the scene, and was once mentored under PoNo himself, LASS makes waves as he brings in 4 new ranked SBs in 2018 alone! Even though being amongst that of a simplistic nature, in no way does it take away from what they aim to accomplish. Clean, thematically appropiate and straight to the point are what these SBs excel at. Seems to be continuing SBing well into 2019, so can't wait to see more from him!"},{"username":"m980","userId":3288,"isRookie":"","commenter":"scub","comment":"Do you remember that one storyboard that got on lots of gaming news sites? That one Ace Attorney storyboard made for a Queen map back in like, 2009? Well here we go again ladies and gentlemen, a blast from the past, as m980 made another storyboard in the same fashion! With a cutely designed EBA style storyboard, this is sure to relive your 2009 self!"},{"username":"Megapcmx","userId":4442138,"isRookie":"FALSE","commenter":"Coppertine","comment":"The promonent storyboard that came to this year is the League of Ledgends music video for the Worlds 2018 campain. The music video itself was a hard to work with size, but with powerfull animations and promonent moments from the journey to the summit, his storyboard truly did stand out as one of the masterpieces of the time."},{"username":"Milan-","userId":1052994,"isRookie":"FALSE","commenter":"Noffy","comment":"Milan-'s storyboard \"Aurora\" is one of the top tier ones of 2018. It is a really remarkable work, using a very strong visual style and excellent technical effects that complement the mysterious yet elegant tone of the music incredibly well. Additionally, a large amount of it is based off of object placement in a way different from usual hit-object lights, and it helps to make each difficulty a more immersive experience with the storyboard on. It's straight up beautiful!"},{"username":"Mykaterasu","userId":4110225,"isRookie":"TRUE","commenter":"Noffy","comment":"Mykaterasu's first ranked storyboard on \"Myosotis\" (mapset hosted by Akareh) is certainly a sight for sore eyes. They make use of a mix of excellent aesthetic sense and technical ability to create a truly beautiful storyboard that fits the contrasting sections of the song extremely well. I can't say in words just how amazing it is, so be sure to go check their work out! Additionally if you want to see their other storyboards, they presently have an easy to access list of them on their userpage too."},{"username":"Nerova Riuz GX","userId":1557955,"isRookie":"TRUE","commenter":"Hokichi","comment":"Skilled mapper? Skilled storyboarder? Nerova has them both. Don't believe me? Check out his \"Quaoar\" set and be amazed. The storyboard (and the map) really showcased his skills. But this ain't his first work. All of his work are just as amazing as this one. Though he's not really active, I'm hoping he would keep us entertained in 2019!"},{"username":"Noffy","userId":1541323,"isRookie":"FALSE","commenter":"scub","comment":"This commentary has been blessed by the :blobcat: \n\nNoffy told me in DM once that she isn't particularly well versed in programming, yet here she is, creating storyboards everyone can enjoy! She's mostly known for her storyboards for the Mappers' Guild project, and despite her limitations, she is still able to make visually interesting patterns both simple and complex! All that being said, we absolutely can't wait for more of her new stuff to come out!"},{"username":"Nokris","userId":5960077,"isRookie":"TRUE","commenter":"scub","comment":"Not only is he able to make visually attractive maps such as his rendition of Luminous Rage, but Nokris definitely has the skills needed to make storyboards just as visually interesting! Looking at storyboards such as one within the map mentioned before, Nokris tackled rather niche storyboard elements such as frame-by-frame animations, then completely pushes those elements to the absolute cutting edge, while still programming it in a way that's well-optimized too! Definitely looking forward for more stuff from him in 2019!"},{"username":"nold_1702","userId":515967,"isRookie":"FALSE","commenter":"Noffy","comment":"nold_1702 (now known as Ulysses) is multi-skilled, creating in their mapset \"Nostalgic (Nightcore Mix)\" multiple awesome difficulties as well as an incredible storyboard that really show the wide variety of what is possible in the medium. In their storyboard they make use of multiple animations, different scenes for each part of the song, and a super wide variety of effects to make an experience that is very much a full music video that can stand on its own. If the storyboard is too intense to run for you in-game, check out the youtube showcase of it here: https://youtu.be/S3kDebcTmKI"},{"username":"Ohwow","userId":3028729,"isRookie":"FALSE","commenter":"WildOne94","comment":"Ohwow has provided a unique taste on lyric storyboards as seen in Gaia’s map \"Takagi-san (CV: Rie Takahashi) - AM11:00\". First and foremost, it was a great experience seeing the many variety of ways its lyrics were shown with special little details that add beautiful finishing touches like the bubbles. Ohwow also hits us with sudden changes in his storyboard such as a scene transition into falling cherry blossoms and seeing the thoughts of Takagi adding a WHAM! to the mix. I very much look forward to seeing what Ohwow makes next as this project was handled very well and much care was put into it. The future for this storyboarder will surely make us all go “Oh wow!”."},{"username":"Peter","userId":8623835,"isRookie":"FALSE","commenter":"yaspo","comment":"While Peter has built a fairly safe and consistent style for their storyboarding, details like unique font choices go a long way to make them fit the song. Curious to see if Peter will expand to using more effects, or if he'll stick with what he knows best."},{"username":"PoNo","userId":4610047,"isRookie":"FALSE","commenter":"Coppertine","comment":"Short for Ponoyoshi, PoNo has been the face of Sotarks' storyboarded maps; as well as taking multiple top awards from the MCA. Starting the year off with SkyshifterVIP (which I appreciated the help along side with both him and Darky1); He went to making Small but elequent storyboards that still capture the eyes of each person playing the map."},{"username":"Realazy","userId":918297,"isRookie":"","commenter":"Noffy","comment":"Realazy collaborated with me in making the standard storyboard for \"Party in the HOLLOWood feat. Nanahira\", which is first and only finished work (!!!FOR NOW!!!). His parts display well that he's gotten a hang of the basics, as well as having a good taste! It was super neato for me to work together with him on that project :>. He hopes to do more in the near-ish future and I'm excited to see how it goes, he just needs to stop being real lazy and make more stuff."},{"username":"Regou","userId":419954,"isRookie":"TRUE","commenter":"TheDuckMask","comment":"Though better known as a mapper, Regou has also dabbled in storyboarding, particularly for their own sets. Despite their simplistic nature, Regou is able to represent a song through storyboard in a concise visual manner that is seemlessly integrated into the mapset as a whole. Although done through using effects that one has seen a dime a dozen, they've been used in a way that only enhances the BG provided. Whether they decide to take storyboarding further on their own accord or not, Regou shows great potential to make something truly outstanding, apparent from the aesthetics of their existing storyboards."},{"username":"Rekkursion","userId":3358261,"isRookie":"TRUE","commenter":"yaspo","comment":"Despite this being their firs storyboard, Rekkursion shows plenty of potential. With well-placed fades and lyrics impactfully droppping at the key moments of \"Arcadia\", they defintely have the right mindset. Hoping to see them grow and polish their work this year!"},{"username":"rrtyui","userId":352328,"isRookie":"TRUE","commenter":"Darky1","comment":"Most seasoned osu! players first got to know rrtyui as one of the best players of their time, but rrtyui doesn't just exceed in playing the game, rrtyui also made some of the better known maps to date! So it shouldn't come to a surprise that rrtyui follows this trend in 2018 with one storyboard that stands out from the rest. Reality Distortion shows us that rrtyui doesn't just know what plays well, but also knows what looks good and how to go around the limits of storyboards!"},{"username":"ShallICompareThee","userId":936088,"isRookie":"FALSE","commenter":"scub","comment":"ShallICompareThee, or SICT/Shalli for short, is a storyboarder famous for helping out with the storyboards of most of Hollow Wings's more famous maps, but they definitely have more knowledge than just particles following the objects. I've been told by someone that While SICT is not the best at creating general eye candy, they are able to recreate a lot of advanced effects when told to. Looking at their storyboards, especially ones in collaborative form, that seems to be true as well! That said, we definitely wish for more stuff from them in the coming year!"},{"username":"Sharlo","userId":1622450,"isRookie":"FALSE","commenter":"Noffy","comment":"A mapper, singer, and storyboarder too, Sharlo's skills are widespread and she is certainly great at all of these. Her ranked storyboard this year for \"chrono driver -fragment-\" is elegant and fitting to the context of the song by using a variety of clock related imagery, while not ever being too distracting from the experience of playing her and Chaoslitz' collab marathon."},{"username":"Shmiklak","userId":5504231,"isRookie":"","commenter":"Hokichi","comment":"Looking at Shmiklak's works, I can't help but amazed by them. Because those are actually decent ones! Shmiklak is not new to storyboarding, with his lyrics storyboards. But his Red Lips storyboard blew me away. His use of particles and lighting are just, perfect. Please keep us entertained in 2019 as well!"},{"username":"Sinnoh","userId":4236057,"isRookie":"TRUE","commenter":"TheDuckMask","comment":"Were I to describe Sinnoh's storyboards in one word, it would be complimentary. Many of his storyboards compliment the sets they accompany through and through. By its simple demeanour, they faithfully reflect the vibe each song gives off respectively, from the cool, Wintery settings of his Wisp X sets, to his glitch riddled effects in his \"forest of the spirits\" set. Whether making SBs for himself or others, I can't help but smile over their uncomplicated charm."},{"username":"smau5","userId":5084531,"isRookie":"FALSE","commenter":"Coppertine","comment":"smau5 (I think it's pronounced Samus) is mostly known for being storyboarder of the top favorated map ILY. However, his storyboards are not exactly what you expect. With one of his main Storyboards \"Suki Suki Zetchucho\" has shown the tallents have gone sky high with how much effort has gone into both the sb and the minor details for a 270bpm alternate map that gives nodds to Okanainesai."},{"username":"Smokeman","userId":2140676,"isRookie":"TRUE","commenter":"Darky1","comment":"How do you have a big impact with without fancy effects? Ask Smokeman! His kensuke ushio - lit(var) shows just how well you can emphasise the mood and feel with one single transition! We can only hope to see plenty more of it in 2019!"},{"username":"Spectator","userId":702598,"isRookie":"","commenter":"scub","comment":"Aside from being an amazing CtB mapper, Spectator has also made his way to becoming a storyboarder who's shown their skills in making simple yet effective storyboard works! Looking at maps such as \"Marigold\" and \"EGOiSTiC SHOOTER\" showcases great usage of simple particles and effects, and it's no doubt that his works accompanied the maps he's created very well."},{"username":"Spkz","userId":2964029,"isRookie":"TRUE","commenter":"Noffy","comment":"Spkz's Storyboard for \"Itsuwaranai Kimi e\" (hosted by Shurelia) is simple, cute, and makes effective use of CGs from the game Rewrite to add a little extra touch to the map. They even positioned particles in the kiai to come from the field instead of the entire screen, which helps them to fit well into the scenery. With attention to detail, it's pretty nice as their first ranked storyboard!"},{"username":"Starset","userId":6383137,"isRookie":"FALSE","commenter":"yaspo","comment":"A little bit of waiting, but when \"Fractures\" by Illenium finally drops, Starset's storyboard does too. Formerly known as HB24, Starset shows that they have no trouble going from 0 to 100 by combining a lot of effects without it feeling overdone or out of place. With clever introductios they really put their experience to good use, so we're hoping Starset continues doing so in the future!"},{"username":"Storyboarder","userId":6124671,"isRookie":"FALSE","commenter":"scub","comment":"Storyboarder is known for their collaborative work with other mappers towards designing very well made storyboards on electronic songs. While most of their storyboards consist of a formulaically consistent combination of character renders and particles, they have also made storyboards which are nearly fully animated, such as his work on Sweet Dreams (11t remix). Either way, both of these types are really well executed and visually stimulating, and we would definitely look forward to what they do in 2019!"},{"username":"Sun Rainbow","userId":648885,"isRookie":"FALSE","commenter":"yaspo","comment":"With years of experience, the polish Sun Rainbow brings into their works is a sight to behold. While clean lyrics and nice particle effects are a given, their storyboards are full of small details. Subtly moving backgrounds, cute storytelling and small animation changes to represent the change in a character's mood bring a level of depth that makes each work come to life. Even with the leaving note on Sun Rainbow's profile, the works they leave behind are definitely worth a recommendation."},{"username":"Sytarno","userId":6160235,"isRookie":"FALSE","commenter":"Hokichi","comment":"Although his storyboards are fairly simple ones, it shows perfection in each and every single effect he implements. Everything from simple things such as lyrics, particles,... to complicated stuff such as particle lyrics, animation,... are done with total perfection. You can tell no flaws in his effects. Even though he hasn't been making anymore storyboards, I hope to see more of his works in the future, because I can't get enough of those!"},{"username":"Tatan","userId":5646529,"isRookie":"FALSE","commenter":"yaspo","comment":"~Un, dos, tres, calypso~ Tatan brings us the summer vibes with their exciting map and storyboard for Louis Fonsi's calypso. With a colorful spectrum to match the song it's impossible to not groove out while playing along the beat! Curious to see what other tunes they'll make a storyboard for this year."},{"username":"TheDuckMask","userId":7405768,"isRookie":"FALSE","commenter":"scub","comment":"TheDuckMask has definitely made lots of lo-fi hip hop maps a lot more enjoyable since 2017, and it doesn't take a lot to know that she's still creating good content to this day! Through storyboards like \"rain jacket over a puddle (ft. salami rose)\", DuckMask expresses the calmness yet modern feel of the song quite well through her simple yet mesmerizing execution. That being said, we look forward for more content from this storyboarder in the coming year!"},{"username":"tokiko","userId":2836455,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"Now, while tokiko's mapping is the star of the show for their sets, the storyboards they make introduce concepts not seen in many other maps/storyboards. Even though they are simple, their storyboards for \"moro - Pain Room\" and \"Diao ye zong - Owaranu Matsuri\" (especially old feast) bring in slight horror elements that induce an uneasy feeling, and what I feel, could lead into truly memorable experiences were the concepts developed further. Great job for taking the first steps into such a territory, and hope to see if they'll do more with storyboarding!"},{"username":"Ultima Fox","userId":3198109,"isRookie":"FALSE","commenter":"Noffy","comment":"Ultima Fox really, really, really, really, REALLY, likes the Ancient Magus Bride, and his passion shows in the storyboard for \"Tsuki no Mou Hanbun\", a theme song from the series, which contains an elegance and detail which is well-balanced with making it not too distracting from the difficulties he also made. It really shows how much they care for making the best experience possible and is an awesome display of how skilled he has become at storyboarding."},{"username":"Xenok","userId":3256600,"isRookie":"TRUE","commenter":"Noffy","comment":"Xenok's storyboard for \"Yuki no Hana (GoldenWolf -METAL MIX-)\" is just as woke as the song and map. A true work of art. As well as their storyboard for \"Yumemigachi na Cream Puffle [Crossfade]\" which is suuuper duuuper cute, this storyboarder definitely has taste in what they make and have graced us with. Be sure to check them out!"},{"username":"Yahuri","userId":4682629,"isRookie":"FALSE","commenter":"Noffy","comment":"When it comes to Yahuri, her storyboarded mapsets can really be described as \"full experiences\". Both of her storyboards ranked in 2018 year employ not just the storyboard but also skinning and combo color usage to tie a mapset together and create one aesthetic that makes the map really feel like it's own isolated level in a game. While the individual effects are simple, they're really effective in making an experience more immersive and enjoyable overall. Also, she makes cute art that will hopefully be showing up in her future storyboards too. Count me a massive fan!"},{"username":"yf_bmp","userId":1243669,"isRookie":"FALSE","commenter":"scub","comment":"This guy makes me jealous. Not only is yf_bmp an amazing mapper who's able some of the best visually thematic maps, but as an experienced programmer himself, he's also really good at creating complex storyboards. With his latest ranked map, Benibotan, yf_bmp has basically flexed his skills in recreating entire rhythm game BGAs to us. And best part is that it's probably not even his best storyboard yet. He's created lots of great storyboards over the past few years that you should download to enjoy as well!"},{"username":"Yumeno Himiko","userId":1806962,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"An extremely talented programmer, an extremely talented CTB mapper, and most importantly, an extremely talented storyboarder. Started out back in 2014 and has since, accumulated quite the portfolio. Not the most active of the community, but when Yumeno Himiko drops a new storyboard, they're surely to blow me away, with \"Eisyo-kobu - Oriental Blossom\" being their best one to date. Was even made on their very own storyboard engine (in collaboration with yf_bmp & [Mahua])! Storyboards that flourish through their technical standpoints, it's always a joy to see a new SB from them."},{"username":"Zer0-","userId":4260033,"isRookie":"FALSE","commenter":"TheDuckMask","comment":"Though primarily a mapper, they've had a couple or so attempts at storyboarding at some points in time. Their newest SB for Benny-'s \"FELT - Songs Compilation\" set is only a taste of what they could be capable of, as they have made much more complex storyboards in the past. I hope to see if they could take storyboarding much further, as I believe they can do it!"},{"username":"Zerss","userId":3683794,"isRookie":"FALSE","commenter":"Hokichi","comment":"A used-to-be very dedicated storyboarder, Zerss has given us some amazing works with his talent. Simplistic as they are, they never dissapoint us. Though he isn't as hard-working in 2018 as he used to be, his collab with Gordon123 and Down certainly did not let us down! I'm sure to look forward to his grand comeback in 2019 and give us more of his talent to us."}]